{"id": "K.CC.A", "description": "Zahlwörter und die Zählsequenz kennen."},
{"id": "K.CC.A.1", "description": "Bis 100 in Einerschritten und in Zehnerschritten zählen."},
{"id": "K.CC.A.2", "description": "Von einer beliebigen Zahl innerhalb der bekannten Zahlenfolge vorwärts zählen (anstatt bei 1 beginnen zu müssen)."},
{"id": "K.CC.A.3", "description": "Zahlen von 0 bis 20 schreiben. Eine Anzahl von Objekten mit einer geschriebenen Ziffer von 0-20 darstellen (wobei 0 für keine Objekte steht)."},
{"id": "K.CC.B", "description": "Anzahlen von Objekten durch Zählen bestimmen."},
{"id": "K.CC.B.4", "description": "Die Beziehung zwischen Zahlen und Mengen verstehen; Zählen mit dem Kardinalzahlaspekt verbinden.\nInhalt dieses Standards:\n - Verstehen, dass jedes nachfolgende Zahlwort eine um eins größere Menge bezeichnet.\n - Verstehen, dass das zuletzt genannte Zahlwort die Anzahl der gezählten Objekte angibt. Die Anzahl der Objekte ist unabhängig von ihrer Anordnung oder der Zählreihenfolge.\n - Beim Zählen von Objekten die Zahlwörter in der richtigen Reihenfolge nennen und dabei jedem Objekt genau ein Zahlwort und jedem Zahlwort genau ein Objekt zuordnen."},
{"id": "K.CC.B.4a", "description": "Beim Zählen von Objekten die Zahlwörter in der richtigen Reihenfolge nennen und dabei jedem Objekt genau ein Zahlwort und jedem Zahlwort genau ein Objekt zuordnen."},
{"id": "K.CC.B.4b", "description": "Verstehen, dass das zuletzt genannte Zahlwort die Anzahl der gezählten Objekte angibt. Die Anzahl der Objekte ist unabhängig von ihrer Anordnung oder der Zählreihenfolge."},
{"id": "K.CC.B.4c", "description": "Verstehen, dass jedes nachfolgende Zahlwort eine um eins größere Menge bezeichnet."},
{"id": "K.CC.B.5", "description": "„Wie viele?“-Fragen durch Zählen von bis zu 20 Objekten beantworten, die in einer Reihe, einem rechteckigen Feld oder einem Kreis angeordnet sind, oder von bis zu 10 Objekten in einer ungeordneten Anordnung; zu einer gegebenen Zahl von 1-20 die entsprechende Anzahl an Objekten abzählen."},
{"id": "K.CC.C", "description": "Zahlen vergleichen."},
{"id": "K.CC.C.6", "description": "Bestimmen, ob die Anzahl der Objekte in einer Gruppe größer als, kleiner als oder gleich der Anzahl der Objekte in einer anderen Gruppe ist, z.B. durch Zuordnungs- und Zählstrategien (beinhaltet Gruppen mit bis zu zehn Objekten)."},
{"id": "K.CC.C.7", "description": "Zwei als Ziffern dargestellte Zahlen zwischen 1 und 10 vergleichen."},
{"id": "K.OA.A", "description": "Addition als Zusammenfügen und Hinzufügen und Subtraktion als Auseinandernehmen und Wegnehmen verstehen."},
{"id": "K.OA.A.1", "description": "Addition und Subtraktion mit Objekten, Fingern, mentalen Vorstellungen, Zeichnungen (Zeichnungen müssen keine Details zeigen, aber die Mathematik im Problem verdeutlichen. (Dies gilt überall, wo Zeichnungen in den Standards erwähnt werden.)), Geräuschen (z.B. Klatschen), nachgespielten Situationen, mündlichen Erklärungen, Termen oder Gleichungen darstellen."},
{"id": "K.OA.A.2", "description": "Additions- und Subtraktions-Textaufgaben lösen und im Zahlenraum bis 10 addieren und subtrahieren, z.B. durch die Verwendung von Objekten oder Zeichnungen zur Darstellung des Problems."},
{"id": "K.OA.A.3", "description": "Zahlen, die kleiner oder gleich 10 sind, auf mehr als eine Weise in Paare zerlegen, z.B. durch Verwendung von Objekten oder Zeichnungen, und jede Zerlegung durch eine Zeichnung oder eine Gleichung festhalten (z.B. 5 = 2 + 3 und 5 = 4 + 1)."},
{"id": "K.OA.A.4", "description": "Zu jeder Zahl von 1 bis 9 die Zahl finden, die sie zu 10 ergänzt, z.B. durch Verwendung von Objekten oder Zeichnungen, und die Antwort mit einer Zeichnung oder Gleichung festhalten."},
{"id": "K.OA.A.5", "description": "Sicher im Zahlenraum bis 5 addieren und subtrahieren."},
{"id": "K.NBT.A", "description": "Mit den Zahlen 11-19 arbeiten, um Grundlagen für das Stellenwertsystem zu schaffen."}

{"id": "K.NBT.A.1", "description": "Zahlen von 11 bis 19 in zehn Einer und weitere Einer zerlegen und zusammensetzen, z.B. durch die Verwendung von Objekten oder Zeichnungen, und jede Zusammensetzung oder Zerlegung durch eine Zeichnung oder Gleichung festhalten (z.B. $18 = 10 + 8$); verstehen, dass diese Zahlen aus zehn Einern und einem, zwei, drei, vier, fünf, sechs, sieben, acht oder neun Einern bestehen."},
{"id": "K.MD.A", "description": "Messbare Eigenschaften beschreiben und vergleichen."},
{"id": "K.MD.A.1", "description": "Messbare Eigenschaften von Objekten wie Länge oder Gewicht beschreiben. Mehrere messbare Eigenschaften eines einzelnen Objekts beschreiben."},
{"id": "K.MD.A.2", "description": "Zwei Objekte mit einer gemeinsamen messbaren Eigenschaft direkt vergleichen, um festzustellen, welches Objekt „mehr von“/„weniger von“ dieser Eigenschaft hat, und den Unterschied beschreiben. Zum Beispiel die Körpergrößen von zwei Kindern direkt vergleichen und ein Kind als größer/kleiner beschreiben."},
{"id": "K.MD.B", "description": "Objekte klassifizieren und die Anzahl der Objekte in jeder Kategorie zählen."},
{"id": "K.MD.B.3", "description": "Objekte in vorgegebene Kategorien klassifizieren; die Anzahl der Objekte in jeder Kategorie zählen und die Kategorien nach der Anzahl sortieren. (Die Anzahl pro Kategorie ist auf 10 oder weniger beschränkt.)"},
{"id": "K.G.A", "description": "Formen identifizieren und beschreiben (Quadrate, Kreise, Dreiecke, Rechtecke, Sechsecke, Würfel, Kegel, Zylinder und Kugeln)."},
{"id": "K.G.A.1", "description": "Objekte in der Umgebung unter Verwendung von Formbezeichnungen beschreiben und die relativen Positionen dieser Objekte mit Begriffen wie über, unter, neben, vor, hinter und daneben beschreiben."},
{"id": "K.G.A.2", "description": "Formen unabhängig von ihrer Ausrichtung oder Gesamtgröße korrekt benennen."},
{"id": "K.G.A.3", "description": "Formen als zweidimensional (in einer Ebene liegend, „flach“) oder dreidimensional („räumlich“) identifizieren."},
{"id": "K.G.B", "description": "Formen analysieren, vergleichen, erstellen und zusammensetzen."},
{"id": "K.G.B.4", "description": "Zwei- und dreidimensionale Formen in verschiedenen Größen und Ausrichtungen analysieren und vergleichen, indem in informeller Sprache ihre Ähnlichkeiten, Unterschiede, Teile (z.B. Anzahl der Seiten und Ecken) und andere Eigenschaften (z.B. Seiten von gleicher Länge) beschrieben werden."},
{"id": "K.G.B.5", "description": "Formen aus der realen Welt modellieren, indem Formen aus Komponenten (z.B. Stäbchen und Knetkugeln) gebaut und gezeichnet werden."},
{"id": "K.G.B.6", "description": "Einfache Formen zu größeren Formen zusammensetzen. Zum Beispiel: „Kannst du diese beiden Dreiecke so aneinanderlegen, dass sich die ganzen Seiten berühren, um ein Rechteck zu bilden?“"},
{"id": "1.OA.A", "description": "Aufgaben mit Addition und Subtraktion darstellen und lösen."},
{"id": "1.OA.A.1", "description": "Addition und Subtraktion im Zahlenraum bis 20 verwenden, um Textaufgaben zu lösen. Diese beinhalten Situationen des Hinzufügens, Wegnehmens, Zusammenfügens, Zerlegens und Vergleichens, mit Unbekannten an allen Positionen, z.B. durch die Verwendung von Objekten, Zeichnungen und Gleichungen mit einem Symbol für die unbekannte Zahl, um das Problem darzustellen."},
{"id": "1.OA.A.2", "description": "Textaufgaben lösen, die die Addition von drei ganzen Zahlen erfordern, deren Summe kleiner oder gleich 20 ist, z.B. durch die Verwendung von Objekten, Zeichnungen und Gleichungen mit einem Symbol für die unbekannte Zahl, um das Problem darzustellen."},
{"id": "1.OA.B", "description": "Eigenschaften von Rechenoperationen und die Beziehung zwischen Addition und Subtraktion verstehen und anwenden."},
{"id": "1.OA.B.3", "description": "Eigenschaften von Rechenoperationen als Strategien zum Addieren und Subtrahieren anwenden. (Die Schüler müssen die Fachbegriffe für diese Eigenschaften nicht verwenden.) Beispiele: Wenn $8 + 3 = 11$ bekannt ist, dann ist auch $3 + 8 = 11$ bekannt. (Kommutativgesetz der Addition.) Um $2 + 6 + 4$ zu addieren, können die letzten beiden Zahlen zu einer Zehn zusammengefasst werden, also $2 + 6 + 4 = 2 + 10 = 12$. (Assoziativgesetz der Addition.)"},
{"id": "1.OA.B.4", "description": "Subtraktion als Problem mit einem unbekannten Summanden (Ergänzungsaufgabe) verstehen. Zum Beispiel $10 – 8$ lösen, indem man die Zahl findet, die zu 8 addiert 10 ergibt."},
{"id": "1.OA.C", "description": "Im Zahlenraum bis 20 addieren und subtrahieren."},
{"id": "1.OA.C.5", "description": "Zählen mit Addition und Subtraktion in Beziehung setzen (z.B. durch Weiterzählen um 2, um 2 zu addieren)."},
{"id": "1.OA.C.6", "description": "Im Zahlenraum bis 20 addieren und subtrahieren, dabei Sicherheit bei der Addition und Subtraktion im Zahlenraum bis 10 demonstrieren. Strategien wie das Weiterzählen; das Bilden der Zehn (z.B. $8 + 6 = 8 + 2 + 4 = 10 + 4 = 14$); das Zerlegen einer Zahl über den Zehner (z.B. $13 – 4 = 13 – 3 – 1 = 10 – 1 = 9$); die Nutzung der Beziehung zwischen Addition und Subtraktion (z.B. wenn man weiß, dass $8 + 4 = 12$ ist, weiß man auch $12 – 8 = 4$); und das Bilden von äquivalenten, aber einfacheren oder bekannten Summen (z.B. $6 + 7$ rechnen, indem man die bekannte äquivalente Summe $6 + 6 + 1 = 12 + 1 = 13$ bildet) verwenden."},
{"id": "1.OA.D", "description": "Mit Additions- und Subtraktionsgleichungen arbeiten."},
{"id": "1.OA.D.7", "description": "Die Bedeutung des Gleichheitszeichens verstehen und bestimmen, ob Gleichungen mit Addition und Subtraktion wahr oder falsch sind. Zum Beispiel: Welche der folgenden Gleichungen sind wahr und welche sind falsch? $6 = 6$, $7 = 8 – 1$, $5 + 2 = 2 + 5$, $4 + 1 = 5 + 2$."},
{"id": "1.OA.D.8", "description": "Die unbekannte ganze Zahl in einer Additions- oder Subtraktionsgleichung mit drei ganzen Zahlen bestimmen. Zum Beispiel die unbekannte Zahl bestimmen, die die Gleichung in jedem der folgenden Fälle wahr macht: $8 + ? = 11$, $5 = \text{?_} – 3$, $6 + 6 = \text{?_}$."},
{"id": "1.NBT.A", "description": "Die Zählsequenz erweitern."},
{"id": "1.NBT.A.1", "description": "Bis 120 zählen, beginnend bei jeder beliebigen Zahl unter 120. In diesem Zahlenraum Ziffern lesen und schreiben und eine Anzahl von Objekten mit einer geschriebenen Ziffer darstellen."},
{"id": "1.NBT.B", "description": "Das Stellenwertsystem verstehen."}
{"id": "1.NBT.B.2", "description": "Verstehen, dass die beiden Ziffern einer zweistelligen Zahl Anzahlen von Zehnern und Einern darstellen. Die folgenden Spezialfälle verstehen:\n - Die Zahlen von 11 bis 19 bestehen aus einem Zehner und einem, zwei, drei, vier, fünf, sechs, sieben, acht oder neun Einern.\n - Die Zahlen 10, 20, 30, 40, 50, 60, 70, 80, 90 bezeichnen einen, zwei, drei, vier, fünf, sechs, sieben, acht oder neun Zehner (und 0 Einer).\n - 10 kann als ein Bündel von zehn Einern betrachtet werden – „ein Zehner“ genannt."},
{"id": "1.NBT.B.2a", "description": "10 kann als ein Bündel von zehn Einern betrachtet werden – „ein Zehner“ genannt."},
{"id": "1.NBT.B.2b", "description": "Die Zahlen von 11 bis 19 bestehen aus einem Zehner und einem, zwei, drei, vier, fünf, sechs, sieben, acht oder neun Einern."},
{"id": "1.NBT.B.2c", "description": "Die Zahlen 10, 20, 30, 40, 50, 60, 70, 80, 90 bezeichnen einen, zwei, drei, vier, fünf, sechs, sieben, acht oder neun Zehner (und 0 Einer)."},
{"id": "1.NBT.B.3", "description": "Zwei zweistellige Zahlen basierend auf der Bedeutung der Zehner- und Einerziffern vergleichen und die Ergebnisse der Vergleiche mit den Symbolen >, =, und < notieren."},
{"id": "1.NBT.C", "description": "Das Stellenwertverständnis und die Eigenschaften von Rechenoperationen zum Addieren und Subtrahieren nutzen."},
{"id": "1.NBT.C.4", "description": "Im Zahlenraum bis 100 addieren, einschließlich der Addition einer zweistelligen und einer einstelligen Zahl sowie einer zweistelligen Zahl und einer Zehnerzahl, unter Verwendung von konkreten Modellen oder Zeichnungen und Strategien, die auf dem Stellenwertverständnis, den Eigenschaften von Rechenoperationen und/oder der Beziehung zwischen Addition und Subtraktion basieren; die Strategie mit einer schriftlichen Methode in Beziehung setzen und die verwendete Vorgehensweise erklären. Verstehen, dass beim Addieren zweistelliger Zahlen Zehner zu Zehnern und Einer zu Einern addiert werden und es manchmal notwendig ist, einen Zehner zu bündeln."},
{"id": "1.NBT.C.5", "description": "Zu einer gegebenen zweistelligen Zahl mental 10 mehr oder 10 weniger bestimmen, ohne zählen zu müssen; die verwendete Vorgehensweise erklären."},
{"id": "1.NBT.C.6", "description": "Zehnerzahlen im Bereich 10-90 von Zehnerzahlen im Bereich 10-90 subtrahieren (positive oder Null als Differenz), unter Verwendung von konkreten Modellen oder Zeichnungen und Strategien, die auf dem Stellenwertverständnis, den Eigenschaften von Rechenoperationen und/oder der Beziehung zwischen Addition und Subtraktion basieren; die Strategie mit einer schriftlichen Methode in Beziehung setzen und die verwendete Vorgehensweise erklären."},
{"id": "1.MD.A", "description": "Längen indirekt und durch das Aneinanderlegen von Längeneinheiten messen."},
{"id": "1.MD.A.1", "description": "Drei Objekte nach ihrer Länge ordnen; die Längen von zwei Objekten indirekt unter Verwendung eines dritten Objekts vergleichen."},
{"id": "1.MD.A.2", "description": "Die Länge eines Objekts als ganze Zahl von Längeneinheiten ausdrücken, indem mehrere Kopien eines kürzeren Objekts (der Längeneinheit) aneinandergereiht werden; verstehen, dass das Längenmaß eines Objekts die Anzahl der gleich großen Längeneinheiten ist, die es ohne Lücken oder Überlappungen abdecken. Beschränkt auf Kontexte, in denen das gemessene Objekt von einer ganzen Anzahl von Längeneinheiten ohne Lücken oder Überlappungen abgedeckt wird."},
{"id": "1.MD.B", "description": "Uhrzeiten ablesen und notieren."},
{"id": "1.MD.B.3", "description": "Uhrzeiten in vollen und halben Stunden von analogen und digitalen Uhren ablesen und notieren."},
{"id": "1.MD.C", "description": "Daten darstellen und interpretieren."},
{"id": "1.MD.C.4", "description": "Daten mit bis zu drei Kategorien organisieren, darstellen und interpretieren; Fragen zur Gesamtzahl der Datenpunkte, zur Anzahl in jeder Kategorie und zum Vergleich der Anzahlen zwischen den Kategorien stellen und beantworten."},
{"id": "1.G.A", "description": "Mit Formen und ihren Eigenschaften argumentieren."},
{"id": "1.G.A.1", "description": "Zwischen definierenden Eigenschaften (z.B. Dreiecke sind geschlossen und dreiseitig) und nicht-definierenden Eigenschaften (z.B. Farbe, Ausrichtung, Gesamtgröße) unterscheiden; Formen bauen und zeichnen, die definierende Eigenschaften besitzen."},
{"id": "1.G.A.2", "description": "Zweidimensionale Formen (Rechtecke, Quadrate, Trapeze, Dreiecke, Halbkreise und Viertelkreise) oder dreidimensionale Formen (Würfel, Quader, gerade Kreiskegel und gerade Kreiszylinder) zu einer zusammengesetzten Form zusammensetzen und aus der zusammengesetzten Form neue Formen bilden. (Die Schüler müssen keine Fachbegriffe wie „Quader“ lernen.)"},
{"id": "1.G.A.3", "description": "Kreise und Rechtecke in zwei und vier gleiche Teile teilen, die Teile mit den Wörtern Hälften und Viertel beschreiben und die Ausdrücke „die Hälfte von“, „ein Viertel von“ verwenden. Das Ganze als zwei Hälften oder vier Viertel beschreiben. Anhand dieser Beispiele verstehen, dass die Zerlegung in mehr gleiche Teile kleinere Teile erzeugt."},
{"id": "2.OA.A", "description": "Aufgaben mit Addition und Subtraktion darstellen und lösen."},
{"id": "2.OA.A.1", "description": "Addition und Subtraktion im Zahlenraum bis 100 verwenden, um ein- und zweischrittige Textaufgaben zu lösen. Diese beinhalten Situationen des Hinzufügens, Wegnehmens, Zusammenfügens, Zerlegens und Vergleichens, mit Unbekannten an allen Positionen, z.B. durch die Verwendung von Zeichnungen und Gleichungen mit einem Symbol für die unbekannte Zahl, um das Problem darzustellen."},
{"id": "2.OA.B", "description": "Im Zahlenraum bis 20 addieren und subtrahieren."},
{"id": "2.OA.B.2", "description": "Sicher im Zahlenraum bis 20 unter Verwendung von Kopfrechenstrategien addieren und subtrahieren. (Siehe Standard 1.OA.C.6 für eine Liste von Strategien.) Am Ende der 2. Klasse alle Summen von zwei einstelligen Zahlen auswendig können."},
{"id": "2.OA.C", "description": "Mit gleich großen Gruppen von Objekten arbeiten, um die Grundlagen für die Multiplikation zu schaffen."}
{"id": "2.OA.C.3", "description": "Bestimmen, ob eine Gruppe von Objekten (bis zu 20) eine gerade oder ungerade Anzahl von Mitgliedern hat, z.B. durch paarweises Anordnen der Objekte oder Zählen in 2er-Schritten; eine Gleichung schreiben, um eine gerade Zahl als Summe von zwei gleichen Summanden auszudrücken."},
{"id": "2.OA.C.4", "description": "Addition verwenden, um die Gesamtzahl von Objekten zu finden, die in rechteckigen Feldern mit bis zu 5 Reihen und bis zu 5 Spalten angeordnet sind; eine Gleichung schreiben, um die Gesamtzahl als Summe gleicher Summanden auszudrücken."},
{"id": "2.NBT.A", "description": "Das Stellenwertsystem verstehen."},
{"id": "2.NBT.A.1", "description": "Verstehen, dass die drei Ziffern einer dreistelligen Zahl Anzahlen von Hundertern, Zehnern und Einern darstellen; z.B. entspricht 706 7 Hundertern, 0 Zehnern und 6 Einern. Die folgenden Spezialfälle verstehen:\n - 100 kann als ein Bündel von zehn Zehnern betrachtet werden – „ein Hunderter“ genannt.\n - Die Zahlen 100, 200, 300, 400, 500, 600, 700, 800, 900 bezeichnen einen, zwei, drei, vier, fünf, sechs, sieben, acht oder neun Hunderter (und 0 Zehner und 0 Einer)."},
{"id": "2.NBT.A.1a", "description": "100 kann als ein Bündel von zehn Zehnern betrachtet werden – „ein Hunderter“ genannt."},
{"id": "2.NBT.A.1b", "description": "Die Zahlen 100, 200, 300, 400, 500, 600, 700, 800, 900 bezeichnen einen, zwei, drei, vier, fünf, sechs, sieben, acht oder neun Hunderter (und 0 Zehner und 0 Einer)."},
{"id": "2.NBT.A.2", "description": "Im Zahlenraum bis 1000 zählen; in 5er-, 10er- und 100er-Schritten zählen."},
{"id": "2.NBT.A.3", "description": "Zahlen bis 1000 unter Verwendung von Ziffern, Zahlwörtern und der erweiterten Schreibweise lesen und schreiben."},
{"id": "2.NBT.A.4", "description": "Zwei dreistellige Zahlen basierend auf der Bedeutung der Hunderter-, Zehner- und Einerziffern vergleichen und die Ergebnisse der Vergleiche mit den Symbolen >, =, und < notieren."},
{"id": "2.NBT.B", "description": "Das Stellenwertverständnis und die Eigenschaften von Rechenoperationen zum Addieren und Subtrahieren nutzen."},
{"id": "2.NBT.B.5", "description": "Sicher im Zahlenraum bis 100 addieren und subtrahieren, unter Verwendung von Strategien, die auf dem Stellenwertverständnis, den Eigenschaften von Rechenoperationen und/oder der Beziehung zwischen Addition und Subtraktion basieren."},
{"id": "2.NBT.B.6", "description": "Bis zu vier zweistellige Zahlen addieren, unter Verwendung von Strategien, die auf dem Stellenwertverständnis und den Eigenschaften von Rechenoperationen basieren."},
{"id": "2.NBT.B.7", "description": "Im Zahlenraum bis 1000 addieren und subtrahieren, unter Verwendung von konkreten Modellen oder Zeichnungen und Strategien, die auf dem Stellenwertverständnis, den Eigenschaften von Rechenoperationen und/oder der Beziehung zwischen Addition und Subtraktion basieren; die Strategie mit einer schriftlichen Methode in Beziehung setzen. Verstehen, dass beim Addieren oder Subtrahieren dreistelliger Zahlen Hunderter zu Hundertern, Zehner zu Zehnern und Einer zu Einern addiert oder subtrahiert werden und es manchmal notwendig ist, Zehner oder Hunderter zu bündeln oder zu entbündeln."},
{"id": "2.NBT.B.8", "description": "Zu einer gegebenen Zahl im Bereich von 100-900 mental 10 oder 100 addieren und von einer gegebenen Zahl im Bereich von 100-900 mental 10 oder 100 subtrahieren."},
{"id": "2.NBT.B.9", "description": "Erklären, warum Additions- und Subtraktionsstrategien funktionieren, unter Verwendung des Stellenwertverständnisses und der Eigenschaften von Rechenoperationen. (Erklärungen können durch Zeichnungen oder Objekte unterstützt werden.)"},
{"id": "2.MD.A", "description": "Längen in Standardeinheiten messen und schätzen."},
{"id": "2.MD.A.1", "description": "Die Länge eines Objekts messen, indem geeignete Werkzeuge wie Lineale, Yardsticks, Meterstäbe und Maßbänder ausgewählt und verwendet werden."},
{"id": "2.MD.A.2", "description": "Die Länge eines Objekts zweimal messen, wobei für die beiden Messungen Längeneinheiten unterschiedlicher Länge verwendet werden; beschreiben, wie die beiden Messungen mit der Größe der gewählten Einheit zusammenhängen."},
{"id": "2.MD.A.3", "description": "Längen unter Verwendung der Einheiten Zoll, Fuß, Zentimeter und Meter schätzen."},
{"id": "2.MD.A.4", "description": "Messen, um zu bestimmen, um wie viel länger ein Objekt als ein anderes ist, und den Längenunterschied in einer Standardlängeneinheit ausdrücken."},
{"id": "2.MD.B", "description": "Addition und Subtraktion mit Längen in Beziehung setzen."},
{"id": "2.MD.B.5", "description": "Addition und Subtraktion im Zahlenraum bis 100 verwenden, um Textaufgaben zu Längen zu lösen, die in denselben Einheiten angegeben sind, z.B. unter Verwendung von Zeichnungen (wie z.B. Zeichnungen von Linealen) und Gleichungen mit einem Symbol für die unbekannte Zahl, um das Problem darzustellen."},
{"id": "2.MD.B.6", "description": "Ganze Zahlen als Längen von 0 auf einem Zahlenstrahl mit äquidistanten Punkten, die den Zahlen 0, 1, 2, ... entsprechen, darstellen und Summen und Differenzen ganzer Zahlen im Zahlenraum bis 100 auf einem Zahlenstrahl darstellen."},
{"id": "2.MD.C", "description": "Mit Zeit und Geld arbeiten."}
{"id": "2.MD.C.7", "description": "Uhrzeiten von analogen und digitalen Uhren auf fünf Minuten genau ablesen und notieren, unter Verwendung von a.m. und p.m. zur Unterscheidung der Tageshälften."},
{"id": "2.MD.C.8", "description": "Textaufgaben mit Dollarnoten, Quarters, Dimes, Nickels und Pennys lösen, dabei die Symbole $ und ¢ korrekt verwenden. Beispiel: Wenn du 2 Dimes und 3 Pennys hast, wie viele Cents hast du?"},
{"id": "2.MD.D", "description": "Daten darstellen und interpretieren."},
{"id": "2.MD.D.9", "description": "Messdaten erzeugen, indem die Längen mehrerer Objekte auf die nächste ganze Einheit genau gemessen werden oder indem wiederholte Messungen desselben Objekts durchgeführt werden. Die Messungen in einem Punktdiagramm darstellen, dessen horizontale Skala in ganzen Zahleneinheiten eingeteilt ist."},
{"id": "2.MD.D.10", "description": "Ein Bilddiagramm und ein Säulendiagramm (mit einer Skala in Einerschritten) zeichnen, um einen Datensatz mit bis zu vier Kategorien darzustellen. Einfache Additions-, Subtraktions- und Vergleichsaufgaben unter Verwendung von Informationen aus einem Säulendiagramm lösen."},
{"id": "2.G.A", "description": "Mit Formen und ihren Eigenschaften argumentieren."},
{"id": "2.G.A.1", "description": "Formen mit bestimmten Eigenschaften, wie einer gegebenen Anzahl von Ecken oder einer gegebenen Anzahl gleich großer Flächen, erkennen und zeichnen. (Größen werden direkt oder visuell verglichen, nicht durch Messen.) Dreiecke, Vierecke, Fünfecke, Sechsecke und Würfel identifizieren."},
{"id": "2.G.A.2", "description": "Ein Rechteck in Reihen und Spalten mit gleich großen Quadraten unterteilen und deren Gesamtzahl durch Zählen bestimmen."},
{"id": "2.G.A.3", "description": "Kreise und Rechtecke in zwei, drei oder vier gleiche Teile teilen; die Teile mit den Wörtern Hälften, Drittel, die Hälfte von, ein Drittel von usw. beschreiben; und das Ganze als zwei Hälften, drei Drittel, vier Viertel beschreiben. Erkennen, dass gleich große Teile identischer Ganzer nicht dieselbe Form haben müssen."},
{"id": "3.OA.A", "description": "Aufgaben mit Multiplikation und Division darstellen und lösen."},
{"id": "3.OA.A.1", "description": "Produkte ganzer Zahlen interpretieren, z.B. $5 \\times 7$ als die Gesamtzahl von Objekten in 5 Gruppen mit je 7 Objekten. Zum Beispiel einen Kontext beschreiben, in dem eine Gesamtzahl von Objekten als $5 \\times 7$ ausgedrückt werden kann."},
{"id": "3.OA.A.2", "description": "Quotienten ganzer Zahlen interpretieren, z.B. $56 \\div 8$ als die Anzahl der Objekte in jedem Teil, wenn 56 Objekte gleichmäßig auf 8 Teile aufgeteilt werden, oder als die Anzahl der Teile, wenn 56 Objekte in gleiche Teile von je 8 Objekten aufgeteilt werden. Zum Beispiel einen Kontext beschreiben, in dem eine Anzahl von Teilen oder Gruppen als $56 \\div 8$ ausgedrückt werden kann."},
{"id": "3.OA.A.3", "description": "Multiplikation und Division im Zahlenraum bis 100 verwenden, um Textaufgaben in Situationen zu lösen, die gleich große Gruppen, rechteckige Anordnungen und Messgrößen beinhalten, z.B. unter Verwendung von Zeichnungen und Gleichungen mit einem Symbol für die unbekannte Zahl, um das Problem darzustellen."},
{"id": "3.OA.A.4", "description": "Die unbekannte ganze Zahl in einer Multiplikations- oder Divisionsgleichung mit drei ganzen Zahlen bestimmen. Zum Beispiel die unbekannte Zahl bestimmen, die die Gleichung in jedem der folgenden Fälle wahr macht: $8 \\times ? = 48$, $5 = \\text{?_} \\div 3$, $6 \\times 6 = ?_\\text{}$."},
{"id": "3.OA.B", "description": "Eigenschaften der Multiplikation und die Beziehung zwischen Multiplikation und Division verstehen."},
{"id": "3.OA.B.5", "description": "Eigenschaften von Rechenoperationen als Strategien zum Multiplizieren und Dividieren anwenden. (Die Schüler müssen die Fachbegriffe für diese Eigenschaften nicht verwenden.) Beispiele: Wenn $6 \\times 4 = 24$ bekannt ist, dann ist auch $4 \\times 6 = 24$ bekannt (Kommutativgesetz der Multiplikation). $3 \\times 5 \\times 2$ kann berechnet werden als $3 \\times 5 = 15$, dann $15 \\times 2 = 30$, oder als $5 \\times 2 = 10$, dann $3 \\times 10 = 30$ (Assoziativgesetz der Multiplikation). Wenn man weiß, dass $8 \\times 5 = 40$ und $8 \\times 2 = 16$ ist, kann man $8 \\times 7$ als $8 \\times (5 + 2) = (8 \\times 5) + (8 \\times 2) = 40 + 16 = 56$ berechnen (Distributivgesetz)."},
{"id": "3.OA.B.6", "description": "Division als Problem mit einem unbekannten Faktor verstehen. Zum Beispiel $32 \\div 8$ lösen, indem man die Zahl findet, die mit 8 multipliziert 32 ergibt."},
{"id": "3.OA.C", "description": "Im Zahlenraum bis 100 multiplizieren und dividieren."},
{"id": "3.OA.C.7", "description": "Sicher im Zahlenraum bis 100 multiplizieren und dividieren, unter Verwendung von Strategien wie der Beziehung zwischen Multiplikation und Division (z.B. wenn man weiß, dass $8 \\times 5 = 40$, weiß man auch $40 \\div 5 = 8$) oder der Eigenschaften von Rechenoperationen. Am Ende der 3. Klasse alle Produkte von zwei einstelligen Zahlen (das kleine Einmaleins) auswendig können."},
{"id": "3.OA.D", "description": "Aufgaben mit den vier Grundrechenarten lösen und Muster in der Arithmetik erkennen und erklären."},
{"id": "3.OA.D.8", "description": "Zweischrittige Textaufgaben mit den vier Grundrechenarten lösen. Diese Aufgaben mit Gleichungen darstellen, in denen ein Buchstabe für die unbekannte Größe steht. Die Plausibilität der Antworten unter Verwendung von Kopfrechnen und Schätzstrategien einschließlich Runden bewerten. (Dieser Standard ist auf Aufgaben mit ganzen Zahlen und ganzzahligen Ergebnissen beschränkt; die Schüler sollten wissen, wie Operationen in der üblichen Reihenfolge ausgeführt werden, wenn keine Klammern eine bestimmte Reihenfolge vorgeben (Rechenregeln).)"},
{"id": "3.OA.D.9", "description": "Arithmetische Muster (einschließlich Mustern in der Additionstabelle oder Multiplikationstabelle) erkennen und sie unter Verwendung der Eigenschaften von Rechenoperationen erklären. Zum Beispiel beobachten, dass das Vierfache einer Zahl immer gerade ist, und erklären, warum das Vierfache einer Zahl in zwei gleiche Summanden zerlegt werden kann."},
{"id": "3.NBT.A", "description": "Das Stellenwertverständnis und die Eigenschaften von Rechenoperationen nutzen, um mit mehrstelligen Zahlen zu rechnen. (Eine Reihe von Algorithmen kann verwendet werden.)"},
{"id": "3.NBT.A.1", "description": "Das Stellenwertverständnis nutzen, um ganze Zahlen auf den nächsten 10er oder 100er zu runden."},
{"id": "3.NBT.A.2", "description": "Sicher im Zahlenraum bis 1000 addieren und subtrahieren, unter Verwendung von Strategien und Algorithmen, die auf dem Stellenwertverständnis, den Eigenschaften von Rechenoperationen und/oder der Beziehung zwischen Addition und Subtraktion basieren."},
{"id": "3.NBT.A.3", "description": "Einstellige ganze Zahlen mit Vielfachen von 10 im Bereich von 10-90 (z.B. $9 \\times 80$, $5 \\times 60$) multiplizieren, unter Verwendung von Strategien, die auf dem Stellenwertverständnis und den Eigenschaften von Rechenoperationen basieren."}
{"id": "3.NF.A", "description": "Verständnis von Brüchen als Zahlen entwickeln."},
{"id": "3.NF.A.1", "description": "Einen Bruch $1/b$ als die Größe verstehen, die durch 1 Teil entsteht, wenn ein Ganzes in b gleiche Teile geteilt wird; einen Bruch $a/b$ als die Größe verstehen, die durch a Teile der Größe $1/b$ gebildet wird."},
{"id": "3.NF.A.2", "description": "Einen Bruch als eine Zahl auf dem Zahlenstrahl verstehen; Brüche auf einem Zahlenstrahl darstellen.\nInhalt dieses Standards:\n - Einen Bruch $1/b$ auf einem Zahlenstrahl darstellen, indem das Intervall von 0 bis 1 als das Ganze definiert und in b gleiche Teile geteilt wird. Erkennen, dass jeder Teil die Größe $1/b$ hat und dass der Endpunkt des Teils, der bei 0 beginnt, die Zahl $1/b$ auf dem Zahlenstrahl lokalisiert.\n - Einen Bruch $a/b$ auf einem Zahlenstrahl darstellen, indem a Längen von $1/b$ ab 0 abgetragen werden. Erkennen, dass das resultierende Intervall die Größe $a/b$ hat und dass sein Endpunkt die Zahl $a/b$ auf dem Zahlenstrahl lokalisiert."},
{"id": "3.NF.A.2a", "description": "Einen Bruch $1/b$ auf einem Zahlenstrahl darstellen, indem das Intervall von 0 bis 1 als das Ganze definiert und in b gleiche Teile geteilt wird. Erkennen, dass jeder Teil die Größe $1/b$ hat und dass der Endpunkt des Teils, der bei 0 beginnt, die Zahl $1/b$ auf dem Zahlenstrahl lokalisiert."},
{"id": "3.NF.A.2b", "description": "Einen Bruch $a/b$ auf einem Zahlenstrahl darstellen, indem a Längen von $1/b$ ab 0 abgetragen werden. Erkennen, dass das resultierende Intervall die Größe $a/b$ hat und dass sein Endpunkt die Zahl $a/b$ auf dem Zahlenstrahl lokalisiert."},
{"id": "3.NF.A.3", "description": "Die Äquivalenz von Brüchen in Spezialfällen erklären und Brüche durch Überlegungen zu ihrer Größe vergleichen.\nInhalt dieses Standards:\n - Zwei Brüche als äquivalent (gleich) verstehen, wenn sie die gleiche Größe haben oder denselben Punkt auf einem Zahlenstrahl bezeichnen.\n - Einfache äquivalente Brüche erkennen und erzeugen (z.B. $1/2 = 2/4, 4/6 = 2/3$). Erklären, warum die Brüche äquivalent sind, z.B. durch die Verwendung eines visuellen Bruchmodels.\n - Ganze Zahlen als Brüche ausdrücken und Brüche erkennen, die äquivalent zu ganzen Zahlen sind. Beispiele: 3 in der Form $3 = 3/1$ ausdrücken; erkennen, dass $6/1 = 6$; $4/4$ und 1 am selben Punkt auf einem Zahlenstrahl lokalisieren.\n - Zwei Brüche mit demselben Zähler oder demselben Nenner durch Überlegungen zu ihrer Größe vergleichen. Erkennen, dass Vergleiche nur gültig sind, wenn sich die beiden Brüche auf dasselbe Ganze beziehen. Die Ergebnisse der Vergleiche mit den Symbolen >, =, oder < notieren und die Schlussfolgerungen begründen, z.B. durch die Verwendung eines visuellen Bruchmodels."},
{"id": "3.NF.A.3a", "description": "Zwei Brüche als äquivalent (gleich) verstehen, wenn sie die gleiche Größe haben oder denselben Punkt auf einem Zahlenstrahl bezeichnen."},
{"id": "3.NF.A.3b", "description": "Einfache äquivalente Brüche erkennen und erzeugen (z.B. $1/2 = 2/4, 4/6 = 2/3$). Erklären, warum die Brüche äquivalent sind, z.B. durch die Verwendung eines visuellen Bruchmodels."},
{"id": "3.NF.A.3c", "description": "Ganze Zahlen als Brüche ausdrücken und Brüche erkennen, die äquivalent zu ganzen Zahlen sind. Beispiele: 3 in der Form $3 = 3/1$ ausdrücken; erkennen, dass $6/1 = 6$; $4/4$ und 1 am selben Punkt auf einem Zahlenstrahl lokalisieren."},
{"id": "3.NF.A.3d", "description": "Zwei Brüche mit demselben Zähler oder demselben Nenner durch Überlegungen zu ihrer Größe vergleichen. Erkennen, dass Vergleiche nur gültig sind, wenn sich die beiden Brüche auf dasselbe Ganze beziehen. Die Ergebnisse der Vergleiche mit den Symbolen >, =, oder < notieren und die Schlussfolgerungen begründen, z.B. durch die Verwendung eines visuellen Bruchmodels."},
{"id": "3.MD.A", "description": "Aufgaben zur Messung und Schätzung von Zeitintervallen, Flüssigkeitsvolumen und Massen von Objekten lösen."},
{"id": "3.MD.A.1", "description": "Uhrzeiten auf die Minute genau ablesen und notieren und Zeitspannen in Minuten messen. Textaufgaben zur Addition und Subtraktion von Zeitspannen in Minuten lösen, z.B. indem das Problem auf einem Zahlenstrahl dargestellt wird."},
{"id": "3.MD.A.2", "description": "Flüssigkeitsvolumen und Massen von Objekten unter Verwendung der Standardeinheiten Gramm (g), Kilogramm (kg) und Liter (l) messen und schätzen. (Zusammengesetzte Einheiten wie $cm^3$ und die Bestimmung des geometrischen Volumens eines Behälters sind ausgeschlossen.) Addieren, Subtrahieren, Multiplizieren oder Dividieren, um einschrittige Textaufgaben zu Massen oder Volumen zu lösen, die in denselben Einheiten gegeben sind, z.B. unter Verwendung von Zeichnungen (wie einem Becherglas mit einer Messskala), um das Problem darzustellen. [Multiplikative Vergleichsaufgaben (Aufgaben mit Formulierungen wie „mal so viel“) sind ausgeschlossen.]"},
{"id": "3.MD.B", "description": "Daten darstellen und interpretieren."},
{"id": "3.MD.B.3", "description": "Ein skaliertes Bilddiagramm und ein skaliertes Säulendiagramm zeichnen, um einen Datensatz mit mehreren Kategorien darzustellen. Ein- und zweischrittige „wie viele mehr“- und „wie viele weniger“-Aufgaben unter Verwendung von Informationen aus skalierten Säulendiagrammen lösen. Zum Beispiel ein Säulendiagramm zeichnen, in dem jedes Quadrat 5 Haustiere darstellt."},
{"id": "3.MD.B.4", "description": "Messdaten durch Längenmessung mit Linealen erzeugen, die mit halben und viertel Zoll markiert sind. Die Daten in einem Punktdiagramm darstellen, dessen horizontale Skala in geeigneten Einheiten – ganzen Zahlen, Hälften oder Vierteln – unterteilt ist."},
{"id": "3.MD.C", "description": "Geometrische Messung: Konzepte des Flächeninhalts verstehen und den Flächeninhalt mit Multiplikation und Addition in Beziehung setzen."},
{"id": "3.MD.C.5", "description": "Flächeninhalt als eine Eigenschaft ebener Figuren erkennen und die Konzepte der Flächenmessung verstehen.\nInhalt dieses Standards:\n - Ein Quadrat mit der Seitenlänge 1 Einheit, „Einheitsquadrat“ genannt, hat den Flächeninhalt „eine Flächeneinheit“ und kann zur Messung von Flächeninhalten verwendet werden.\n - Eine ebene Figur, die lückenlos und ohne Überlappungen von n Einheitsquadraten bedeckt werden kann, hat einen Flächeninhalt von n Flächeneinheiten."},
{"id": "3.MD.C.5a", "description": "Ein Quadrat mit der Seitenlänge 1 Einheit, „Einheitsquadrat“ genannt, hat den Flächeninhalt „eine Flächeneinheit“ und kann zur Messung von Flächeninhalten verwendet werden."},
{"id": "3.MD.C.5b", "description": "Eine ebene Figur, die lückenlos und ohne Überlappungen von n Einheitsquadraten bedeckt werden kann, hat einen Flächeninhalt von n Flächeneinheiten."},
{"id": "3.MD.C.6", "description": "Flächeninhalte durch Zählen von Einheitsquadraten (Quadratzentimeter, Quadratmeter, Quadratzoll, Quadratfuß und selbstgewählte Einheiten) messen."},
{"id": "3.MD.C.7", "description": "Den Flächeninhalt mit den Operationen der Multiplikation und Addition in Beziehung setzen.\nInhalt dieses Standards:\n - Den Flächeninhalt eines Rechtecks mit ganzzahligen Seitenlängen durch Auslegen mit Einheitsquadraten bestimmen und zeigen, dass der Flächeninhalt derselbe ist, den man durch Multiplikation der Seitenlängen erhält.\n - Den Flächeninhalt als additiv erkennen. Flächeninhalte von rechtwinkligen Figuren bestimmen, indem sie in nicht überlappende Rechtecke zerlegt werden und die Flächeninhalte der nicht überlappenden Teile addiert werden; diese Technik zur Lösung von realen Problemen anwenden.\n - Durch Auslegen in einem konkreten Fall zeigen, dass der Flächeninhalt eines Rechtecks mit den ganzzahligen Seitenlängen a und b + c die Summe von $a \\times b$ und $a \\times c$ ist. Flächenmodelle verwenden, um das Distributivgesetz bei mathematischen Überlegungen darzustellen.\n - Seitenlängen multiplizieren, um die Flächeninhalte von Rechtecken mit ganzzahligen Seitenlängen im Kontext der Lösung von realen und mathematischen Problemen zu finden, und ganzzahlige Produkte als rechteckige Flächen bei mathematischen Überlegungen darstellen."},
{"id": "3.MD.C.7a", "description": "Den Flächeninhalt eines Rechtecks mit ganzzahligen Seitenlängen durch Auslegen mit Einheitsquadraten bestimmen und zeigen, dass der Flächeninhalt derselbe ist, den man durch Multiplikation der Seitenlängen erhält."},
{"id": "3.MD.C.7b", "description": "Seitenlängen multiplizieren, um die Flächeninhalte von Rechtecken mit ganzzahligen Seitenlängen im Kontext der Lösung von realen und mathematischen Problemen zu finden, und ganzzahlige Produkte als rechteckige Flächen bei mathematischen Überlegungen darstellen."}
{"id": "3.MD.C.7c", "description": "Durch Auslegen in einem konkreten Fall zeigen, dass der Flächeninhalt eines Rechtecks mit den ganzzahligen Seitenlängen a und b + c die Summe von $a \\times b$ und $a \\times c$ ist. Flächenmodelle verwenden, um das Distributivgesetz bei mathematischen Überlegungen darzustellen."},
{"id": "3.MD.C.7d", "description": "Den Flächeninhalt als additiv erkennen. Flächeninhalte von rechtwinkligen Figuren bestimmen, indem sie in nicht überlappende Rechtecke zerlegt werden und die Flächeninhalte der nicht überlappenden Teile addiert werden; diese Technik zur Lösung von realen Problemen anwenden."},
{"id": "3.MD.D", "description": "Geometrische Messung: Den Umfang als eine Eigenschaft ebener Figuren erkennen und zwischen Längen- und Flächenmaßen unterscheiden."},
{"id": "3.MD.D.8", "description": "Reale und mathematische Probleme mit dem Umfang von Polygonen lösen, einschließlich der Bestimmung des Umfangs bei gegebenen Seitenlängen, der Bestimmung einer unbekannten Seitenlänge und der Darstellung von Rechtecken mit gleichem Umfang und unterschiedlichem Flächeninhalt oder mit gleichem Flächeninhalt und unterschiedlichem Umfang."},
{"id": "3.G.A", "description": "Mit Formen und ihren Eigenschaften argumentieren."},
{"id": "3.G.A.1", "description": "Verstehen, dass Formen in verschiedenen Kategorien (z.B. Rauten, Rechtecke und andere) gemeinsame Eigenschaften haben können (z.B. vier Seiten zu haben), und dass die gemeinsamen Eigenschaften eine größere Kategorie (z.B. Vierecke) definieren können. Rauten, Rechtecke und Quadrate als Beispiele für Vierecke erkennen und Beispiele für Vierecke zeichnen, die zu keiner dieser Unterkategorien gehören."},
{"id": "3.G.A.2", "description": "Formen in flächengleiche Teile zerlegen. Den Flächeninhalt jedes Teils als Stammbruch des Ganzen ausdrücken. Zum Beispiel eine Form in 4 flächengleiche Teile zerlegen und den Flächeninhalt jedes Teils als $1/4$ des Flächeninhalts der Form beschreiben."},
{"id": "4.OA.A", "description": "Die vier Grundrechenarten mit ganzen Zahlen zur Lösung von Problemen verwenden."},
{"id": "4.OA.A.1", "description": "Eine Multiplikationsgleichung als Vergleich interpretieren, z.B. $35 = 5 \\times 7$ als die Aussage interpretieren, dass 35 fünfmal so viel wie 7 und siebenmal so viel wie 5 ist. Mündliche Aussagen über multiplikative Vergleiche als Multiplikationsgleichungen darstellen."},
{"id": "4.OA.A.2", "description": "Multiplizieren oder dividieren, um Textaufgaben mit multiplikativen Vergleichen zu lösen, z.B. unter Verwendung von Zeichnungen und Gleichungen mit einem Symbol für die unbekannte Zahl, um das Problem darzustellen, und dabei multiplikative von additiven Vergleichen unterscheiden."},
{"id": "4.OA.A.3", "description": "Mehrschrittige Textaufgaben mit ganzen Zahlen und ganzzahligen Ergebnissen mit den vier Grundrechenarten lösen, einschließlich Aufgaben, in denen Reste interpretiert werden müssen. Diese Aufgaben mit Gleichungen darstellen, in denen ein Buchstabe für die unbekannte Größe steht. Die Plausibilität der Antworten unter Verwendung von Kopfrechnen und Schätzstrategien einschließlich Runden bewerten."},
{"id": "4.OA.B", "description": "Sich mit Teilern und Vielfachen vertraut machen."},
{"id": "4.OA.B.4", "description": "Alle Teilerpaare für eine ganze Zahl im Bereich von 1-100 finden. Erkennen, dass eine ganze Zahl ein Vielfaches jedes ihrer Teiler ist. Bestimmen, ob eine gegebene ganze Zahl im Bereich von 1-100 ein Vielfaches einer gegebenen einstelligen Zahl ist. Bestimmen, ob eine gegebene ganze Zahl im Bereich von 1-100 eine Primzahl oder eine zusammengesetzte Zahl ist."},
{"id": "4.OA.C", "description": "Muster erzeugen und analysieren."},
{"id": "4.OA.C.5", "description": "Ein Zahlen- oder Formmuster erzeugen, das einer gegebenen Regel folgt. Offensichtliche Merkmale des Musters identifizieren, die nicht explizit in der Regel selbst enthalten waren. Zum Beispiel bei der Regel „Addiere 3“ und der Startzahl 1 Glieder der resultierenden Folge erzeugen und beobachten, dass die Glieder scheinbar zwischen ungeraden und geraden Zahlen wechseln. Informell erklären, warum die Zahlen weiterhin auf diese Weise wechseln werden."},
{"id": "4.NBT.A", "description": "Das Stellenwertverständnis für mehrstellige ganze Zahlen verallgemeinern."},
{"id": "4.NBT.A.1", "description": "Erkennen, dass in einer mehrstelligen ganzen Zahl eine Ziffer an einer bestimmten Stelle das Zehnfache dessen darstellt, was sie an der Stelle rechts davon darstellt. Zum Beispiel erkennen, dass $700 \\div 70 = 10$ ist, indem Konzepte des Stellenwerts und der Division angewendet werden."},
{"id": "4.NBT.A.2", "description": "Mehrstellige ganze Zahlen unter Verwendung von Ziffern, Zahlwörtern und der erweiterten Schreibweise lesen und schreiben. Zwei mehrstellige Zahlen basierend auf der Bedeutung der Ziffern an jeder Stelle vergleichen und die Ergebnisse der Vergleiche mit den Symbolen >, =, und < notieren."},
{"id": "4.NBT.A.3", "description": "Das Stellenwertverständnis nutzen, um mehrstellige ganze Zahlen auf eine beliebige Stelle zu runden."},
{"id": "4.NBT.B", "description": "Das Stellenwertverständnis und die Eigenschaften von Rechenoperationen nutzen, um mit mehrstelligen Zahlen zu rechnen."},
{"id": "4.NBT.B.4", "description": "Mehrstellige ganze Zahlen unter Verwendung des Standardalgorithmus sicher addieren und subtrahieren."},
{"id": "4.NBT.B.5", "description": "Eine ganze Zahl mit bis zu vier Stellen mit einer einstelligen ganzen Zahl multiplizieren und zwei zweistellige Zahlen multiplizieren, unter Verwendung von Strategien, die auf dem Stellenwert und den Eigenschaften von Rechenoperationen basieren. Die Berechnung unter Verwendung von Gleichungen, rechteckigen Anordnungen und/oder Flächenmodellen veranschaulichen und erklären."},
{"id": "4.NBT.B.6", "description": "Ganzzahlige Quotienten und Reste bei bis zu vierstelligen Dividenden und einstelligen Divisoren finden, unter Verwendung von Strategien, die auf dem Stellenwert, den Eigenschaften von Rechenoperationen und/oder der Beziehung zwischen Multiplikation und Division basieren. Die Berechnung unter Verwendung von Gleichungen, rechteckigen Anordnungen und/oder Flächenmodellen veranschaulichen und erklären."},
{"id": "4.NF.A", "description": "Das Verständnis für die Äquivalenz und Anordnung von Brüchen erweitern."},
{"id": "4.NF.A.1", "description": "Erklären, warum ein Bruch $a/b$ äquivalent zu einem Bruch $(n \\times a)/(n \\times b)$ ist, indem visuelle Bruchmodelle verwendet werden, mit besonderem Augenmerk darauf, wie sich die Anzahl und Größe der Teile unterscheiden, obwohl die beiden Brüche selbst die gleiche Größe haben. Dieses Prinzip nutzen, um äquivalente Brüche zu erkennen und zu erzeugen."},
{"id": "4.NF.A.2", "description": "Zwei Brüche mit unterschiedlichen Zählern und Nennern vergleichen, z.B. indem gemeinsame Nenner oder Zähler gebildet werden oder durch den Vergleich mit einem Bezugsbruch wie $1/2$. Erkennen, dass Vergleiche nur gültig sind, wenn sich die beiden Brüche auf dasselbe Ganze beziehen. Die Ergebnisse der Vergleiche mit den Symbolen >, =, oder < notieren und die Schlussfolgerungen begründen, z.B. durch die Verwendung eines visuellen Bruchmodels."}
{"id": "4.NF.B", "description": "Brüche aus Stammbrüchen aufbauen, indem frühere Verständnisse von Operationen mit ganzen Zahlen angewendet und erweitert werden."},
{"id": "4.NF.B.3", "description": "Einen Bruch $a/b$ mit $a > 1$ als eine Summe von Brüchen $1/b$ verstehen.\nInhalt dieses Standards:\n - Einen Bruch auf mehr als eine Weise in eine Summe von Brüchen mit demselben Nenner zerlegen und jede Zerlegung durch eine Gleichung festhalten. Zerlegungen begründen, z.B. durch die Verwendung eines visuellen Bruchmodels. Beispiele: $3/8 = 1/8 + 1/8 + 1/8$; $3/8 = 1/8 + 2/8$; $2 1/8 = 1 + 1 + 1/8 = 8/8 + 8/8 + 1/8$.\n - Addition und Subtraktion von Brüchen als Zusammenfügen und Trennen von Teilen verstehen, die sich auf dasselbe Ganze beziehen.\n - Gemischte Zahlen mit gleichen Nennern addieren und subtrahieren, z.B. indem jede gemischte Zahl durch einen äquivalenten Bruch ersetzt wird und/oder indem Eigenschaften von Rechenoperationen und die Beziehung zwischen Addition und Subtraktion genutzt werden.\n - Textaufgaben zur Addition und Subtraktion von Brüchen lösen, die sich auf dasselbe Ganze beziehen und gleiche Nenner haben, z.B. durch die Verwendung von visuellen Bruchmodellen und Gleichungen zur Darstellung des Problems."},
{"id": "4.NF.B.3a", "description": "Addition und Subtraktion von Brüchen als Zusammenfügen und Trennen von Teilen verstehen, die sich auf dasselbe Ganze beziehen."},
{"id": "4.NF.B.3b", "description": "Einen Bruch auf mehr als eine Weise in eine Summe von Brüchen mit demselben Nenner zerlegen und jede Zerlegung durch eine Gleichung festhalten. Zerlegungen begründen, z.B. durch die Verwendung eines visuellen Bruchmodels. Beispiele: $3/8 = 1/8 + 1/8 + 1/8$; $3/8 = 1/8 + 2/8$; $2 1/8 = 1 + 1 + 1/8 = 8/8 + 8/8 + 1/8$."},
{"id": "4.NF.B.3c", "description": "Gemischte Zahlen mit gleichen Nennern addieren und subtrahieren, z.B. indem jede gemischte Zahl durch einen äquivalenten Bruch ersetzt wird und/oder indem Eigenschaften von Rechenoperationen und die Beziehung zwischen Addition und Subtraktion genutzt werden."},
{"id": "4.NF.B.3d", "description": "Textaufgaben zur Addition und Subtraktion von Brüchen lösen, die sich auf dasselbe Ganze beziehen und gleiche Nenner haben, z.B. durch die Verwendung von visuellen Bruchmodellen und Gleichungen zur Darstellung des Problems."},
{"id": "4.NF.B.4", "description": "Frühere Verständnisse der Multiplikation anwenden und erweitern, um einen Bruch mit einer ganzen Zahl zu multiplizieren.\nInhalt dieses Standards:\n - Textaufgaben zur Multiplikation eines Bruchs mit einer ganzen Zahl lösen, z.B. unter Verwendung von visuellen Bruchmodellen und Gleichungen zur Darstellung des Problems. Zum Beispiel: Wenn jede Person auf einer Party 3/8 Pfund Roastbeef isst und 5 Personen an der Party teilnehmen, wie viele Pfund Roastbeef werden benötigt? Zwischen welchen beiden ganzen Zahlen liegt Ihre Antwort?\n - Einen Bruch $a/b$ als ein Vielfaches von $1/b$ verstehen. Zum Beispiel ein visuelles Bruchmodell verwenden, um 5/4 als das Produkt $5 \\times (1/4)$ darzustellen und die Schlussfolgerung durch die Gleichung $5/4 = 5 \\times (1/4)$ festzuhalten.\n - Ein Vielfaches von $a/b$ als ein Vielfaches von $1/b$ verstehen und dieses Verständnis nutzen, um einen Bruch mit einer ganzen Zahl zu multiplizieren. Zum Beispiel ein visuelles Bruchmodell verwenden, um $3 \\times (2/5)$ als $6 \\times (1/5)$ auszudrücken und dieses Produkt als 6/5 zu erkennen. (Im Allgemeinen gilt $n \\times (a/b) = (n \\times a)/b$.)"},
{"id": "4.NF.B.4a", "description": "Einen Bruch $a/b$ als ein Vielfaches von $1/b$ verstehen. Zum Beispiel ein visuelles Bruchmodell verwenden, um $5/4$ als das Produkt $5 \\times (1/4)$ darzustellen und die Schlussfolgerung durch die Gleichung $5/4 = 5 \\times (1/4)$ festzuhalten."},
{"id": "4.NF.B.4b", "description": "Ein Vielfaches von $a/b$ als ein Vielfaches von $1/b$ verstehen und dieses Verständnis nutzen, um einen Bruch mit einer ganzen Zahl zu multiplizieren. Zum Beispiel ein visuelles Bruchmodell verwenden, um $3 \\times (2/5)$ als $6 \\times (1/5)$ auszudrücken und dieses Produkt als $6/5$ zu erkennen. (Im Allgemeinen gilt $n \\times (a/b) = (n \\times a)/b$.)"},
{"id": "4.NF.B.4c", "description": "Textaufgaben zur Multiplikation eines Bruchs mit einer ganzen Zahl lösen, z.B. unter Verwendung von visuellen Bruchmodellen und Gleichungen zur Darstellung des Problems. Zum Beispiel: Wenn jede Person auf einer Party 3/8 Pfund Roastbeef isst und 5 Personen an der Party teilnehmen, wie viele Pfund Roastbeef werden benötigt? Zwischen welchen beiden ganzen Zahlen liegt Ihre Antwort?"},
{"id": "4.NF.C", "description": "Dezimalschreibweise für Brüche verstehen und Dezimalbrüche vergleichen."},
{"id": "4.NF.C.5", "description": "Einen Bruch mit dem Nenner 10 als äquivalenten Bruch mit dem Nenner 100 ausdrücken und diese Technik verwenden, um zwei Brüche mit den Nennern 10 bzw. 100 zu addieren. (Schüler, die äquivalente Brüche erzeugen können, können Strategien für die allgemeine Addition von Brüchen mit ungleichen Nennern entwickeln. Die Addition und Subtraktion mit ungleichen Nennern im Allgemeinen ist jedoch in dieser Klassenstufe keine Anforderung.) Zum Beispiel $3/10$ als $30/100$ ausdrücken und $3/10 + 4/100 = 34/100$ addieren."},
{"id": "4.NF.C.6", "description": "Dezimalschreibweise für Brüche mit den Nennern 10 oder 100 verwenden. Zum Beispiel 0,62 als 62/100 umschreiben; eine Länge als 0,62 Meter beschreiben; 0,62 auf einem Zahlenstrahl lokalisieren."},
{"id": "4.NF.C.7", "description": "Zwei Dezimalzahlen bis auf Hundertstel durch Überlegungen zu ihrer Größe vergleichen. Erkennen, dass Vergleiche nur gültig sind, wenn sich die beiden Dezimalzahlen auf dasselbe Ganze beziehen. Die Ergebnisse der Vergleiche mit den Symbolen >, =, oder < notieren und die Schlussfolgerungen begründen, z.B. durch die Verwendung eines visuellen Modells."},
{"id": "4.MD.A", "description": "Aufgaben zur Messung und Umrechnung von Maßeinheiten von einer größeren in eine kleinere Einheit lösen."},
{"id": "4.MD.A.1", "description": "Die relativen Größen von Maßeinheiten innerhalb eines Einheitensystems kennen, einschließlich km, m, cm; kg, g; lb, oz.; l, ml; h, min, s. Innerhalb eines einzelnen Maßsystems Messungen in einer größeren Einheit in Form einer kleineren Einheit ausdrücken. Maßäquivalenzen in einer zweispaltigen Tabelle festhalten. Zum Beispiel wissen, dass 1 ft 12-mal so lang ist wie 1 in. Die Länge einer 4 ft langen Schlange als 48 in ausdrücken. Eine Umrechnungstabelle für Fuß und Zoll erstellen, die die Zahlenpaare (1, 12), (2, 24), (3, 36), ... auflistet."},
{"id": "4.MD.A.2", "description": "Die vier Grundrechenarten verwenden, um Textaufgaben zu lösen, die Entfernungen, Zeitintervalle, Flüssigkeitsvolumen, Massen von Objekten und Geld betreffen, einschließlich Aufgaben mit einfachen Brüchen oder Dezimalzahlen und Aufgaben, die das Ausdrücken von Messungen, die in einer größeren Einheit gegeben sind, in Form einer kleineren Einheit erfordern. Messgrößen mithilfe von Diagrammen wie Zahlenstrahlen mit einer Messskala darstellen."},
{"id": "4.MD.A.3", "description": "Die Formeln für Flächeninhalt und Umfang von Rechtecken in realen und mathematischen Problemen anwenden. Zum Beispiel die Breite eines rechteckigen Raumes bei gegebenem Flächeninhalt des Bodens und der Länge finden, indem die Flächenformel als eine Multiplikationsgleichung mit einem unbekannten Faktor betrachtet wird."},
{"id": "4.MD.B", "description": "Daten darstellen und interpretieren."},
{"id": "4.MD.B.4", "description": "Ein Punktdiagramm erstellen, um einen Datensatz von Messungen in Bruchteilen einer Einheit (1/2, 1/4, 1/8) darzustellen. Probleme zur Addition und Subtraktion von Brüchen unter Verwendung von Informationen aus Punktdiagrammen lösen. Zum Beispiel aus einem Punktdiagramm den Längenunterschied zwischen dem längsten und dem kürzesten Exemplar in einer Insektensammlung finden und interpretieren."},
{"id": "4.MD.C", "description": "Geometrische Messung: Konzepte von Winkeln verstehen und Winkel messen."},
{"id": "4.MD.C.5", "description": "Winkel als geometrische Formen erkennen, die entstehen, wenn zwei Strahlen einen gemeinsamen Endpunkt haben, und die Konzepte der Winkelmessung verstehen:\n - Ein Winkel wird in Bezug auf einen Kreis gemessen, dessen Mittelpunkt der gemeinsame Endpunkt der Strahlen ist, indem der Bruchteil des Kreisbogens zwischen den Punkten betrachtet wird, an denen die beiden Strahlen den Kreis schneiden. Ein Winkel, der sich über 1/360 eines Kreises erstreckt, wird als „Ein-Grad-Winkel“ bezeichnet und kann zum Messen von Winkeln verwendet werden.\n - Ein Winkel, der sich über n Ein-Grad-Winkel erstreckt, hat ein Winkelmaß von n Grad."},
{"id": "4.MD.C.5a", "description": "Ein Winkel wird in Bezug auf einen Kreis gemessen, dessen Mittelpunkt der gemeinsame Endpunkt der Strahlen ist, indem der Bruchteil des Kreisbogens zwischen den Punkten betrachtet wird, an denen die beiden Strahlen den Kreis schneiden. Ein Winkel, der sich über 1/360 eines Kreises erstreckt, wird als „Ein-Grad-Winkel“ bezeichnet und kann zum Messen von Winkeln verwendet werden."},
{"id": "4.MD.C.5b", "description": "Ein Winkel, der sich über n Ein-Grad-Winkel erstreckt, hat ein Winkelmaß von n Grad."}
{"id": "4.MD.C.6", "description": "Winkel in ganzen Gradzahlen mit einem Geodreieck messen. Winkel mit vorgegebenem Maß skizzieren."},
{"id": "4.MD.C.7", "description": "Winkelmaß als additiv erkennen. Wenn ein Winkel in nicht überlappende Teile zerlegt wird, ist das Winkelmaß des Ganzen die Summe der Winkelmaße der Teile. Additions- und Subtraktionsaufgaben lösen, um unbekannte Winkel in einem Diagramm in realen und mathematischen Problemen zu finden, z.B. unter Verwendung einer Gleichung mit einem Symbol für das unbekannte Winkelmaß."},
{"id": "4.G.A", "description": "Linien und Winkel zeichnen und identifizieren und Formen nach den Eigenschaften ihrer Linien und Winkel klassifizieren."},
{"id": "4.G.A.1", "description": "Punkte, Geraden, Strecken, Strahlen, Winkel (rechter, spitzer, stumpfer) sowie senkrechte und parallele Linien zeichnen. Diese in zweidimensionalen Figuren identifizieren."},
{"id": "4.G.A.2", "description": "Zweidimensionale Figuren basierend auf dem Vorhandensein oder Fehlen von parallelen oder senkrechten Linien oder dem Vorhandensein oder Fehlen von Winkeln einer bestimmten Größe klassifizieren. Rechtwinklige Dreiecke als eine Kategorie erkennen und identifizieren."},
{"id": "4.G.A.3", "description": "Eine Symmetrieachse einer zweidimensionalen Figur als eine Linie durch die Figur erkennen, entlang derer die Figur in deckungsgleiche Teile gefaltet werden kann. Achsensymmetrische Figuren identifizieren und Symmetrieachsen zeichnen."},
{"id": "5.OA.A", "description": "Rechenausdrücke schreiben und interpretieren."},
{"id": "5.OA.A.1", "description": "Klammern (runde, eckige oder geschweifte) in Rechenausdrücken verwenden und Ausdrücke mit diesen Symbolen berechnen."},
{"id": "5.OA.A.2", "description": "Einfache Ausdrücke schreiben, die Berechnungen mit Zahlen festhalten, und Rechenausdrücke interpretieren, ohne sie zu berechnen. Zum Beispiel die Berechnung „addiere 8 und 7, dann multipliziere mit 2“ als $2 \\times (8 + 7)$ ausdrücken. Erkennen, dass $3 \\times (18932 + 921)$ dreimal so groß ist wie $18932 + 921$, ohne die angegebene Summe oder das Produkt berechnen zu müssen."},
{"id": "5.OA.B", "description": "Muster und Beziehungen analysieren."},
{"id": "5.OA.B.3", "description": "Zwei Zahlenfolgen unter Verwendung von zwei gegebenen Regeln erzeugen. Offensichtliche Beziehungen zwischen den entsprechenden Gliedern identifizieren. Geordnete Paare aus den entsprechenden Gliedern der beiden Folgen bilden und die geordneten Paare in einem Koordinatensystem grafisch darstellen. Zum Beispiel bei der Regel „Addiere 3“ und der Startzahl 0 und der Regel „Addiere 6“ und der Startzahl 0 die Glieder der resultierenden Folgen erzeugen und beobachten, dass die Glieder in der einen Folge doppelt so groß sind wie die entsprechenden Glieder in der anderen Folge. Informell erklären, warum das so ist."},
{"id": "5.NBT.A", "description": "Das Stellenwertsystem verstehen."},
{"id": "5.NBT.A.1", "description": "Erkennen, dass in einer mehrstelligen Zahl eine Ziffer an einer bestimmten Stelle das 10-fache dessen darstellt, was sie an der Stelle rechts davon darstellt, und 1/10 dessen, was sie an der Stelle links davon darstellt."},
{"id": "5.NBT.A.2", "description": "Muster in der Anzahl der Nullen des Produkts beim Multiplizieren einer Zahl mit Zehnerpotenzen erklären und Muster in der Platzierung des Kommas erklären, wenn eine Dezimalzahl mit einer Zehnerpotenz multipliziert oder dividiert wird. Ganzzahlige Exponenten verwenden, um Zehnerpotenzen zu bezeichnen."},
{"id": "5.NBT.A.3", "description": "Dezimalzahlen bis zu den Tausendsteln lesen, schreiben und vergleichen.\nInhalt dieses Standards:\n - Dezimalzahlen bis zu den Tausendsteln unter Verwendung von Ziffern, Zahlwörtern und der erweiterten Schreibweise lesen und schreiben, z.B. $347,392 = 3 \\times 100 + 4 \\times 10 + 7 \\times 1 + 3 \\times (1/10) + 9 \\times (1/100) + 2 \\times (1/1000)$.\n - Zwei Dezimalzahlen bis zu den Tausendsteln basierend auf der Bedeutung der Ziffern an jeder Stelle vergleichen und die Ergebnisse der Vergleiche mit den Symbolen >, =, und < notieren."},
{"id": "5.NBT.A.3a", "description": "Dezimalzahlen bis zu den Tausendsteln unter Verwendung von Ziffern, Zahlwörtern und der erweiterten Schreibweise lesen und schreiben, z.B. $347,392 = 3 \\times 100 + 4 \\times 10 + 7 \\times 1 + 3 \\times (1/10) + 9 \\times (1/100) + 2 \\times (1/1000)$."},
{"id": "5.NBT.A.3b", "description": "Zwei Dezimalzahlen bis zu den Tausendsteln basierend auf der Bedeutung der Ziffern an jeder Stelle vergleichen und die Ergebnisse der Vergleiche mit den Symbolen >, =, und < notieren."},
{"id": "5.NBT.A.4", "description": "Das Stellenwertverständnis nutzen, um Dezimalzahlen auf eine beliebige Stelle zu runden."},
{"id": "5.NBT.B", "description": "Operationen mit mehrstelligen ganzen Zahlen und mit Dezimalzahlen bis zu den Hundertsteln durchführen."},
{"id": "5.NBT.B.5", "description": "Mehrstellige ganze Zahlen unter Verwendung des Standardalgorithmus sicher multiplizieren."},
{"id": "5.NBT.B.6", "description": "Ganzzahlige Quotienten von ganzen Zahlen mit bis zu vierstelligen Dividenden und zweistelligen Divisoren finden, unter Verwendung von Strategien, die auf dem Stellenwert, den Eigenschaften von Rechenoperationen und/oder der Beziehung zwischen Multiplikation und Division basieren. Die Berechnung unter Verwendung von Gleichungen, rechteckigen Anordnungen und/oder Flächenmodellen veranschaulichen und erklären."},
{"id": "5.NBT.B.7", "description": "Dezimalzahlen bis zu den Hundertsteln addieren, subtrahieren, multiplizieren und dividieren, unter Verwendung von konkreten Modellen oder Zeichnungen und Strategien, die auf dem Stellenwert, den Eigenschaften von Rechenoperationen und/oder der Beziehung zwischen Addition und Subtraktion basieren; die Strategie mit einer schriftlichen Methode in Beziehung setzen und die verwendete Vorgehensweise erklären."},
{"id": "5.NF.A", "description": "Äquivalente Brüche als Strategie zum Addieren und Subtrahieren von Brüchen verwenden."},
{"id": "5.NF.A.1", "description": "Brüche mit ungleichnamigen Nennern (einschließlich gemischter Zahlen) addieren und subtrahieren, indem die gegebenen Brüche durch äquivalente Brüche so ersetzt werden, dass eine äquivalente Summe oder Differenz von Brüchen mit gleichnamigen Nennern entsteht. Zum Beispiel, $2/3 + 5/4 = 8/12 + 15/12 = 23/12$. (Im Allgemeinen gilt $a/b + c/d = (ad + bc)/bd$.)"},
{"id": "5.NF.A.2", "description": "Textaufgaben zur Addition und Subtraktion von Brüchen lösen, die sich auf dasselbe Ganze beziehen, einschließlich Fällen mit ungleichnamigen Nennern, z.B. unter Verwendung von visuellen Bruchmodellen oder Gleichungen zur Darstellung des Problems. Bezugsbrüche und ein Zahlengefühl für Brüche verwenden, um mental zu schätzen und die Plausibilität von Antworten zu beurteilen. Zum Beispiel ein falsches Ergebnis wie $2/5 + 1/2 = 3/7$ erkennen, indem man beobachtet, dass $3/7 < 1/2$ ist."},
{"id": "5.NF.B", "description": "Frühere Verständnisse der Multiplikation und Division anwenden und erweitern, um Brüche zu multiplizieren und zu dividieren."}
{"id": "5.NF.B.3", "description": "Einen Bruch als Division des Zählers durch den Nenner interpretieren ($a/b = a \\div b$). Textaufgaben zur Division ganzer Zahlen lösen, die zu Ergebnissen in Form von Brüchen oder gemischten Zahlen führen, z.B. unter Verwendung von visuellen Bruchmodellen oder Gleichungen zur Darstellung des Problems. Zum Beispiel 3/4 als das Ergebnis der Division von 3 durch 4 interpretieren, dabei beachten, dass 3/4 multipliziert mit 4 gleich 3 ist, und dass, wenn 3 Ganze gleichmäßig auf 4 Personen aufgeteilt werden, jede Person einen Anteil der Größe 3/4 hat. Wenn 9 Personen einen 50-Pfund-Sack Reis nach Gewicht gleichmäßig teilen wollen, wie viele Pfund Reis sollte jede Person bekommen? Zwischen welchen beiden ganzen Zahlen liegt Ihre Antwort?"},
{"id": "5.NF.B.4", "description": "Frühere Verständnisse der Multiplikation anwenden und erweitern, um einen Bruch oder eine ganze Zahl mit einem Bruch zu multiplizieren.\nInhalt dieses Standards:\n - Den Flächeninhalt eines Rechtecks mit gebrochenen Seitenlängen bestimmen, indem es mit Einheitsquadraten der entsprechenden Stammbruch-Seitenlängen ausgelegt wird, und zeigen, dass der Flächeninhalt derselbe ist, den man durch Multiplikation der Seitenlängen erhält. Gebrochene Seitenlängen multiplizieren, um die Flächeninhalte von Rechtecken zu finden, und Bruchprodukte als rechteckige Flächen darstellen.\n - Das Produkt $(a/b) \\times q$ als a Teile einer Aufteilung von q in b gleiche Teile interpretieren; äquivalent dazu als Ergebnis einer Folge von Operationen $a \\times q \\div b$. Zum Beispiel ein visuelles Bruchmodell verwenden, um $(2/3) \\times 4 = 8/3$ zu zeigen, und einen Sachkontext für diese Gleichung erstellen. Dasselbe mit $(2/3) \\times (4/5) = 8/15$ durchführen. (Im Allgemeinen gilt $(a/b) \\times (c/d) = ac/bd$.)"},
{"id": "5.NF.B.4a", "description": "Das Produkt $(a/b) \\times q$ als a Teile einer Aufteilung von q in b gleiche Teile interpretieren; äquivalent dazu als Ergebnis einer Folge von Operationen $a \\times q \\div b$. Zum Beispiel ein visuelles Bruchmodell verwenden, um $(2/3) \\times 4 = 8/3$ zu zeigen, und einen Sachkontext für diese Gleichung erstellen. Dasselbe mit $(2/3) \\times (4/5) = 8/15$ durchführen. (Im Allgemeinen gilt $(a/b) \\times (c/d) = ac/bd$.)"},
{"id": "5.NF.B.4b", "description": "Den Flächeninhalt eines Rechtecks mit gebrochenen Seitenlängen bestimmen, indem es mit Einheitsquadraten der entsprechenden Stammbruch-Seitenlängen ausgelegt wird, und zeigen, dass der Flächeninhalt derselbe ist, den man durch Multiplikation der Seitenlängen erhält. Gebrochene Seitenlängen multiplizieren, um die Flächeninhalte von Rechtecken zu finden, und Bruchprodukte als rechteckige Flächen darstellen."},
{"id": "5.NF.B.5", "description": "Multiplikation als Skalierung (Größenänderung) interpretieren, indem:\n - Erklärt wird, warum die Multiplikation einer gegebenen Zahl mit einem Bruch größer als 1 zu einem Produkt führt, das größer als die gegebene Zahl ist (wobei die Multiplikation mit ganzen Zahlen größer als 1 als bekannter Fall erkannt wird); erklärt wird, warum die Multiplikation einer gegebenen Zahl mit einem Bruch kleiner als 1 zu einem Produkt führt, das kleiner als die gegebene Zahl ist; und das Prinzip der Bruchäquivalenz $a/b = (n \\times a)/(n \\times b)$ mit dem Effekt der Multiplikation von $a/b$ mit 1 in Beziehung gesetzt wird.\n - Die Größe eines Produkts mit der Größe eines Faktors auf der Grundlage der Größe des anderen Faktors verglichen wird, ohne die angegebene Multiplikation durchzuführen."},
{"id": "5.NF.B.5a", "description": "Die Größe eines Produkts mit der Größe eines Faktors auf der Grundlage der Größe des anderen Faktors vergleichen, ohne die angegebene Multiplikation durchzuführen."},
{"id": "5.NF.B.5b", "description": "Erklären, warum die Multiplikation einer gegebenen Zahl mit einem Bruch größer als 1 zu einem Produkt führt, das größer als die gegebene Zahl ist (wobei die Multiplikation mit ganzen Zahlen größer als 1 als bekannter Fall erkannt wird); erklären, warum die Multiplikation einer gegebenen Zahl mit einem Bruch kleiner als 1 zu einem Produkt führt, das kleiner als die gegebene Zahl ist; und das Prinzip der Bruchäquivalenz $a/b = (n \\times a)/(n \\times b)$ mit dem Effekt der Multiplikation von $a/b$ mit 1 in Beziehung setzen."},
{"id": "5.NF.B.6", "description": "Reale Probleme mit der Multiplikation von Brüchen und gemischten Zahlen lösen, z.B. unter Verwendung von visuellen Bruchmodellen oder Gleichungen zur Darstellung des Problems."},
{"id": "5.NF.B.7", "description": "Frühere Verständnisse der Division anwenden und erweitern, um Stammbrüche durch ganze Zahlen und ganze Zahlen durch Stammbrüche zu dividieren. (Schüler, die Brüche im Allgemeinen multiplizieren können, können Strategien entwickeln, um Brüche im Allgemeinen zu dividieren, indem sie über die Beziehung zwischen Multiplikation und Division nachdenken. Die Division eines Bruchs durch einen Bruch ist jedoch in dieser Klassenstufe keine Anforderung.)\nInhalt dieses Standards:\n - Reale Probleme lösen, die die Division von Stammbrüchen durch ganze Zahlen ungleich Null und die Division von ganzen Zahlen durch Stammbrüche beinhalten, z.B. unter Verwendung von visuellen Bruchmodellen und Gleichungen zur Darstellung des Problems. Zum Beispiel: Wie viel Schokolade bekommt jede Person, wenn 3 Personen 1/2 Pfund Schokolade gleichmäßig teilen? Wie viele 1/3-Tassen-Portionen sind in 2 Tassen Rosinen?\n - Die Division einer ganzen Zahl durch einen Stammbruch interpretieren und solche Quotienten berechnen. Zum Beispiel einen Sachkontext für $4 \\div (1/5)$ erstellen und ein visuelles Bruchmodell verwenden, um den Quotienten zu zeigen. Die Beziehung zwischen Multiplikation und Division nutzen, um zu erklären, dass $4 \\div (1/5) = 20$, weil $20 \\times (1/5) = 4$.\n - Die Division eines Stammbruchs durch eine ganze Zahl ungleich Null interpretieren und solche Quotienten berechnen. Zum Beispiel einen Sachkontext für $(1/3) \\div 4$ erstellen und ein visuelles Bruchmodell verwenden, um den Quotienten zu zeigen. Die Beziehung zwischen Multiplikation und Division nutzen, um zu erklären, dass $(1/3) \\div 4 = 1/12$, weil $(1/12) \\times 4 = 1/3$."},
{"id": "5.NF.B.7a", "description": "Die Division eines Stammbruchs durch eine ganze Zahl ungleich Null interpretieren und solche Quotienten berechnen. Zum Beispiel einen Sachkontext für $(1/3) \\div 4$ erstellen und ein visuelles Bruchmodell verwenden, um den Quotienten zu zeigen. Die Beziehung zwischen Multiplikation und Division nutzen, um zu erklären, dass $(1/3) \\div 4 = 1/12$, weil $(1/12) \\times 4 = 1/3$."},
{"id": "5.NF.B.7b", "description": "Die Division einer ganzen Zahl durch einen Stammbruch interpretieren und solche Quotienten berechnen. Zum Beispiel einen Sachkontext für $4 \\div (1/5)$ erstellen und ein visuelles Bruchmodell verwenden, um den Quotienten zu zeigen. Die Beziehung zwischen Multiplikation und Division nutzen, um zu erklären, dass $4 \\div (1/5) = 20$, weil $20 \\times (1/5) = 4$."},
{"id": "5.NF.B.7c", "description": "Reale Probleme lösen, die die Division von Stammbrüchen durch ganze Zahlen ungleich Null und die Division von ganzen Zahlen durch Stammbrüche beinhalten, z.B. unter Verwendung von visuellen Bruchmodellen und Gleichungen zur Darstellung des Problems. Zum Beispiel: Wie viel Schokolade bekommt jede Person, wenn 3 Personen 1/2 Pfund Schokolade gleichmäßig teilen? Wie viele 1/3-Tassen-Portionen sind in 2 Tassen Rosinen?"},
{"id": "5.MD.A", "description": "Gleichartige Maßeinheiten innerhalb eines gegebenen Maßsystems umrechnen."},
{"id": "5.MD.A.1", "description": "Zwischen verschieden großen Standard-Maßeinheiten innerhalb eines gegebenen Maßsystems umrechnen (z.B. 5 cm in 0,05 m umwandeln) und diese Umrechnungen bei der Lösung von mehrschrittigen, realen Problemen verwenden."},
{"id": "5.MD.B", "description": "Daten darstellen und interpretieren."},
{"id": "5.MD.B.2", "description": "Ein Punktdiagramm erstellen, um einen Datensatz von Messungen in Bruchteilen einer Einheit (1/2, 1/4, 1/8) darzustellen. Operationen mit Brüchen für diese Klassenstufe verwenden, um Probleme zu lösen, die Informationen aus Punktdiagrammen beinhalten. Zum Beispiel bei gegebenen unterschiedlichen Flüssigkeitsmessungen in identischen Bechergläsern die Flüssigkeitsmenge finden, die jedes Becherglas enthalten würde, wenn die Gesamtmenge in allen Bechergläsern gleichmäßig umverteilt würde."},
{"id": "5.MD.C", "description": "Geometrische Messung: Konzepte des Volumens verstehen und das Volumen mit Multiplikation und Addition in Beziehung setzen."},
{"id": "5.MD.C.3", "description": "Volumen als eine Eigenschaft von Körpern erkennen und Konzepte der Volumenmessung verstehen.\nInhalt dieses Standards:\n - Ein Körper, der lückenlos und ohne Überlappungen mit n Einheitswürfeln gefüllt werden kann, hat ein Volumen von n Volumeneinheiten.\n - Ein Würfel mit der Kantenlänge 1 Einheit, „Einheitswürfel“ genannt, hat „eine Volumeneinheit“ an Volumen und kann zur Messung von Volumen verwendet werden."},
{"id": "5.MD.C.3a", "description": "Ein Würfel mit der Kantenlänge 1 Einheit, „Einheitswürfel“ genannt, hat „eine Volumeneinheit“ an Volumen und kann zur Messung von Volumen verwendet werden."},
{"id": "5.MD.C.3b", "description": "Ein Körper, der lückenlos und ohne Überlappungen mit n Einheitswürfeln gefüllt werden kann, hat ein Volumen von n Volumeneinheiten."},
{"id": "5.MD.C.4", "description": "Volumen durch Zählen von Einheitswürfeln messen, unter Verwendung von Kubikzentimetern, Kubikzoll, Kubikfuß und selbstgewählten Einheiten."},
{"id": "5.MD.C.5", "description": "Das Volumen mit den Operationen der Multiplikation und Addition in Beziehung setzen und reale und mathematische Probleme mit Volumen lösen.\nInhalt dieses Standards:\n - Volumen als additiv erkennen. Volumen von Körpern, die aus zwei nicht überlappenden Quadern zusammengesetzt sind, durch Addition der Volumen der nicht überlappenden Teile finden und diese Technik zur Lösung von realen Problemen anwenden.\n - Die Formeln $V = l \\times b \\times h$ und $V = G \\times h$ für Quader anwenden, um das Volumen von Quadern mit ganzzahligen Kantenlängen im Kontext der Lösung von realen und mathematischen Problemen zu finden.\n - Das Volumen eines Quaders mit ganzzahligen Seitenlängen durch Füllen mit Einheitswürfeln finden und zeigen, dass das Volumen dasselbe ist, das man durch Multiplikation der Kantenlängen oder äquivalent durch Multiplikation der Höhe mit dem Flächeninhalt der Grundfläche erhält. Dreifache Produkte ganzer Zahlen als Volumen darstellen, z.B. um das Assoziativgesetz der Multiplikation zu repräsentieren."},
{"id": "5.MD.C.5a", "description": "Das Volumen eines Quaders mit ganzzahligen Seitenlängen durch Füllen mit Einheitswürfeln finden und zeigen, dass das Volumen dasselbe ist, das man durch Multiplikation der Kantenlängen oder äquivalent durch Multiplikation der Höhe mit dem Flächeninhalt der Grundfläche erhält. Dreifache Produkte ganzer Zahlen als Volumen darstellen, z.B. um das Assoziativgesetz der Multiplikation zu repräsentieren."},
{"id": "5.MD.C.5b", "description": "Die Formeln $V = l \\times b \\times h$ und $V = G \\times h$ für Quader anwenden, um das Volumen von Quadern mit ganzzahligen Kantenlängen im Kontext der Lösung von realen und mathematischen Problemen zu finden."}
{"id": "5.MD.C.5c", "description": "Volumen als additiv erkennen. Volumen von Körpern, die aus zwei nicht überlappenden Quadern zusammengesetzt sind, durch Addition der Volumen der nicht überlappenden Teile finden und diese Technik zur Lösung von realen Problemen anwenden."},
{"id": "5.G.A", "description": "Punkte im Koordinatensystem grafisch darstellen, um reale und mathematische Probleme zu lösen."},
{"id": "5.G.A.1", "description": "Ein Paar senkrechter Zahlenstrahlen, Achsen genannt, verwenden, um ein Koordinatensystem zu definieren, wobei der Schnittpunkt der Linien (der Ursprung) mit der 0 auf jeder Linie zusammenfällt und ein gegebener Punkt in der Ebene durch ein geordnetes Zahlenpaar, seine Koordinaten genannt, lokalisiert wird. Verstehen, dass die erste Zahl angibt, wie weit man vom Ursprung in Richtung einer Achse gehen muss, und die zweite Zahl angibt, wie weit man in Richtung der zweiten Achse gehen muss, wobei die Konvention gilt, dass die Namen der beiden Achsen und die Koordinaten übereinstimmen (z.B. x-Achse und x-Koordinate, y-Achse und y-Koordinate)."},
{"id": "5.G.A.2", "description": "Reale und mathematische Probleme durch das Eintragen von Punkten im ersten Quadranten des Koordinatensystems darstellen und die Koordinatenwerte von Punkten im Kontext der Situation interpretieren."},
{"id": "5.G.B", "description": "Zweidimensionale Figuren basierend auf ihren Eigenschaften in Kategorien einteilen."},
{"id": "5.G.B.3", "description": "Verstehen, dass Eigenschaften, die zu einer Kategorie zweidimensionaler Figuren gehören, auch zu allen Unterkategorien dieser Kategorie gehören. Zum Beispiel haben alle Rechtecke vier rechte Winkel und Quadrate sind Rechtecke, also haben alle Quadrate vier rechte Winkel."},
{"id": "5.G.B.4", "description": "Zweidimensionale Figuren in einer Hierarchie basierend auf ihren Eigenschaften klassifizieren."},
{"id": "6.RP.A", "description": "Verhältniskonzepte verstehen und proportionales Denken zur Problemlösung nutzen."},
{"id": "6.RP.A.1", "description": "Das Konzept eines Verhältnisses verstehen und die Sprache der Verhältnisse verwenden, um eine Verhältnisbeziehung zwischen zwei Größen zu beschreiben. Zum Beispiel: „Das Verhältnis von Flügeln zu Schnäbeln im Vogelhaus im Zoo war 2:1, denn auf je 2 Flügel kam 1 Schnabel.“ „Für jede Stimme, die Kandidat A erhielt, erhielt Kandidat C fast drei Stimmen.“"},
{"id": "6.RP.A.2", "description": "Das Konzept einer Einheitsrate a/b verstehen, die mit einem Verhältnis a:b mit $b \\neq 0$ verbunden ist, und die Sprache der Raten im Kontext einer Verhältnisbeziehung verwenden. Zum Beispiel: „Dieses Rezept hat ein Verhältnis von 3 Tassen Mehl zu 4 Tassen Zucker, also gibt es 3/4 Tasse Mehl für jede Tasse Zucker.“ „Wir haben 75 $ für 15 Hamburger bezahlt, was einer Rate von 5 $ pro Hamburger entspricht.“ (Die Erwartungen an Einheitsraten in dieser Klassenstufe sind auf nicht-komplexe Brüche beschränkt.)"},
{"id": "6.RP.A.3", "description": "Proportionales Denken und Raten verwenden, um reale und mathematische Probleme zu lösen, z.B. durch Überlegungen zu Tabellen mit äquivalenten Verhältnissen, Streifenmodellen, doppelten Zahlenstrahlen oder Gleichungen.\nInhalt dieses Standards:\n - Einen Prozentsatz einer Größe als Rate pro 100 finden (z.B. 30 % einer Größe bedeutet 30/100 mal die Größe); Probleme lösen, bei denen das Ganze bei gegebenem Teil und Prozentsatz gefunden werden muss.\n - Tabellen mit äquivalenten Verhältnissen erstellen, die Größen mit ganzzahligen Maßen in Beziehung setzen, fehlende Werte in den Tabellen finden und die Wertepaare im Koordinatensystem eintragen. Tabellen zum Vergleichen von Verhältnissen verwenden.\n - Aufgaben zu Einheitsraten lösen, einschließlich solcher, die Stückpreise und konstante Geschwindigkeit beinhalten. Zum Beispiel: Wenn es 7 Stunden dauerte, 4 Rasenflächen zu mähen, wie viele Rasenflächen könnten dann bei dieser Rate in 35 Stunden gemäht werden? Mit welcher Rate wurden die Rasenflächen gemäht?\n - Proportionales Denken zur Umrechnung von Maßeinheiten verwenden; Einheiten beim Multiplizieren oder Dividieren von Größen angemessen handhaben und umwandeln."},
{"id": "6.RP.A.3a", "description": "Tabellen mit äquivalenten Verhältnissen erstellen, die Größen mit ganzzahligen Maßen in Beziehung setzen, fehlende Werte in den Tabellen finden und die Wertepaare im Koordinatensystem eintragen. Tabellen zum Vergleichen von Verhältnissen verwenden."},
{"id": "6.RP.A.3b", "description": "Aufgaben zu Einheitsraten lösen, einschließlich solcher, die Stückpreise und konstante Geschwindigkeit beinhalten. Zum Beispiel: Wenn es 7 Stunden dauerte, 4 Rasenflächen zu mähen, wie viele Rasenflächen könnten dann bei dieser Rate in 35 Stunden gemäht werden? Mit welcher Rate wurden die Rasenflächen gemäht?"},
{"id": "6.RP.A.3c", "description": "Einen Prozentsatz einer Größe als Rate pro 100 finden (z.B. 30 % einer Größe bedeutet 30/100 mal die Größe); Probleme lösen, bei denen das Ganze bei gegebenem Teil und Prozentsatz gefunden werden muss."},
{"id": "6.RP.A.3d", "description": "Proportionales Denken zur Umrechnung von Maßeinheiten verwenden; Einheiten beim Multiplizieren oder Dividieren von Größen angemessen handhaben und umwandeln."},
{"id": "6.NS.A", "description": "Frühere Verständnisse der Multiplikation und Division anwenden und erweitern, um Brüche durch Brüche zu dividieren."},
{"id": "6.NS.A.1", "description": "Quotienten von Brüchen interpretieren und berechnen und Textaufgaben zur Division von Brüchen durch Brüche lösen, z.B. unter Verwendung von visuellen Bruchmodellen und Gleichungen zur Darstellung des Problems. Zum Beispiel einen Sachkontext für $(2/3) \\div (3/4)$ erstellen und ein visuelles Bruchmodell verwenden, um den Quotienten zu zeigen; die Beziehung zwischen Multiplikation und Division nutzen, um zu erklären, dass $(2/3) \\div (3/4) = 8/9$, weil 3/4 von 8/9 gleich 2/3 ist. (Im Allgemeinen gilt $(a/b) \\div (c/d) = ad/bc$.) Wie viel Schokolade bekommt jede Person, wenn 3 Personen 1/2 Pfund Schokolade gleichmäßig teilen? Wie viele 3/4-Tassen-Portionen sind in 2/3 einer Tasse Joghurt? Wie breit ist ein rechteckiger Landstreifen mit einer Länge von 3/4 Meilen und einer Fläche von 1/2 Quadratmeilen?"},
{"id": "6.NS.B", "description": "Sicher mit mehrstelligen Zahlen rechnen und gemeinsame Teiler und Vielfache finden."},
{"id": "6.NS.B.2", "description": "Mehrstellige Zahlen unter Verwendung des Standardalgorithmus sicher dividieren."},
{"id": "6.NS.B.3", "description": "Mehrstellige Dezimalzahlen unter Verwendung des Standardalgorithmus für jede Operation sicher addieren, subtrahieren, multiplizieren und dividieren."},
{"id": "6.NS.B.4", "description": "Den größten gemeinsamen Teiler (ggT) von zwei ganzen Zahlen kleiner oder gleich 100 und das kleinste gemeinsame Vielfache (kgV) von zwei ganzen Zahlen kleiner oder gleich 12 finden. Das Distributivgesetz verwenden, um eine Summe von zwei ganzen Zahlen von 1-100 mit einem gemeinsamen Teiler als ein Vielfaches einer Summe von zwei ganzen Zahlen ohne gemeinsamen Teiler auszudrücken. Zum Beispiel 36 + 8 als 4 (9 + 2) ausdrücken."},
{"id": "6.NS.C", "description": "Frühere Verständnisse von Zahlen auf das System der rationalen Zahlen anwenden und erweitern."},
{"id": "6.NS.C.5", "description": "Verstehen, dass positive und negative Zahlen zusammen verwendet werden, um Größen mit entgegengesetzten Richtungen oder Werten zu beschreiben (z.B. Temperatur über/unter Null, Höhe über/dem Meeresspiegel, Guthaben/Schulden, positive/negative elektrische Ladung); positive und negative Zahlen verwenden, um Größen in realen Kontexten darzustellen, und dabei die Bedeutung von 0 in jeder Situation erklären."},
{"id": "6.NS.C.6", "description": "Eine rationale Zahl als einen Punkt auf der Zahlengeraden verstehen. Zahlengeraden-Diagramme und Koordinatenachsen, die aus früheren Klassenstufen bekannt sind, erweitern, um Punkte auf der Geraden und in der Ebene mit negativen Zahlenkoordinaten darzustellen.\nInhalt dieses Standards:\n - Die Vorzeichen von Zahlen in geordneten Paaren als Angabe von Positionen in den Quadranten des Koordinatensystems verstehen; erkennen, dass, wenn sich zwei geordnete Paare nur durch die Vorzeichen unterscheiden, die Positionen der Punkte durch Spiegelungen an einer oder beiden Achsen miteinander in Beziehung stehen.\n - Ganze Zahlen und andere rationale Zahlen auf einer horizontalen oder vertikalen Zahlengeraden finden und positionieren; Paare von ganzen Zahlen und anderen rationalen Zahlen in einem Koordinatensystem finden und positionieren.\n - Entgegengesetzte Vorzeichen von Zahlen als Angabe von Positionen auf entgegengesetzten Seiten von 0 auf der Zahlengeraden erkennen; erkennen, dass die Gegenzahl der Gegenzahl einer Zahl die Zahl selbst ist, z.B. –(–3) = 3, und dass 0 ihre eigene Gegenzahl ist."},
{"id": "6.NS.C.6a", "description": "Entgegengesetzte Vorzeichen von Zahlen als Angabe von Positionen auf entgegengesetzten Seiten von 0 auf der Zahlengeraden erkennen; erkennen, dass die Gegenzahl der Gegenzahl einer Zahl die Zahl selbst ist, z.B. –(–3) = 3, und dass 0 ihre eigene Gegenzahl ist."},
{"id": "6.NS.C.6b", "description": "Die Vorzeichen von Zahlen in geordneten Paaren als Angabe von Positionen in den Quadranten des Koordinatensystems verstehen; erkennen, dass, wenn sich zwei geordnete Paare nur durch die Vorzeichen unterscheiden, die Positionen der Punkte durch Spiegelungen an einer oder beiden Achsen miteinander in Beziehung stehen."}
 {"id": "6.NS.C.6c", "description": "Ganze Zahlen und andere rationale Zahlen auf einer horizontalen oder vertikalen Zahlengeraden finden und positionieren; Paare von ganzen Zahlen und anderen rationalen Zahlen in einem Koordinatensystem finden und positionieren."},
{"id": "6.NS.C.7", "description": "Die Anordnung und den Betrag von rationalen Zahlen verstehen.\nInhalt dieses Standards:\n - Aussagen zur Anordnung von rationalen Zahlen in realen Kontexten schreiben, interpretieren und erklären. Zum Beispiel $-3^{\\circ}C > -7^{\\circ}C$ schreiben, um auszudrücken, dass $-3^{\\circ}C$ wärmer ist als $-7^{\\circ}C$.\n - Den Betrag einer rationalen Zahl als ihren Abstand von 0 auf der Zahlengeraden verstehen; den Betrag als Größe für eine positive oder negative Menge in einer realen Situation interpretieren. Zum Beispiel für einen Kontostand von -30 Dollar $|–30| = 30$ schreiben, um die Höhe der Schulden in Dollar zu beschreiben.\n - Ungleichungen als Aussagen über die relative Position zweier Zahlen auf einer Zahlengeraden interpretieren. Zum Beispiel $-3 > –7$ als eine Aussage interpretieren, dass -3 auf einer von links nach rechts orientierten Zahlengeraden rechts von -7 liegt.\n - Vergleiche von Beträgen von Aussagen über die Anordnung unterscheiden. Zum Beispiel erkennen, dass ein Kontostand von weniger als -30 Dollar Schulden von mehr als 30 Dollar darstellt."},
{"id": "6.NS.C.7a", "description": "Ungleichungen als Aussagen über die relative Position zweier Zahlen auf einer Zahlengeraden interpretieren. Zum Beispiel $-3 > –7$ als eine Aussage interpretieren, dass -3 auf einer von links nach rechts orientierten Zahlengeraden rechts von -7 liegt."},
{"id": "6.NS.C.7b", "description": "Aussagen zur Anordnung von rationalen Zahlen in realen Kontexten schreiben, interpretieren und erklären. Zum Beispiel $-3^{\\circ}C > -7^{\\circ}C$ schreiben, um auszudrücken, dass $-3^{\\circ}C$ wärmer ist als $-7^{\\circ}C$."},
{"id": "6.NS.C.7c", "description": "Den Betrag einer rationalen Zahl als ihren Abstand von 0 auf der Zahlengeraden verstehen; den Betrag als Größe für eine positive oder negative Menge in einer realen Situation interpretieren. Zum Beispiel für einen Kontostand von -30 Dollar $|–30| = 30$ schreiben, um die Höhe der Schulden in Dollar zu beschreiben."},
{"id": "6.NS.C.7d", "description": "Vergleiche von Beträgen von Aussagen über die Anordnung unterscheiden. Zum Beispiel erkennen, dass ein Kontostand von weniger als -30 Dollar Schulden von mehr als 30 Dollar darstellt."},
{"id": "6.NS.C.8", "description": "Reale und mathematische Probleme durch das Eintragen von Punkten in allen vier Quadranten des Koordinatensystems lösen. Dies beinhaltet die Verwendung von Koordinaten und Beträgen, um Abstände zwischen Punkten mit derselben ersten Koordinate oder derselben zweiten Koordinate zu finden."},
{"id": "6.EE.A", "description": "Frühere Verständnisse der Arithmetik auf algebraische Terme anwenden und erweitern."},
{"id": "6.EE.A.1", "description": "Numerische Terme mit ganzzahligen Exponenten schreiben und auswerten."},
{"id": "6.EE.A.2", "description": "Terme schreiben, lesen und auswerten, in denen Buchstaben für Zahlen stehen.\nInhalt dieses Standards:\n - Teile eines Terms unter Verwendung mathematischer Fachbegriffe (Summe, Summand/Term, Produkt, Faktor, Quotient, Koeffizient) identifizieren; einen oder mehrere Teile eines Terms als eine einzige Einheit betrachten. Zum Beispiel den Term $2(8 + 7)$ als ein Produkt von zwei Faktoren beschreiben; $(8 + 7)$ sowohl als eine einzige Einheit als auch als eine Summe von zwei Summanden betrachten.\n - Terme schreiben, die Operationen mit Zahlen und mit Buchstaben, die für Zahlen stehen, festhalten. Zum Beispiel die Berechnung „Subtrahiere y von 5“ als $5 – y$ ausdrücken.\n - Terme für bestimmte Werte ihrer Variablen auswerten. Dies schließt Terme ein, die aus Formeln in realen Problemen stammen. Arithmetische Operationen, einschließlich solcher mit ganzzahligen Exponenten, in der üblichen Reihenfolge durchführen, wenn keine Klammern eine bestimmte Reihenfolge vorgeben (Rechenregeln). Zum Beispiel die Formeln $V = s^3$ und $A = 6s^2$ verwenden, um das Volumen und den Oberflächeninhalt eines Würfels mit der Kantenlänge $s = 1/2$ zu finden."},
{"id": "6.EE.A.2a", "description": "Terme schreiben, die Operationen mit Zahlen und mit Buchstaben, die für Zahlen stehen, festhalten. Zum Beispiel die Berechnung „Subtrahiere y von 5“ als $5 – y$ ausdrücken."},
{"id": "6.EE.A.2b", "description": "Teile eines Terms unter Verwendung mathematischer Fachbegriffe (Summe, Summand/Term, Produkt, Faktor, Quotient, Koeffizient) identifizieren; einen oder mehrere Teile eines Terms als eine einzige Einheit betrachten. Zum Beispiel den Term $2(8 + 7)$ als ein Produkt von zwei Faktoren beschreiben; $(8 + 7)$ sowohl als eine einzige Einheit als auch als eine Summe von zwei Summanden betrachten."},
{"id": "6.EE.A.2c", "description": "Terme für bestimmte Werte ihrer Variablen auswerten. Dies schließt Terme ein, die aus Formeln in realen Problemen stammen. Arithmetische Operationen, einschließlich solcher mit ganzzahligen Exponenten, in der üblichen Reihenfolge durchführen, wenn keine Klammern eine bestimmte Reihenfolge vorgeben (Rechenregeln). Zum Beispiel die Formeln $V = s^3$ und $A = 6s^2$ verwenden, um das Volumen und den Oberflächeninhalt eines Würfels mit der Kantenlänge $s = 1/2$ zu finden."},
{"id": "6.EE.A.3", "description": "Die Eigenschaften von Rechenoperationen anwenden, um äquivalente Terme zu erzeugen. Zum Beispiel das Distributivgesetz auf den Term $3(2 + x)$ anwenden, um den äquivalenten Term $6 + 3x$ zu erzeugen; das Distributivgesetz auf den Term $24x + 18y$ anwenden, um den äquivalenten Term $6(4x + 3y)$ zu erzeugen; Eigenschaften von Rechenoperationen auf $y + y + y$ anwenden, um den äquivalenten Term $3y$ zu erzeugen."},
{"id": "6.EE.A.4", "description": "Erkennen, wann zwei Terme äquivalent sind (d.h. wenn die beiden Terme dieselbe Zahl benennen, unabhängig davon, welcher Wert für die Variable eingesetzt wird). Zum Beispiel sind die Terme $y + y + y$ und $3y$ äquivalent, weil sie dieselbe Zahl benennen, unabhängig davon, für welche Zahl y steht."},
{"id": "6.EE.B", "description": "Über Gleichungen und Ungleichungen mit einer Variablen nachdenken und diese lösen."},
{"id": "6.EE.B.5", "description": "Das Lösen einer Gleichung oder Ungleichung als einen Prozess des Beantwortens einer Frage verstehen: Welche Werte aus einer bestimmten Menge, falls vorhanden, machen die Gleichung oder Ungleichung wahr? Durch Einsetzen bestimmen, ob eine gegebene Zahl in einer bestimmten Menge eine Gleichung oder Ungleichung wahr macht."},
{"id": "6.EE.B.6", "description": "Variablen verwenden, um Zahlen darzustellen, und Terme beim Lösen eines realen oder mathematischen Problems schreiben; verstehen, dass eine Variable eine unbekannte Zahl oder, je nach Zweck, eine beliebige Zahl in einer bestimmten Menge darstellen kann."},
{"id": "6.EE.B.7", "description": "Reale und mathematische Probleme durch das Aufstellen und Lösen von Gleichungen der Form $x + p = q$ und $px = q$ für Fälle lösen, in denen p, q und x alle nichtnegative rationale Zahlen sind."},
{"id": "6.EE.B.8", "description": "Eine Ungleichung der Form $x > c$ oder $x < c$ schreiben, um eine Einschränkung oder Bedingung in einem realen oder mathematischen Problem darzustellen. Erkennen, dass Ungleichungen der Form $x > c$ oder $x < c$ unendlich viele Lösungen haben; Lösungen solcher Ungleichungen auf Zahlengeraden darstellen."},
{"id": "6.EE.C", "description": "Quantitative Beziehungen zwischen abhängigen und unabhängigen Variablen darstellen und analysieren."},
{"id": "6.EE.C.9", "description": "Variablen verwenden, um zwei Größen in einem realen Problem darzustellen, die sich in Beziehung zueinander ändern; eine Gleichung schreiben, um eine Größe (die als abhängige Variable betrachtet wird) in Bezug auf die andere Größe (die als unabhängige Variable betrachtet wird) auszudrücken. Die Beziehung zwischen der abhängigen und der unabhängigen Variablen mithilfe von Graphen und Tabellen analysieren und diese mit der Gleichung in Beziehung setzen. Zum Beispiel in einem Problem mit Bewegung bei konstanter Geschwindigkeit geordnete Paare von Entfernungen und Zeiten auflisten und grafisch darstellen und die Gleichung $d = 65t$ schreiben, um die Beziehung zwischen Entfernung und Zeit darzustellen."},
{"id": "6.G.A", "description": "Reale und mathematische Probleme mit Flächeninhalt, Oberflächeninhalt und Volumen lösen."},
{"id": "6.G.A.1", "description": "Den Flächeninhalt von rechtwinkligen Dreiecken, anderen Dreiecken, speziellen Vierecken und Polygonen finden, indem sie zu Rechtecken zusammengesetzt oder in Dreiecke und andere Formen zerlegt werden; diese Techniken im Kontext der Lösung von realen und mathematischen Problemen anwenden."}
{"id": "6.G.A.2", "description": "Das Volumen eines Quaders mit gebrochenen Kantenlängen finden, indem er mit Einheitswürfeln der entsprechenden Stammbruch-Kantenlängen gefüllt wird, und zeigen, dass das Volumen dasselbe ist, das man durch Multiplikation der Kantenlängen des Quaders erhält. Die Formeln $V = l \\cdot b \\cdot h$ und $V = G \\cdot h$ anwenden, um das Volumen von Quadern mit gebrochenen Kantenlängen im Kontext der Lösung von realen und mathematischen Problemen zu finden."},
{"id": "6.G.A.3", "description": "Polygone im Koordinatensystem bei gegebenen Koordinaten für die Eckpunkte zeichnen; Koordinaten verwenden, um die Länge einer Seite zu finden, die Punkte mit derselben ersten Koordinate oder derselben zweiten Koordinate verbindet. Diese Techniken im Kontext der Lösung von realen und mathematischen Problemen anwenden."},
{"id": "6.G.A.4", "description": "Dreidimensionale Körper mithilfe von Netzen aus Rechtecken und Dreiecken darstellen und die Netze verwenden, um den Oberflächeninhalt dieser Körper zu finden. Diese Techniken im Kontext der Lösung von realen und mathematischen Problemen anwenden."},
{"id": "6.SP.A", "description": "Ein Verständnis für statistische Variabilität entwickeln."},
{"id": "6.SP.A.1", "description": "Eine statistische Frage als eine Frage erkennen, die eine Variabilität in den Daten bezüglich der Frage erwartet und diese in den Antworten berücksichtigt. Zum Beispiel ist „Wie alt bin ich?“ keine statistische Frage, aber „Wie alt sind die Schüler in meiner Schule?“ ist eine statistische Frage, weil man eine Variabilität im Alter der Schüler erwartet."},
{"id": "6.SP.A.2", "description": "Verstehen, dass ein Datensatz, der zur Beantwortung einer statistischen Frage erhoben wurde, eine Verteilung hat, die durch ihr Zentrum, ihre Streuung und ihre Gesamtform beschrieben werden kann."},
{"id": "6.SP.A.3", "description": "Erkennen, dass ein Lageparameter für einen numerischen Datensatz alle seine Werte mit einer einzigen Zahl zusammenfasst, während ein Streuungsmaß beschreibt, wie seine Werte mit einer einzigen Zahl variieren."},
{"id": "6.SP.B", "description": "Verteilungen zusammenfassen und beschreiben."},
{"id": "6.SP.B.4", "description": "Numerische Daten in Diagrammen auf einer Zahlengeraden darstellen, einschließlich Punktdiagrammen, Histogrammen und Boxplots."},
{"id": "6.SP.B.5", "description": "Numerische Datensätze in Bezug auf ihren Kontext zusammenfassen, z.B. durch:\n - Angabe der Anzahl der Beobachtungen.\n - Beschreibung der Art des untersuchten Merkmals, einschließlich wie es gemessen wurde und seiner Maßeinheiten.\n - Inbeziehungsetzen der Wahl von Lageparametern und Streuungsmaßen zur Form der Datenverteilung und dem Kontext, in dem die Daten erhoben wurden.\n - Angabe quantitativer Lageparameter (Median und/oder Mittelwert) und Streuungsmaße (Interquartilsabstand und/oder mittlere absolute Abweichung), sowie Beschreibung jeglicher allgemeinen Muster und auffälliger Abweichungen vom allgemeinen Muster mit Bezug auf den Kontext, in dem die Daten erhoben wurden."},
{"id": "6.SP.B.5a", "description": "Angabe der Anzahl der Beobachtungen."},
{"id": "6.SP.B.5b", "description": "Beschreibung der Art des untersuchten Merkmals, einschließlich wie es gemessen wurde und seiner Maßeinheiten."},
{"id": "6.SP.B.5c", "description": "Angabe quantitativer Lageparameter (Median und/oder Mittelwert) und Streuungsmaße (Interquartilsabstand und/oder mittlere absolute Abweichung), sowie Beschreibung jeglicher allgemeinen Muster und auffälliger Abweichungen vom allgemeinen Muster mit Bezug auf den Kontext, in dem die Daten erhoben wurden."},
{"id": "6.SP.B.5d", "description": "Inbeziehungsetzen der Wahl von Lageparametern und Streuungsmaßen zur Form der Datenverteilung und dem Kontext, in dem die Daten erhoben wurden."},
{"id": "7.RP.A", "description": "Proportionale Beziehungen analysieren und zur Lösung von realen und mathematischen Problemen verwenden."},
{"id": "7.RP.A.1", "description": "Einheitsraten berechnen, die mit Verhältnissen von Brüchen verbunden sind, einschließlich Verhältnissen von Längen, Flächen und anderen Größen, die in gleichen oder unterschiedlichen Einheiten gemessen werden. Zum Beispiel, wenn eine Person 1/2 Meile in jeder 1/4 Stunde geht, die Einheitsrate als den Doppelbruch $(1/2)/(1/4)$ Meilen pro Stunde berechnen, was 2 Meilen pro Stunde entspricht."},
{"id": "7.RP.A.2", "description": "Proportionale Beziehungen zwischen Größen erkennen und darstellen.\nInhalt dieses Standards:\n - Proportionale Beziehungen durch Gleichungen darstellen. Zum Beispiel, wenn die Gesamtkosten t proportional zur Anzahl n der zu einem konstanten Preis p gekauften Artikel sind, kann die Beziehung zwischen den Gesamtkosten und der Anzahl der Artikel als $t = pn$ ausgedrückt werden.\n - Die Proportionalitätskonstante (Einheitsrate) in Tabellen, Graphen, Gleichungen, Diagrammen und verbalen Beschreibungen von proportionalen Beziehungen identifizieren.\n - Entscheiden, ob zwei Größen in einer proportionalen Beziehung stehen, z.B. durch Testen auf äquivalente Verhältnisse in einer Tabelle oder durch grafische Darstellung in einem Koordinatensystem und Beobachten, ob der Graph eine Gerade durch den Ursprung ist.\n - Erklären, was ein Punkt (x, y) auf dem Graphen einer proportionalen Beziehung in Bezug auf die Situation bedeutet, mit besonderem Augenmerk auf die Punkte (0, 0) und (1, r), wobei r die Einheitsrate ist."},
{"id": "7.RP.A.2a", "description": "Entscheiden, ob zwei Größen in einer proportionalen Beziehung stehen, z.B. durch Testen auf äquivalente Verhältnisse in einer Tabelle oder durch grafische Darstellung in einem Koordinatensystem und Beobachten, ob der Graph eine Gerade durch den Ursprung ist."},
{"id": "7.RP.A.2b", "description": "Die Proportionalitätskonstante (Einheitsrate) in Tabellen, Graphen, Gleichungen, Diagrammen und verbalen Beschreibungen von proportionalen Beziehungen identifizieren."},
{"id": "7.RP.A.2c", "description": "Proportionale Beziehungen durch Gleichungen darstellen. Zum Beispiel, wenn die Gesamtkosten t proportional zur Anzahl n der zu einem konstanten Preis p gekauften Artikel sind, kann die Beziehung zwischen den Gesamtkosten und der Anzahl der Artikel als $t = pn$ ausgedrückt werden."},
{"id": "7.RP.A.2d", "description": "Erklären, was ein Punkt (x, y) auf dem Graphen einer proportionalen Beziehung in Bezug auf die Situation bedeutet, mit besonderem Augenmerk auf die Punkte (0, 0) und (1, r), wobei r die Einheitsrate ist."},
{"id": "7.RP.A.3", "description": "Proportionale Beziehungen verwenden, um mehrschrittige Verhältnis- und Prozentaufgaben zu lösen. Beispiele: einfache Zinsen, Steuern, Preisaufschläge und -nachlässe, Trinkgelder und Provisionen, Gebühren, prozentuale Zunahme und Abnahme, prozentualer Fehler."},
{"id": "7.NS.A", "description": "Frühere Verständnisse von Operationen mit Brüchen anwenden und erweitern, um rationale Zahlen zu addieren, subtrahieren, multiplizieren und dividieren."},
{"id": "7.NS.A.1", "description": "Frühere Verständnisse von Addition und Subtraktion anwenden und erweitern, um rationale Zahlen zu addieren und subtrahieren; Addition und Subtraktion auf einer horizontalen oder vertikalen Zahlengeraden darstellen.\nInhalt dieses Standards:\n - Situationen beschreiben, in denen sich entgegengesetzte Größen zu 0 addieren. Zum Beispiel hat ein Wasserstoffatom die Ladung 0, weil seine beiden Bestandteile entgegengesetzt geladen sind.\n - $p + q$ als die Zahl verstehen, die sich in einem Abstand von $|q|$ von p befindet, in positiver oder negativer Richtung, je nachdem, ob q positiv oder negativ ist. Zeigen, dass eine Zahl und ihre Gegenzahl die Summe 0 haben (additive Inverse sind). Summen von rationalen Zahlen durch die Beschreibung von realen Kontexten interpretieren.\n - Eigenschaften von Operationen als Strategien zum Addieren und Subtrahieren von rationalen Zahlen anwenden.\n - Die Subtraktion von rationalen Zahlen als Addition des additiven Inversen verstehen, $p – q = p + (–q)$. Zeigen, dass der Abstand zwischen zwei rationalen Zahlen auf der Zahlengeraden der Betrag ihrer Differenz ist, und dieses Prinzip in realen Kontexten anwenden."},
{"id": "7.NS.A.1a", "description": "Situationen beschreiben, in denen sich entgegengesetzte Größen zu 0 addieren. Zum Beispiel hat ein Wasserstoffatom die Ladung 0, weil seine beiden Bestandteile entgegengesetzt geladen sind."},
{"id": "7.NS.A.1b", "description": " $p + q$ als die Zahl verstehen, die sich in einem Abstand von $|q|$ von p befindet, in positiver oder negativer Richtung, je nachdem, ob q positiv oder negativ ist. Zeigen, dass eine Zahl und ihre Gegenzahl die Summe 0 haben (additive Inverse sind). Summen von rationalen Zahlen durch die Beschreibung von realen Kontexten interpretieren."}
{"id": "7.NS.A.1c", "description": "Die Subtraktion von rationalen Zahlen als Addition des additiven Inversen verstehen, $p – q = p + (–q)$. Zeigen, dass der Abstand zwischen zwei rationalen Zahlen auf der Zahlengeraden der Betrag ihrer Differenz ist, und dieses Prinzip in realen Kontexten anwenden."},
{"id": "7.NS.A.1d", "description": "Eigenschaften von Operationen als Strategien zum Addieren und Subtrahieren von rationalen Zahlen anwenden."},
{"id": "7.NS.A.2", "description": "Frühere Verständnisse der Multiplikation und Division sowie von Brüchen anwenden und erweitern, um rationale Zahlen zu multiplizieren und zu dividieren.\nInhalt dieses Standards:\n - Verstehen, dass ganze Zahlen dividiert werden können, vorausgesetzt, der Divisor ist nicht null, und jeder Quotient von ganzen Zahlen (mit einem Divisor ungleich null) ist eine rationale Zahl. Wenn p und q ganze Zahlen sind, dann gilt $–(p/q) = (–p)/q = p/(–q)$. Quotienten von rationalen Zahlen durch die Beschreibung von realen Kontexten interpretieren.\n - Eigenschaften von Operationen als Strategien zum Multiplizieren und Dividieren von rationalen Zahlen anwenden.\n - Eine rationale Zahl mithilfe der schriftlichen Division in eine Dezimalzahl umwandeln; wissen, dass die Dezimalform einer rationalen Zahl entweder abbricht (in Nullen endet) oder periodisch wird.\n - Verstehen, dass die Multiplikation von Brüchen auf rationale Zahlen erweitert wird, indem gefordert wird, dass die Operationen weiterhin die Eigenschaften der Operationen erfüllen, insbesondere das Distributivgesetz, was zu Produkten wie $(–1)(–1) = 1$ und den Regeln für die Multiplikation von Zahlen mit Vorzeichen führt. Produkte von rationalen Zahlen durch die Beschreibung von realen Kontexten interpretieren."},
{"id": "7.NS.A.2a", "description": "Verstehen, dass die Multiplikation von Brüchen auf rationale Zahlen erweitert wird, indem gefordert wird, dass die Operationen weiterhin die Eigenschaften der Operationen erfüllen, insbesondere das Distributivgesetz, was zu Produkten wie $(–1)(–1) = 1$ und den Regeln für die Multiplikation von Zahlen mit Vorzeichen führt. Produkte von rationalen Zahlen durch die Beschreibung von realen Kontexten interpretieren."},
{"id": "7.NS.A.2b", "description": "Verstehen, dass ganze Zahlen dividiert werden können, vorausgesetzt, der Divisor ist nicht null, und jeder Quotient von ganzen Zahlen (mit einem Divisor ungleich null) ist eine rationale Zahl. Wenn p und q ganze Zahlen sind, dann gilt $–(p/q) = (–p)/q = p/(–q)$. Quotienten von rationalen Zahlen durch die Beschreibung von realen Kontexten interpretieren."},
{"id": "7.NS.A.2c", "description": "Eigenschaften von Operationen als Strategien zum Multiplizieren und Dividieren von rationalen Zahlen anwenden."},
{"id": "7.NS.A.2d", "description": "Eine rationale Zahl mithilfe der schriftlichen Division in eine Dezimalzahl umwandeln; wissen, dass die Dezimalform einer rationalen Zahl entweder abbricht (in Nullen endet) oder periodisch wird."},
{"id": "7.NS.A.3", "description": "Reale und mathematische Probleme mit den vier Grundrechenarten mit rationalen Zahlen lösen. (Berechnungen mit rationalen Zahlen erweitern die Regeln für den Umgang mit Brüchen auf Doppelbrüche.)"},
{"id": "7.EE.A", "description": "Eigenschaften von Operationen verwenden, um äquivalente Terme zu erzeugen."},
{"id": "7.EE.A.1", "description": "Eigenschaften von Operationen als Strategien anwenden, um lineare Terme mit rationalen Koeffizienten zu addieren, subtrahieren, faktorisieren und auszumultiplizieren."},
{"id": "7.EE.A.2", "description": "Verstehen, dass das Umschreiben eines Terms in verschiedene Formen in einem Problemkontext das Problem und die Beziehung der darin enthaltenen Größen erhellen kann. Zum Beispiel bedeutet $a + 0,05a = 1,05a$, dass eine „Zunahme um 5 %“ dasselbe ist wie eine „Multiplikation mit 1,05“."},
{"id": "7.EE.B", "description": "Alltags- und mathematische Probleme mithilfe von numerischen und algebraischen Termen und Gleichungen lösen."},
{"id": "7.EE.B.3", "description": "Mehrschrittige Alltags- und mathematische Probleme mit positiven und negativen rationalen Zahlen in jeglicher Form (ganze Zahlen, Brüche und Dezimalzahlen) unter strategischem Einsatz von Werkzeugen lösen. Eigenschaften von Operationen anwenden, um mit Zahlen in jeglicher Form zu rechnen; zwischen den Formen je nach Bedarf umwandeln; und die Plausibilität der Antworten mithilfe von Kopfrechnen und Schätzstrategien bewerten. Zum Beispiel: Wenn eine Frau, die 25 $/Stunde verdient, eine 10%ige Gehaltserhöhung bekommt, wird sie zusätzlich 1/10 ihres Gehalts pro Stunde oder 2,50$ verdienen, für ein neues Gehalt von 27,50$. Wenn Sie eine 9 3/4 Zoll lange Handtuchstange in der Mitte einer 27 1/2 Zoll breiten Tür anbringen möchten, müssen Sie die Stange etwa 9 Zoll von jedem Rand entfernt platzieren; diese Schätzung kann zur Überprüfung der exakten Berechnung verwendet werden."},
{"id": "7.EE.B.4", "description": "Variablen verwenden, um Größen in einem realen oder mathematischen Problem darzustellen, und einfache Gleichungen und Ungleichungen aufstellen, um Probleme durch Nachdenken über die Größen zu lösen.\nInhalt dieses Standards:\n - Textaufgaben lösen, die zu Ungleichungen der Form $px + q > r$ oder $px + q < r$ führen, wobei p, q und r spezifische rationale Zahlen sind. Die Lösungsmenge der Ungleichung grafisch darstellen und im Kontext des Problems interpretieren. Zum Beispiel: Als Verkäufer erhalten Sie 50 $ pro Woche plus 3$ pro Verkauf. Diese Woche möchten Sie mindestens 100 $ verdienen. Schreiben Sie eine Ungleichung für die Anzahl der Verkäufe, die Sie tätigen müssen, und beschreiben Sie die Lösungen.\n - Textaufgaben lösen, die zu Gleichungen der Form $px + q = r$ und $p(x + q) = r$ führen, wobei p, q und r spezifische rationale Zahlen sind. Gleichungen dieser Formen sicher lösen. Eine algebraische Lösung mit einer arithmetischen Lösung vergleichen und dabei die Reihenfolge der in jedem Ansatz verwendeten Operationen identifizieren. Zum Beispiel: Der Umfang eines Rechtecks beträgt 54 cm. Seine Länge beträgt 6 cm. Wie groß ist seine Breite?"},
{"id": "7.EE.B.4a", "description": "Textaufgaben lösen, die zu Gleichungen der Form $px + q = r$ und $p(x + q) = r$ führen, wobei p, q und r spezifische rationale Zahlen sind. Gleichungen dieser Formen sicher lösen. Eine algebraische Lösung mit einer arithmetischen Lösung vergleichen und dabei die Reihenfolge der in jedem Ansatz verwendeten Operationen identifizieren. Zum Beispiel: Der Umfang eines Rechtecks beträgt 54 cm. Seine Länge beträgt 6 cm. Wie groß ist seine Breite?"},
{"id": "7.EE.B.4b", "description": "Textaufgaben lösen, die zu Ungleichungen der Form $px + q > r$ oder $px + q < r$ führen, wobei p, q und r spezifische rationale Zahlen sind. Die Lösungsmenge der Ungleichung grafisch darstellen und im Kontext des Problems interpretieren. Zum Beispiel: Als Verkäufer erhalten Sie 50 $ pro Woche plus 3$ pro Verkauf. Diese Woche möchten Sie mindestens 100 $ verdienen. Schreiben Sie eine Ungleichung für die Anzahl der Verkäufe, die Sie tätigen müssen, und beschreiben Sie die Lösungen."},
{"id": "7.G.A", "description": "Geometrische Figuren zeichnen, konstruieren und beschreiben und die Beziehungen zwischen ihnen beschreiben."},
{"id": "7.G.A.1", "description": "Probleme mit maßstäblichen Zeichnungen von geometrischen Figuren lösen, einschließlich der Berechnung tatsächlicher Längen und Flächen aus einer maßstäblichen Zeichnung und der Reproduktion einer maßstäblichen Zeichnung in einem anderen Maßstab."},
{"id": "7.G.A.2", "description": "Geometrische Formen mit gegebenen Bedingungen zeichnen (freihändig, mit Lineal und Geodreieck und mit Technologie). Sich auf die Konstruktion von Dreiecken aus drei gegebenen Maßen von Winkeln oder Seiten konzentrieren und dabei feststellen, wann die Bedingungen ein eindeutiges Dreieck, mehr als ein Dreieck oder kein Dreieck bestimmen."},
{"id": "7.G.A.3", "description": "Die zweidimensionalen Figuren beschreiben, die beim Schneiden von dreidimensionalen Körpern entstehen, wie bei ebenen Schnitten von Quadern und geraden quadratischen Pyramiden."},
{"id": "7.G.B", "description": "Alltags- und mathematische Probleme mit Winkelmaßen, Flächeninhalt, Oberflächeninhalt und Volumen lösen."},
{"id": "7.G.B.4", "description": "Die Formeln für den Flächeninhalt und den Umfang eines Kreises kennen und zur Problemlösung verwenden; eine informelle Herleitung der Beziehung zwischen Umfang und Flächeninhalt eines Kreises geben."},
{"id": "7.G.B.5", "description": "Fakten über Supplementär-, Komplementär-, Scheitel- und anliegende Winkel in einem mehrschrittigen Problem verwenden, um einfache Gleichungen für einen unbekannten Winkel in einer Figur aufzustellen und zu lösen."},
{"id": "7.G.B.6", "description": "Reale und mathematische Probleme mit Flächeninhalt, Volumen und Oberflächeninhalt von zwei- und dreidimensionalen Objekten lösen, die aus Dreiecken, Vierecken, Polygonen, Würfeln und geraden Prismen zusammengesetzt sind."},
{"id": "7.SP.A", "description": "Zufallsstichproben verwenden, um Schlussfolgerungen über eine Grundgesamtheit zu ziehen."}
{"id": "7.SP.A.1", "description": "Verstehen, dass Statistik verwendet werden kann, um Informationen über eine Grundgesamtheit zu gewinnen, indem eine Stichprobe der Grundgesamtheit untersucht wird; Verallgemeinerungen über eine Grundgesamtheit aus einer Stichprobe sind nur dann gültig, wenn die Stichprobe für diese Grundgesamtheit repräsentativ ist. Verstehen, dass Zufallsstichproben tendenziell repräsentative Stichproben erzeugen und gültige Schlussfolgerungen unterstützen."},
{"id": "7.SP.A.2", "description": "Daten aus einer Zufallsstichprobe verwenden, um Schlussfolgerungen über eine Grundgesamtheit mit einem unbekannten interessierenden Merkmal zu ziehen. Mehrere Stichproben (oder simulierte Stichproben) gleicher Größe erzeugen, um die Variation in Schätzungen oder Vorhersagen abzuschätzen. Zum Beispiel die mittlere Wortlänge in einem Buch schätzen, indem zufällig Wörter aus dem Buch als Stichprobe entnommen werden; den Gewinner einer Schulwahl auf der Grundlage von zufällig erhobenen Umfragedaten vorhersagen. Abschätzen, wie weit die Schätzung oder Vorhersage vom wahren Wert abweichen könnte."},
{"id": "7.SP.B", "description": "Informelle vergleichende Schlussfolgerungen über zwei Grundgesamtheiten ziehen."},
{"id": "7.SP.B.3", "description": "Den Grad der visuellen Überlappung von zwei numerischen Datenverteilungen mit ähnlichen Streuungen informell bewerten, indem der Unterschied zwischen den Zentren gemessen und als Vielfaches eines Streuungsmaßes ausgedrückt wird. Zum Beispiel ist die mittlere Körpergröße der Spieler im Basketballteam 10 cm größer als die mittlere Körpergröße der Spieler im Fußballteam, was etwa dem Doppelten der Streuung (mittlere absolute Abweichung) in beiden Teams entspricht; auf einem Punktdiagramm ist die Trennung zwischen den beiden Verteilungen der Körpergrößen deutlich sichtbar."},
{"id": "7.SP.B.4", "description": "Lageparameter und Streuungsmaße für numerische Daten aus Zufallsstichproben verwenden, um informelle vergleichende Schlussfolgerungen über zwei Grundgesamtheiten zu ziehen. Zum Beispiel entscheiden, ob die Wörter in einem Kapitel eines Wissenschaftsbuchs für die siebte Klasse im Allgemeinen länger sind als die Wörter in einem Kapitel eines Wissenschaftsbuchs für die vierte Klasse."},
{"id": "7.SP.C", "description": "Zufallsprozesse untersuchen und Wahrscheinlichkeitsmodelle entwickeln, verwenden und bewerten."},
{"id": "7.SP.C.5", "description": "Verstehen, dass die Wahrscheinlichkeit eines Zufallsereignisses eine Zahl zwischen 0 und 1 ist, die die Wahrscheinlichkeit des Eintretens des Ereignisses ausdrückt. Größere Zahlen deuten auf eine größere Wahrscheinlichkeit hin. Eine Wahrscheinlichkeit nahe 0 deutet auf ein unwahrscheinliches Ereignis hin, eine Wahrscheinlichkeit um 1/2 auf ein Ereignis, das weder unwahrscheinlich noch wahrscheinlich ist, und eine Wahrscheinlichkeit nahe 1 auf ein wahrscheinliches Ereignis."},
{"id": "7.SP.C.6", "description": "Die Wahrscheinlichkeit eines Zufallsereignisses annähern, indem Daten über den Zufallsprozess, der es erzeugt, gesammelt und seine langfristige relative Häufigkeit beobachtet wird, und die ungefähre relative Häufigkeit bei gegebener Wahrscheinlichkeit vorhersagen. Zum Beispiel beim 600-maligen Würfeln vorhersagen, dass eine 3 oder 6 ungefähr 200 Mal gewürfelt wird, aber wahrscheinlich nicht genau 200 Mal."},
{"id": "7.SP.C.7", "description": "Ein Wahrscheinlichkeitsmodell entwickeln und verwenden, um Wahrscheinlichkeiten von Ereignissen zu finden. Wahrscheinlichkeiten aus einem Modell mit beobachteten Häufigkeiten vergleichen; wenn die Übereinstimmung nicht gut ist, mögliche Quellen für die Abweichung erklären.\nInhalt dieses Standards:\n - Ein uniformes Wahrscheinlichkeitsmodell entwickeln, indem allen Ergebnissen die gleiche Wahrscheinlichkeit zugewiesen wird, und das Modell verwenden, um die Wahrscheinlichkeiten von Ereignissen zu bestimmen. Zum Beispiel, wenn ein Schüler zufällig aus einer Klasse ausgewählt wird, die Wahrscheinlichkeit finden, dass Jane ausgewählt wird, und die Wahrscheinlichkeit, dass ein Mädchen ausgewählt wird.\n - Ein Wahrscheinlichkeitsmodell (das möglicherweise nicht uniform ist) entwickeln, indem Häufigkeiten in Daten beobachtet werden, die aus einem Zufallsprozess generiert wurden. Zum Beispiel die ungefähre Wahrscheinlichkeit finden, dass eine gedrehte Münze auf Kopf landet oder dass ein geworfener Pappbecher mit der offenen Seite nach unten landet. Erscheinen die Ergebnisse für die gedrehte Münze auf der Grundlage der beobachteten Häufigkeiten als gleich wahrscheinlich?"},
{"id": "7.SP.C.7a", "description": "Ein uniformes Wahrscheinlichkeitsmodell entwickeln, indem allen Ergebnissen die gleiche Wahrscheinlichkeit zugewiesen wird, und das Modell verwenden, um die Wahrscheinlichkeiten von Ereignissen zu bestimmen. Zum Beispiel, wenn ein Schüler zufällig aus einer Klasse ausgewählt wird, die Wahrscheinlichkeit finden, dass Jane ausgewählt wird, und die Wahrscheinlichkeit, dass ein Mädchen ausgewählt wird."},
{"id": "7.SP.C.7b", "description": "Ein Wahrscheinlichkeitsmodell (das möglicherweise nicht uniform ist) entwickeln, indem Häufigkeiten in Daten beobachtet werden, die aus einem Zufallsprozess generiert wurden. Zum Beispiel die ungefähre Wahrscheinlichkeit finden, dass eine gedrehte Münze auf Kopf landet oder dass ein geworfener Pappbecher mit der offenen Seite nach unten landet. Erscheinen die Ergebnisse für die gedrehte Münze auf der Grundlage der beobachteten Häufigkeiten als gleich wahrscheinlich?"},
{"id": "7.SP.C.8", "description": "Wahrscheinlichkeiten von zusammengesetzten Ereignissen unter Verwendung von geordneten Listen, Tabellen, Baumdiagrammen und Simulationen finden.\nInhalt dieses Standards:\n - Eine Simulation entwerfen und verwenden, um Häufigkeiten für zusammengesetzte Ereignisse zu generieren. Zum Beispiel Zufallsziffern als Simulationswerkzeug verwenden, um die Antwort auf die Frage anzunähern: Wenn 40 % der Spender Blutgruppe A haben, wie hoch ist die Wahrscheinlichkeit, dass es mindestens 4 Spender braucht, um einen mit Blutgruppe A zu finden?\n - Verstehen, dass, genau wie bei einfachen Ereignissen, die Wahrscheinlichkeit eines zusammengesetzten Ereignisses der Anteil der Ergebnisse im Ergebnisraum ist, für die das zusammengesetzte Ereignis eintritt.\n - Ergebnisräume für zusammengesetzte Ereignisse mit Methoden wie geordneten Listen, Tabellen und Baumdiagrammen darstellen. Für ein in Alltagssprache beschriebenes Ereignis (z.B. „einen Pasch Sechs würfeln“) die Ergebnisse im Ergebnisraum identifizieren, die das Ereignis ausmachen."},
{"id": "7.SP.C.8a", "description": "Verstehen, dass, genau wie bei einfachen Ereignissen, die Wahrscheinlichkeit eines zusammengesetzten Ereignisses der Anteil der Ergebnisse im Ergebnisraum ist, für die das zusammengesetzte Ereignis eintritt."},
{"id": "7.SP.C.8b", "description": "Ergebnisräume für zusammengesetzte Ereignisse mit Methoden wie geordneten Listen, Tabellen und Baumdiagrammen darstellen. Für ein in Alltagssprache beschriebenes Ereignis (z.B. „einen Pasch Sechs würfeln“) die Ergebnisse im Ergebnisraum identifizieren, die das Ereignis ausmachen."},
{"id": "7.SP.C.8c", "description": "Eine Simulation entwerfen und verwenden, um Häufigkeiten für zusammengesetzte Ereignisse zu generieren. Zum Beispiel Zufallsziffern als Simulationswerkzeug verwenden, um die Antwort auf die Frage anzunähern: Wenn 40 % der Spender Blutgruppe A haben, wie hoch ist die Wahrscheinlichkeit, dass es mindestens 4 Spender braucht, um einen mit Blutgruppe A zu finden?"},
{"id": "8.NS.A", "description": "Wissen, dass es Zahlen gibt, die nicht rational sind, und sie durch rationale Zahlen annähern."},
{"id": "8.NS.A.1", "description": "Wissen, dass Zahlen, die nicht rational sind, irrational genannt werden. Informell verstehen, dass jede Zahl eine Dezimalentwicklung hat; für rationale Zahlen zeigen, dass die Dezimalentwicklung periodisch wird, und eine Dezimalentwicklung, die periodisch wird, in eine rationale Zahl umwandeln."},
{"id": "8.NS.A.2", "description": "Rationale Annäherungen von irrationalen Zahlen verwenden, um die Größe von irrationalen Zahlen zu vergleichen, sie ungefähr auf einer Zahlengeraden zu lokalisieren und den Wert von Ausdrücken (z.B. $\\pi^2$) zu schätzen. Zum Beispiel durch Abbrechen der Dezimalentwicklung von $\\sqrt{2}$ zeigen, dass $\\sqrt{2}$ zwischen 1 und 2 liegt, dann zwischen 1,4 und 1,5, und erklären, wie man weitermachen kann, um bessere Annäherungen zu erhalten."},
{"id": "8.EE.A", "description": "Mit Wurzeln und ganzzahligen Exponenten arbeiten."},
{"id": "8.EE.A.1", "description": "Die Eigenschaften von ganzzahligen Exponenten kennen und anwenden, um äquivalente numerische Terme zu erzeugen. Zum Beispiel $3^2 \\times 3^{-5} = 3^{-3} = 1/3^3 = 1/27$."},
{"id": "8.EE.A.2", "description": "Quadratwurzel- und Kubikwurzelsymbole verwenden, um Lösungen für Gleichungen der Form $x^2 = p$ und $x^3 = p$ darzustellen, wobei p eine positive rationale Zahl ist. Quadratwurzeln von kleinen Quadratzahlen und Kubikwurzeln von kleinen Kubikzahlen berechnen. Wissen, dass $\\sqrt{2}$ irrational ist."},
{"id": "8.EE.A.3", "description": "Zahlen, die in der Form einer einzelnen Ziffer mal einer ganzzahligen Zehnerpotenz ausgedrückt sind, verwenden, um sehr große oder sehr kleine Größen zu schätzen und auszudrücken, wie viel mal größer eine als die andere ist. Zum Beispiel die Bevölkerung der Vereinigten Staaten auf $3 \\times 10^8$ und die Weltbevölkerung auf $7 \\times 10^9$ schätzen und bestimmen, dass die Weltbevölkerung mehr als 20-mal größer ist."},
{"id": "8.EE.A.4", "description": "Operationen mit Zahlen in wissenschaftlicher Schreibweise durchführen, einschließlich Problemen, bei denen sowohl Dezimal- als auch wissenschaftliche Schreibweise verwendet werden. Wissenschaftliche Schreibweise verwenden und Einheiten von angemessener Größe für Messungen sehr großer oder sehr kleiner Größen wählen (z.B. Millimeter pro Jahr für die Ausbreitung des Meeresbodens). Wissenschaftliche Schreibweise interpretieren, die von Technologie erzeugt wurde."},
{"id": "8.EE.B", "description": "Die Zusammenhänge zwischen proportionalen Beziehungen, Geraden und linearen Gleichungen verstehen."},
{"id": "8.EE.B.5", "description": "Proportionale Beziehungen grafisch darstellen und die Einheitsrate als die Steigung des Graphen interpretieren. Zwei verschiedene proportionale Beziehungen, die auf unterschiedliche Weise dargestellt sind, vergleichen. Zum Beispiel ein Weg-Zeit-Diagramm mit einer Weg-Zeit-Gleichung vergleichen, um zu bestimmen, welches von zwei sich bewegenden Objekten eine größere Geschwindigkeit hat."}
{"id": "8.EE.B.6", "description": "Ähnliche Dreiecke verwenden, um zu erklären, warum die Steigung m zwischen zwei beliebigen verschiedenen Punkten auf einer nicht-vertikalen Geraden im Koordinatensystem dieselbe ist; die Gleichung $y = mx$ für eine Gerade durch den Ursprung und die Gleichung $y = mx + b$ für eine Gerade, die die vertikale Achse bei b schneidet, herleiten."},
{"id": "8.EE.C", "description": "Lineare Gleichungen und lineare Gleichungssysteme analysieren und lösen."},
{"id": "8.EE.C.7", "description": "Lineare Gleichungen mit einer Variablen lösen.\nInhalt dieses Standards:\n - Lineare Gleichungen mit rationalen Koeffizienten lösen, einschließlich Gleichungen, deren Lösungen das Ausmultiplizieren von Termen unter Verwendung des Distributivgesetzes und das Zusammenfassen gleichartiger Terme erfordern.\n - Beispiele für lineare Gleichungen mit einer Variablen geben, die eine Lösung, unendlich viele Lösungen oder keine Lösung haben. Zeigen, welche dieser Möglichkeiten zutrifft, indem die gegebene Gleichung schrittweise in einfachere Formen umgewandelt wird, bis eine äquivalente Gleichung der Form $x = a$, $a = a$ oder $a = b$ entsteht (wobei a und b verschiedene Zahlen sind)."},
{"id": "8.EE.C.7a", "description": "Beispiele für lineare Gleichungen mit einer Variablen geben, die eine Lösung, unendlich viele Lösungen oder keine Lösung haben. Zeigen, welche dieser Möglichkeiten zutrifft, indem die gegebene Gleichung schrittweise in einfachere Formen umgewandelt wird, bis eine äquivalente Gleichung der Form $x = a$, $a = a$ oder $a = b$ entsteht (wobei a und b verschiedene Zahlen sind)."},
{"id": "8.EE.C.7b", "description": "Lineare Gleichungen mit rationalen Koeffizienten lösen, einschließlich Gleichungen, deren Lösungen das Ausmultiplizieren von Termen unter Verwendung des Distributivgesetzes und das Zusammenfassen gleichartiger Terme erfordern."},
{"id": "8.EE.C.8", "description": "Lineare Gleichungssysteme analysieren und lösen.\nInhalt dieses Standards:\n - Reale und mathematische Probleme lösen, die zu zwei linearen Gleichungen mit zwei Variablen führen. Zum Beispiel bei gegebenen Koordinaten für zwei Punktepaare bestimmen, ob die Gerade durch das erste Punktepaar die Gerade durch das zweite Paar schneidet.\n - Systeme von zwei linearen Gleichungen mit zwei Variablen algebraisch lösen und Lösungen durch grafische Darstellung der Gleichungen schätzen. Einfache Fälle durch Hinschauen lösen. Zum Beispiel haben $3x + 2y = 5$ und $3x + 2y = 6$ keine Lösung, weil $3x + 2y$ nicht gleichzeitig 5 und 6 sein kann.\n - Verstehen, dass Lösungen eines Systems von zwei linearen Gleichungen mit zwei Variablen den Schnittpunkten ihrer Graphen entsprechen, weil Schnittpunkte beide Gleichungen gleichzeitig erfüllen."},
{"id": "8.EE.C.8a", "description": "Verstehen, dass Lösungen eines Systems von zwei linearen Gleichungen mit zwei Variablen den Schnittpunkten ihrer Graphen entsprechen, weil Schnittpunkte beide Gleichungen gleichzeitig erfüllen."},
{"id": "8.EE.C.8b", "description": "Systeme von zwei linearen Gleichungen mit zwei Variablen algebraisch lösen und Lösungen durch grafische Darstellung der Gleichungen schätzen. Einfache Fälle durch Hinschauen lösen. Zum Beispiel haben $3x + 2y = 5$ und $3x + 2y = 6$ keine Lösung, weil $3x + 2y$ nicht gleichzeitig 5 und 6 sein kann."},
{"id": "8.EE.C.8c", "description": "Reale und mathematische Probleme lösen, die zu zwei linearen Gleichungen mit zwei Variablen führen. Zum Beispiel bei gegebenen Koordinaten für zwei Punktepaare bestimmen, ob die Gerade durch das erste Punktepaar die Gerade durch das zweite Paar schneidet."},
{"id": "8.F.A", "description": "Funktionen definieren, auswerten und vergleichen."},
{"id": "8.F.A.1", "description": "Verstehen, dass eine Funktion eine Regel ist, die jeder Eingabe genau eine Ausgabe zuordnet. Der Graph einer Funktion ist die Menge der geordneten Paare, die aus einer Eingabe und der entsprechenden Ausgabe bestehen. (Die Funktionsnotation wird in der 8. Klasse nicht verlangt.)"},
{"id": "8.F.A.2", "description": "Eigenschaften von zwei Funktionen vergleichen, die jeweils auf unterschiedliche Weise dargestellt sind (algebraisch, grafisch, numerisch in Tabellen oder durch verbale Beschreibungen). Zum Beispiel bei einer durch eine Wertetabelle dargestellten linearen Funktion und einer durch einen algebraischen Term dargestellten linearen Funktion bestimmen, welche Funktion die größere Änderungsrate hat."},
{"id": "8.F.A.3", "description": "Die Gleichung $y = mx + b$ als Definition einer linearen Funktion interpretieren, deren Graph eine Gerade ist; Beispiele für nicht-lineare Funktionen geben. Zum Beispiel ist die Funktion $A = s^2$, die den Flächeninhalt eines Quadrats als Funktion seiner Seitenlänge angibt, nicht linear, da ihr Graph die Punkte (1,1), (2,4) und (3,9) enthält, die nicht auf einer Geraden liegen."},
{"id": "8.F.B", "description": "Funktionen zur Modellierung von Beziehungen zwischen Größen verwenden."},
{"id": "8.F.B.4", "description": "Eine Funktion konstruieren, um eine lineare Beziehung zwischen zwei Größen zu modellieren. Die Änderungsrate und den Anfangswert der Funktion aus einer Beschreibung einer Beziehung oder aus zwei (x, y)-Werten bestimmen, einschließlich des Ablesens dieser Werte aus einer Tabelle oder einem Graphen. Die Änderungsrate und den Anfangswert einer linearen Funktion im Hinblick auf die modellierte Situation und im Hinblick auf ihren Graphen oder eine Wertetabelle interpretieren."},
{"id": "8.F.B.5", "description": "Die funktionale Beziehung zwischen zwei Größen qualitativ beschreiben, indem ein Graph analysiert wird (z.B. wo die Funktion steigend oder fallend, linear oder nicht-linear ist). Einen Graphen skizzieren, der die qualitativen Merkmale einer verbal beschriebenen Funktion aufweist."},
{"id": "8.G.A", "description": "Kongruenz und Ähnlichkeit mithilfe von physischen Modellen, Folien oder Geometriesoftware verstehen."},
{"id": "8.G.A.1", "description": "Die Eigenschaften von Drehungen, Spiegelungen und Verschiebungen experimentell überprüfen:\n - Geraden werden auf Geraden abgebildet, und Strecken auf Strecken gleicher Länge.\n - Winkel werden auf Winkel gleichen Maßes abgebildet.\n - Parallele Geraden werden auf parallele Geraden abgebildet."},
{"id": "8.G.A.1a", "description": "Geraden werden auf Geraden abgebildet, und Strecken auf Strecken gleicher Länge."},
{"id": "8.G.A.1b", "description": "Winkel werden auf Winkel gleichen Maßes abgebildet."},
{"id": "8.G.A.1c", "description": "Parallele Geraden werden auf parallele Geraden abgebildet."},
{"id": "8.G.A.2", "description": "Verstehen, dass eine zweidimensionale Figur zu einer anderen kongruent ist, wenn die zweite aus der ersten durch eine Folge von Drehungen, Spiegelungen und Verschiebungen erhalten werden kann; bei zwei gegebenen kongruenten Figuren eine Folge beschreiben, die die Kongruenz zwischen ihnen zeigt."},
{"id": "8.G.A.3", "description": "Die Auswirkung von zentrischen Streckungen, Verschiebungen, Drehungen und Spiegelungen auf zweidimensionale Figuren mithilfe von Koordinaten beschreiben."},
{"id": "8.G.A.4", "description": "Verstehen, dass eine zweidimensionale Figur zu einer anderen ähnlich ist, wenn die zweite aus der ersten durch eine Folge von Drehungen, Spiegelungen, Verschiebungen und zentrischen Streckungen erhalten werden kann; bei zwei gegebenen ähnlichen zweidimensionalen Figuren eine Folge beschreiben, die die Ähnlichkeit zwischen ihnen zeigt."},
{"id": "8.G.A.5", "description": "Informelle Argumente verwenden, um Fakten über die Winkelsumme und den Außenwinkel von Dreiecken, über die Winkel, die entstehen, wenn parallele Geraden von einer Transversalen geschnitten werden, und das Winkel-Winkel-Kriterium für die Ähnlichkeit von Dreiecken zu belegen. Zum Beispiel drei Kopien desselben Dreiecks so anordnen, dass die Summe der drei Winkel eine Gerade zu bilden scheint, und ein Argument in Bezug auf Transversalen geben, warum dies so ist."}
{"id": "8.G.B", "description": "Den Satz des Pythagoras verstehen und anwenden."},
{"id": "8.G.B.6", "description": "Einen Beweis für den Satz des Pythagoras und seine Umkehrung erklären."},
{"id": "8.G.B.7", "description": "Den Satz des Pythagoras anwenden, um unbekannte Seitenlängen in rechtwinkligen Dreiecken in realen und mathematischen Problemen in zwei und drei Dimensionen zu bestimmen."},
{"id": "8.G.B.8", "description": "Den Satz des Pythagoras anwenden, um den Abstand zwischen zwei Punkten in einem Koordinatensystem zu finden."},
{"id": "8.G.C", "description": "Reale und mathematische Probleme mit dem Volumen von Zylindern, Kegeln und Kugeln lösen."},
{"id": "8.G.C.9", "description": "Die Formeln für das Volumen von Kegeln, Zylindern und Kugeln kennen und zur Lösung von realen und mathematischen Problemen verwenden."},
{"id": "8.SP.A", "description": "Zusammenhangsmuster in bivariaten Daten untersuchen."},
{"id": "8.SP.A.1", "description": "Streudiagramme für bivariate Messdaten erstellen und interpretieren, um Zusammenhangsmuster zwischen zwei Größen zu untersuchen. Muster wie Clusterbildung, Ausreißer, positiven oder negativen Zusammenhang, linearen Zusammenhang und nichtlinearen Zusammenhang beschreiben."},
{"id": "8.SP.A.2", "description": "Wissen, dass Geraden häufig zur Modellierung von Beziehungen zwischen zwei quantitativen Variablen verwendet werden. Bei Streudiagrammen, die einen linearen Zusammenhang nahelegen, informell eine Ausgleichsgerade anpassen und die Anpassungsgüte des Modells informell bewerten, indem die Nähe der Datenpunkte zur Geraden beurteilt wird."},
{"id": "8.SP.A.3", "description": "Die Gleichung eines linearen Modells verwenden, um Probleme im Kontext von bivariaten Messdaten zu lösen, dabei die Steigung und den Achsenabschnitt interpretieren. Zum Beispiel in einem linearen Modell für ein Biologie-Experiment eine Steigung von 1,5 cm/h so interpretieren, dass eine zusätzliche Stunde Sonnenlicht pro Tag mit einer zusätzlichen Höhe von 1,5 cm bei der ausgewachsenen Pflanze verbunden ist."},
{"id": "8.SP.A.4", "description": "Verstehen, dass Zusammenhangsmuster auch in bivariaten kategorialen Daten durch die Darstellung von absoluten und relativen Häufigkeiten in einer Zwei-Wege-Tafel gesehen werden können. Eine Zwei-Wege-Tafel erstellen und interpretieren, die Daten zu zwei kategorialen Variablen zusammenfasst, die von denselben Subjekten gesammelt wurden. Relative Häufigkeiten, die für Zeilen oder Spalten berechnet werden, verwenden, um einen möglichen Zusammenhang zwischen den beiden Variablen zu beschreiben. Zum Beispiel Daten von Schülern in Ihrer Klasse darüber sammeln, ob sie an Schultagen eine feste Ausgehzeit haben oder nicht und ob sie feste Pflichten im Haushalt haben oder nicht. Gibt es Hinweise darauf, dass diejenigen, die eine feste Ausgehzeit haben, tendenziell auch Pflichten im Haushalt haben?"},
{"id": "N-RN.A", "description": "Die Eigenschaften von Exponenten auf rationale Exponenten erweitern."},
{"id": "N-RN.A.1", "description": "Erklären, wie die Definition der Bedeutung von rationalen Exponenten aus der Erweiterung der Eigenschaften von ganzzahligen Exponenten auf diese Werte folgt, was eine Notation für Wurzeln in Form von rationalen Exponenten ermöglicht. Zum Beispiel definieren wir $5^{1/3}$ als die Kubikwurzel von 5, weil wir wollen, dass $(5^{1/3})^3 = 5^{(1/3) \\cdot 3}$ gilt, also muss $(5^{1/3})^3$ gleich 5 sein."},
{"id": "N-RN.A.2", "description": "Terme, die Wurzeln und rationale Exponenten beinhalten, mithilfe der Potenzgesetze umschreiben."},
{"id": "N-RN.B", "description": "Eigenschaften von rationalen und irrationalen Zahlen verwenden."},
{"id": "N-RN.B.3", "description": "Erklären, warum die Summe oder das Produkt zweier rationaler Zahlen rational ist; dass die Summe einer rationalen Zahl und einer irrationalen Zahl irrational ist; und dass das Produkt einer von null verschiedenen rationalen Zahl und einer irrationalen Zahl irrational ist."},
{"id": "N-Q.A", "description": "Quantitativ schlussfolgern und Einheiten zur Problemlösung verwenden."},
{"id": "N-Q.A.1", "description": "Einheiten verwenden, um Probleme zu verstehen und die Lösung von mehrschrittigen Problemen zu steuern; Einheiten in Formeln konsistent wählen und interpretieren; den Maßstab und den Ursprung in Graphen und Datendarstellungen wählen und interpretieren."},
{"id": "N-Q.A.2", "description": "Geeignete Größen zum Zweck der deskriptiven Modellierung definieren."},
{"id": "N-Q.A.3", "description": "Bei der Angabe von Größen einen Genauigkeitsgrad wählen, der den Einschränkungen der Messung angemessen ist."},
{"id": "N-CN.A", "description": "Arithmetische Operationen mit komplexen Zahlen durchführen."},
{"id": "N-CN.A.1", "description": "Wissen, dass es eine komplexe Zahl i gibt, für die $i^2 = –1$ gilt, und dass jede komplexe Zahl die Form $a + bi$ hat, wobei a und b reell sind."},
{"id": "N-CN.A.2", "description": "Die Beziehung $i^2 = –1$ und das Kommutativ-, Assoziativ- und Distributivgesetz verwenden, um komplexe Zahlen zu addieren, subtrahieren und multiplizieren."},
{"id": "N-CN.A.3", "description": "Die konjugiert-komplexe Zahl einer komplexen Zahl finden; Konjugierte verwenden, um Beträge und Quotienten von komplexen Zahlen zu finden."},
{"id": "N-CN.B", "description": "Komplexe Zahlen und ihre Operationen in der komplexen Ebene (Gaußschen Zahlenebene) darstellen."}
{"id": "N-CN.B.4", "description": "Komplexe Zahlen in der komplexen Ebene in kartesischer Form und Polarform (einschließlich reeller und imaginärer Zahlen) darstellen und erklären, warum die kartesische und die Polarform einer gegebenen komplexen Zahl dieselbe Zahl darstellen."},
{"id": "N-CN.B.5", "description": "Addition, Subtraktion, Multiplikation und Konjugation komplexer Zahlen geometrisch in der komplexen Ebene darstellen; Eigenschaften dieser Darstellung für Berechnungen nutzen. Zum Beispiel ist $(-1 + \\sqrt{3}i)^3 = 8$, weil $(-1 + \\sqrt{3}i)$ den Betrag 2 und das Argument 120° hat."},
{"id": "N-CN.B.6", "description": "Den Abstand zwischen Zahlen in der komplexen Ebene als Betrag der Differenz berechnen, und den Mittelpunkt einer Strecke als Mittelwert der Zahlen an ihren Endpunkten."},
{"id": "N-CN.C", "description": "Komplexe Zahlen in Polynomidentitäten und -gleichungen verwenden."},
{"id": "N-CN.C.7", "description": "Quadratische Gleichungen mit reellen Koeffizienten lösen, die komplexe Lösungen haben."},
{"id": "N-CN.C.8", "description": "Polynomidentitäten auf die komplexen Zahlen erweitern. Zum Beispiel $x^2 + 4$ als $(x + 2i)(x – 2i)$ umschreiben."},
{"id": "N-CN.C.9", "description": "Den Fundamentalsatz der Algebra kennen; zeigen, dass er für quadratische Polynome gilt."},
{"id": "N-VM.A", "description": "Mit vektoriellen Größen darstellen und modellieren."},
{"id": "N-VM.A.1", "description": "Vektorielle Größen als Größen erkennen, die sowohl einen Betrag als auch eine Richtung haben. Vektorielle Größen durch gerichtete Strecken (Pfeile) darstellen und geeignete Symbole für Vektoren und ihre Beträge verwenden (z.B. $\\vec{v}, |\\vec{v}|, ||\\vec{v}||, v$ )."},
{"id": "N-VM.A.2", "description": "Die Komponenten eines Vektors finden, indem die Koordinaten eines Anfangspunktes von den Koordinaten eines Endpunktes subtrahiert werden."},
{"id": "N-VM.A.3", "description": "Probleme mit Geschwindigkeit und anderen Größen lösen, die durch Vektoren dargestellt werden können."},
{"id": "N-VM.B", "description": "Operationen mit Vektoren durchführen."},
{"id": "N-VM.B.4", "description": "Vektoren addieren und subtrahieren.\nInhalt dieses Standards:\n - Die Vektorsubtraktion $\\vec{v} – \\vec{w}$ als $\\vec{v} + (–\\vec{w})$ verstehen, wobei $–\\vec{w}$ der Gegenvektor von $\\vec{w}$ ist, mit demselben Betrag wie $\\vec{w}$ und in die entgegengesetzte Richtung zeigend. Die Vektorsubtraktion grafisch darstellen, indem die Spitzen in der richtigen Reihenfolge verbunden werden, und die Vektorsubtraktion komponentenweise durchführen.\n - Vektoren aneinandergereiht (Spitze an Fuß), komponentenweise und nach der Parallelogrammregel addieren. Verstehen, dass der Betrag der Summe zweier Vektoren typischerweise nicht die Summe der Beträge ist.\n - Bei zwei Vektoren, die in Betrags- und Richtungsform gegeben sind, den Betrag und die Richtung ihrer Summe bestimmen."},
{"id": "N-VM.B.4a", "description": "Vektoren aneinandergereiht (Spitze an Fuß), komponentenweise und nach der Parallelogrammregel addieren. Verstehen, dass der Betrag der Summe zweier Vektoren typischerweise nicht die Summe der Beträge ist."},
{"id": "N-VM.B.4b", "description": "Bei zwei Vektoren, die in Betrags- und Richtungsform gegeben sind, den Betrag und die Richtung ihrer Summe bestimmen."},
{"id": "N-VM.B.4c", "description": "Die Vektorsubtraktion $\\vec{v} – \\vec{w}$ als $\\vec{v} + (–\\vec{w})$ verstehen, wobei $–\\vec{w}$ der Gegenvektor von $\\vec{w}$ ist, mit demselben Betrag wie $\\vec{w}$ und in die entgegengesetzte Richtung zeigend. Die Vektorsubtraktion grafisch darstellen, indem die Spitzen in der richtigen Reihenfolge verbunden werden, und die Vektorsubtraktion komponentenweise durchführen."},
{"id": "N-VM.B.5", "description": "Einen Vektor mit einem Skalar multiplizieren.\nInhalt dieses Standards:\n - Die skalare Multiplikation grafisch darstellen, indem Vektoren skaliert und möglicherweise ihre Richtung umgekehrt wird; die skalare Multiplikation komponentenweise durchführen, z.B. als $c(v_x, v_y) = (cv_x, cv_y)$.\n - Den Betrag eines skalaren Vielfachen $c\\vec{v}$ mit $||c\\vec{v}|| = |c| ||\\vec{v}||$ berechnen. Die Richtung von $c\\vec{v}$ bestimmen, wissend, dass, wenn $|c| ||\\vec{v}|| \\neq 0$, die Richtung von $c\\vec{v}$ entweder entlang $\\vec{v}$ (für $c > 0$) oder entgegen $\\vec{v}$ (für $c < 0$) ist."},
{"id": "N-VM.B.5a", "description": "Die skalare Multiplikation grafisch darstellen, indem Vektoren skaliert und möglicherweise ihre Richtung umgekehrt wird; die skalare Multiplikation komponentenweise durchführen, z.B. als $c(v_x, v_y) = (cv_x, cv_y)$."},
{"id": "N-VM.B.5b", "description": "Den Betrag eines skalaren Vielfachen $c\\vec{v}$ mit $||c\\vec{v}|| = |c| ||\\vec{v}||$ berechnen. Die Richtung von $c\\vec{v}$ bestimmen, wissend, dass, wenn $|c| ||\\vec{v}|| \\neq 0$, die Richtung von $c\\vec{v}$ entweder entlang $\\vec{v}$ (für $c > 0$) oder entgegen $\\vec{v}$ (für $c < 0$) ist."},
{"id": "N-VM.C", "description": "Operationen mit Matrizen durchführen und Matrizen in Anwendungen verwenden."},
{"id": "N-VM.C.6", "description": "Matrizen verwenden, um Daten darzustellen und zu manipulieren, z.B. um Auszahlungen oder Inzidenzbeziehungen in einem Netzwerk darzustellen."},
{"id": "N-VM.C.7", "description": "Matrizen mit Skalaren multiplizieren, um neue Matrizen zu erzeugen, z.B. wenn alle Auszahlungen in einem Spiel verdoppelt werden."},
{"id": "N-VM.C.8", "description": "Matrizen geeigneter Dimensionen addieren, subtrahieren und multiplizieren."},
{"id": "N-VM.C.9", "description": "Verstehen, dass im Gegensatz zur Multiplikation von Zahlen die Matrizenmultiplikation für quadratische Matrizen keine kommutative Operation ist, aber dennoch das Assoziativ- und Distributivgesetz erfüllt."},
{"id": "N-VM.C.10", "description": "Verstehen, dass die Null- und die Einheitsmatrix bei der Matrizenaddition und -multiplikation eine ähnliche Rolle spielen wie 0 und 1 bei den reellen Zahlen. Die Determinante einer quadratischen Matrix ist genau dann von null verschieden, wenn die Matrix ein multiplikatives Inverses hat."}
{"id": "N-VM.C.11", "description": "Einen Vektor (als Matrix mit einer Spalte betrachtet) mit einer Matrix geeigneter Dimensionen multiplizieren, um einen anderen Vektor zu erzeugen. Mit Matrizen als Transformationen von Vektoren arbeiten."},
{"id": "N-VM.C.12", "description": "Mit 2 × 2-Matrizen als Transformationen der Ebene arbeiten und den Betrag der Determinante im Sinne des Flächeninhalts interpretieren."},
{"id": "A-SSE.A", "description": "Die Struktur von Termen interpretieren."},
{"id": "A-SSE.A.1", "description": "Terme, die eine Größe repräsentieren, im Hinblick auf ihren Kontext interpretieren.\nInhalt dieses Standards:\n - Komplizierte Terme interpretieren, indem ein oder mehrere ihrer Teile als eine einzige Einheit betrachtet werden. Zum Beispiel $P(1+r)^n$ als das Produkt von P und einem von P unabhängigen Faktor interpretieren.\n - Teile eines Terms wie Summanden, Faktoren und Koeffizienten interpretieren."},
{"id": "A-SSE.A.1a", "description": "Teile eines Terms wie Summanden, Faktoren und Koeffizienten interpretieren."},
{"id": "A-SSE.A.1b", "description": "Komplizierte Terme interpretieren, indem ein oder mehrere ihrer Teile als eine einzige Einheit betrachtet werden. Zum Beispiel $P(1+r)^n$ als das Produkt von P und einem von P unabhängigen Faktor interpretieren."},
{"id": "A-SSE.A.2", "description": "Die Struktur eines Terms nutzen, um Möglichkeiten zu seiner Umformung zu erkennen. Zum Beispiel $x^4 – y^4$ als $(x^2)^2 – (y^2)^2$ ansehen und es so als eine Differenz von Quadraten erkennen, die als $(x^2 – y^2)(x^2 + y^2)$ faktorisiert werden kann."},
{"id": "A-SSE.B", "description": "Terme in äquivalente Formen umschreiben, um Probleme zu lösen."},
{"id": "A-SSE.B.3", "description": "Eine äquivalente Form eines Terms wählen und erstellen, um Eigenschaften der durch den Term dargestellten Größe aufzuzeigen und zu erklären.\nInhalt dieses Standards:\n - Die Potenzgesetze verwenden, um Terme für Exponentialfunktionen umzuformen. Zum Beispiel kann der Term $1.15^t$ als $(1.15^{1/12})^{12t} \\approx 1.012^{12t}$ umgeschrieben werden, um den ungefähren äquivalenten monatlichen Zinssatz aufzudecken, wenn der jährliche Zinssatz 15 % beträgt.\n - Die quadratische Ergänzung in einem quadratischen Term durchführen, um den Maximal- oder Minimalwert der durch ihn definierten Funktion aufzuzeigen.\n - Einen quadratischen Term faktorisieren, um die Nullstellen der durch ihn definierten Funktion aufzuzeigen."},
{"id": "A-SSE.B.3a", "description": "Einen quadratischen Term faktorisieren, um die Nullstellen der durch ihn definierten Funktion aufzuzeigen."},
{"id": "A-SSE.B.3b", "description": "Die quadratische Ergänzung in einem quadratischen Term durchführen, um den Maximal- oder Minimalwert der durch ihn definierten Funktion aufzuzeigen."},
{"id": "A-SSE.B.3c", "description": "Die Potenzgesetze verwenden, um Terme für Exponentialfunktionen umzuformen. Zum Beispiel kann der Term $1.15^t$ als $(1.15^{1/12})^{12t} \\approx 1.012^{12t}$ umgeschrieben werden, um den ungefähren äquivalenten monatlichen Zinssatz aufzudecken, wenn der jährliche Zinssatz 15 % beträgt."},
{"id": "A-SSE.B.4", "description": "Die Formel für die Summe einer endlichen geometrischen Reihe (wenn der Quotient nicht 1 ist) herleiten und die Formel zur Problemlösung verwenden. Zum Beispiel Hypothekenzahlungen berechnen."},
{"id": "A-APR.A", "description": "Arithmetische Operationen mit Polynomen durchführen."},
{"id": "A-APR.A.1", "description": "Verstehen, dass Polynome ein zu den ganzen Zahlen analoges System bilden, nämlich, dass sie unter den Operationen der Addition, Subtraktion und Multiplikation abgeschlossen sind; Polynome addieren, subtrahieren und multiplizieren."},
{"id": "A-APR.B", "description": "Die Beziehung zwischen Nullstellen und Faktoren von Polynomen verstehen."},
{"id": "A-APR.B.2", "description": "Den Restsatz kennen und anwenden: Für ein Polynom p(x) und eine Zahl a ist der Rest bei der Division durch $x – a$ gleich $p(a)$, also ist $p(a) = 0$ genau dann, wenn $(x – a)$ ein Faktor von $p(x)$ ist."},
{"id": "A-APR.B.3", "description": "Nullstellen von Polynomen identifizieren, wenn geeignete Faktorisierungen verfügbar sind, und die Nullstellen verwenden, um eine grobe Skizze des Graphen der durch das Polynom definierten Funktion zu erstellen."},
{"id": "A-APR.C", "description": "Polynomidentitäten zur Problemlösung verwenden."},
{"id": "A-APR.C.4", "description": "Polynomidentitäten beweisen und verwenden, um numerische Beziehungen zu beschreiben. Zum Beispiel kann die Polynomidentität $(x^2 + y^2)^2 = (x^2 – y^2)^2 + (2xy)^2$ verwendet werden, um Pythagoreische Tripel zu erzeugen."},
{"id": "A-APR.C.5", "description": "Den Binomischen Lehrsatz für die Entwicklung von $(x + y)^n$ in Potenzen von x und y für eine positive ganze Zahl n kennen und anwenden, wobei x und y beliebige Zahlen sind und die Koeffizienten zum Beispiel durch das Pascalsche Dreieck bestimmt werden. (Der Binomische Lehrsatz kann durch vollständige Induktion oder durch ein kombinatorisches Argument bewiesen werden.)"},
{"id": "A-APR.D", "description": "Rationale Terme umschreiben."},
{"id": "A-APR.D.6", "description": "Einfache rationale Terme in verschiedene Formen umschreiben; $a(x)/b(x)$ in der Form $q(x) + r(x)/b(x)$ schreiben, wobei $a(x), b(x), q(x)$ und $r(x)$ Polynome sind und der Grad von $r(x)$ kleiner als der Grad von $b(x)$ ist, unter Verwendung von Inspektion, Polynomdivision oder, für kompliziertere Beispiele, einem Computer-Algebra-System."},
{"id": "A-APR.D.7", "description": "Verstehen, dass rationale Terme ein zu den rationalen Zahlen analoges System bilden, das unter Addition, Subtraktion, Multiplikation und Division durch einen von null verschiedenen rationalen Term abgeschlossen ist; rationale Terme addieren, subtrahieren, multiplizieren und dividieren."},
{"id": "A-CED.A", "description": "Gleichungen erstellen, die Zahlen oder Beziehungen beschreiben."}
{"id": "A-CED.A.1", "description": "Gleichungen und Ungleichungen mit einer Variablen erstellen und zur Problemlösung verwenden. Dies schließt Gleichungen ein, die aus linearen und quadratischen Funktionen sowie einfachen rationalen und Exponentialfunktionen entstehen."},
{"id": "A-CED.A.2", "description": "Gleichungen mit zwei oder mehr Variablen erstellen, um Beziehungen zwischen Größen darzustellen; Gleichungen auf Koordinatenachsen mit Beschriftungen und Skalen grafisch darstellen."},
{"id": "A-CED.A.3", "description": "Randbedingungen durch Gleichungen oder Ungleichungen sowie durch Systeme von Gleichungen und/oder Ungleichungen darstellen und Lösungen als mögliche oder nicht mögliche Optionen in einem Modellierungskontext interpretieren. Zum Beispiel Ungleichungen darstellen, die ernährungs- und kostenbedingte Einschränkungen für Kombinationen verschiedener Lebensmittel beschreiben."},
{"id": "A-CED.A.4", "description": "Formeln umstellen, um eine interessierende Größe hervorzuheben, wobei dieselbe Logik wie beim Lösen von Gleichungen verwendet wird. Zum Beispiel das Ohmsche Gesetz $V = IR$ umstellen, um den Widerstand R hervorzuheben."},
{"id": "A-REI.A", "description": "Das Lösen von Gleichungen als einen Prozess des logischen Schlussfolgerns verstehen und die Argumentation erklären."},
{"id": "A-REI.A.1", "description": "Jeden Schritt beim Lösen einer einfachen Gleichung als Folgerung aus der im vorherigen Schritt behaupteten Gleichheit von Zahlen erklären, ausgehend von der Annahme, dass die ursprüngliche Gleichung eine Lösung hat. Ein stichhaltiges Argument zur Rechtfertigung einer Lösungsmethode konstruieren."},
{"id": "A-REI.A.2", "description": "Einfache rationale Gleichungen und Wurzelgleichungen mit einer Variablen lösen und Beispiele geben, die zeigen, wie Scheinlösungen entstehen können."},
{"id": "A-REI.B", "description": "Gleichungen und Ungleichungen mit einer Variablen lösen."},
{"id": "A-REI.B.3", "description": "Lineare Gleichungen und Ungleichungen mit einer Variablen lösen, einschließlich Gleichungen mit Koeffizienten, die durch Buchstaben dargestellt werden."},
{"id": "A-REI.B.4", "description": "Quadratische Gleichungen mit einer Variablen lösen.\nInhalt dieses Standards:\n - Quadratische Gleichungen durch Inspektion (z.B. für $x^2 = 49$), Wurzelziehen, quadratische Ergänzung, die Lösungsformel und Faktorisierung lösen, je nach Ausgangsform der Gleichung. Erkennen, wann die Lösungsformel komplexe Lösungen ergibt, und diese als $a \\pm bi$ für reelle Zahlen a und b schreiben.\n - Die Methode der quadratischen Ergänzung verwenden, um jede quadratische Gleichung in x in eine Gleichung der Form $(x – p)^2 = q$ umzuwandeln, die dieselben Lösungen hat. Die Lösungsformel für quadratische Gleichungen aus dieser Form herleiten."},
{"id": "A-REI.B.4a", "description": "Die Methode der quadratischen Ergänzung verwenden, um jede quadratische Gleichung in x in eine Gleichung der Form $(x – p)^2 = q$ umzuwandeln, die dieselben Lösungen hat. Die Lösungsformel für quadratische Gleichungen aus dieser Form herleiten."},
{"id": "A-REI.B.4b", "description": "Quadratische Gleichungen durch Inspektion (z.B. für $x^2 = 49$), Wurzelziehen, quadratische Ergänzung, die Lösungsformel und Faktorisierung lösen, je nach Ausgangsform der Gleichung. Erkennen, wann die Lösungsformel komplexe Lösungen ergibt, und diese als $a \\pm bi$ für reelle Zahlen a und b schreiben."},
{"id": "A-REI.C", "description": "Gleichungssysteme lösen."},
{"id": "A-REI.C.5", "description": "Beweisen, dass, gegeben ein System von zwei Gleichungen mit zwei Variablen, das Ersetzen einer Gleichung durch die Summe dieser Gleichung und eines Vielfachen der anderen ein System mit denselben Lösungen erzeugt."},
{"id": "A-REI.C.6", "description": "Lineare Gleichungssysteme exakt und näherungsweise (z.B. mit Graphen) lösen, mit Schwerpunkt auf Paaren von linearen Gleichungen mit zwei Variablen."},
{"id": "A-REI.C.7", "description": "Ein einfaches System, das aus einer linearen Gleichung und einer quadratischen Gleichung mit zwei Variablen besteht, algebraisch und grafisch lösen. Zum Beispiel die Schnittpunkte zwischen der Geraden $y = –3x$ und dem Kreis $x^2 + y^2 = 3$ finden."},
{"id": "A-REI.C.8", "description": "Ein lineares Gleichungssystem als eine einzige Matrizengleichung in einer Vektorvariablen darstellen."},
{"id": "A-REI.C.9", "description": "Die Inverse einer Matrix finden, falls sie existiert, und sie zur Lösung von linearen Gleichungssystemen verwenden (unter Einsatz von Technologie für Matrizen der Dimension 3 × 3 oder größer)."},
{"id": "A-REI.D", "description": "Gleichungen und Ungleichungen grafisch darstellen und lösen."},
{"id": "A-REI.D.10", "description": "Verstehen, dass der Graph einer Gleichung mit zwei Variablen die Menge all ihrer Lösungen ist, die im Koordinatensystem aufgetragen sind und oft eine Kurve (die auch eine Gerade sein kann) bilden."},
{"id": "A-REI.D.11", "description": "Erklären, warum die x-Koordinaten der Punkte, an denen die Graphen der Gleichungen $y = f(x)$ und $y = g(x)$ sich schneiden, die Lösungen der Gleichung $f(x) = g(x)$ sind; die Lösungen näherungsweise finden, z.B. unter Verwendung von Technologie, um die Funktionen grafisch darzustellen, Wertetabellen zu erstellen oder schrittweise Näherungen zu finden. Fälle einschließen, in denen $f(x)$ und/oder $g(x)$ lineare, Polynom-, rationale, Betrags-, Exponential- und Logarithmusfunktionen sind."},
{"id": "A-REI.D.12", "description": "Die Lösungen einer linearen Ungleichung mit zwei Variablen als eine Halbebene grafisch darstellen (wobei die Randlinie im Falle einer strikten Ungleichung ausgeschlossen wird) und die Lösungsmenge eines Systems linearer Ungleichungen mit zwei Variablen als die Schnittmenge der entsprechenden Halbebenen grafisch darstellen."},
{"id": "F-IF.A", "description": "Das Konzept einer Funktion verstehen und die Funktionsnotation verwenden."},
{"id": "F-IF.A.1", "description": "Verstehen, dass eine Funktion von einer Menge (dem Definitionsbereich) zu einer anderen Menge (dem Wertebereich) jedem Element des Definitionsbereichs genau ein Element des Wertebereichs zuordnet. Wenn f eine Funktion ist und x ein Element ihres Definitionsbereichs, dann bezeichnet f(x) die Ausgabe von f, die der Eingabe x entspricht. Der Graph von f ist der Graph der Gleichung $y = f(x)$."},
{"id": "F-IF.A.2", "description": "Funktionsnotation verwenden, Funktionen für Eingaben in ihren Definitionsbereichen auswerten und Aussagen, die Funktionsnotation verwenden, im Kontext interpretieren."}
{"id": "F-IF.A.3", "description": "Erkennen, dass Folgen Funktionen sind, die manchmal rekursiv definiert werden und deren Definitionsbereich eine Teilmenge der ganzen Zahlen ist. Zum Beispiel wird die Fibonacci-Folge rekursiv durch $f(0) = f(1) = 1, f(n+1) = f(n) + f(n-1)$ für $n \\ge 1$ definiert."},
{"id": "F-IF.B", "description": "Funktionen, die in Anwendungen auftreten, im Kontext interpretieren."},
{"id": "F-IF.B.4", "description": "Für eine Funktion, die eine Beziehung zwischen zwei Größen modelliert, wesentliche Merkmale von Graphen und Tabellen im Sinne der Größen interpretieren und Graphen skizzieren, die wesentliche Merkmale bei gegebener verbaler Beschreibung der Beziehung zeigen. Wesentliche Merkmale umfassen: Achsenabschnitte; Intervalle, in denen die Funktion steigend, fallend, positiv oder negativ ist; relative Maxima und Minima; Symmetrien; Verhalten im Unendlichen; und Periodizität."},
{"id": "F-IF.B.5", "description": "Den Definitionsbereich einer Funktion mit ihrem Graphen und, wo anwendbar, mit der von ihr beschriebenen quantitativen Beziehung in Verbindung bringen. Zum Beispiel, wenn die Funktion h(n) die Anzahl der Personenstunden angibt, die zum Zusammenbau von n Motoren in einer Fabrik benötigt werden, wären die positiven ganzen Zahlen ein geeigneter Definitionsbereich für die Funktion."},
{"id": "F-IF.B.6", "description": "Die mittlere Änderungsrate einer Funktion (symbolisch oder als Tabelle dargestellt) über ein bestimmtes Intervall berechnen und interpretieren. Die Änderungsrate aus einem Graphen schätzen."},
{"id": "F-IF.C", "description": "Funktionen mithilfe verschiedener Darstellungsformen analysieren."},
{"id": "F-IF.C.7", "description": "Symbolisch ausgedrückte Funktionen grafisch darstellen und wesentliche Merkmale des Graphen zeigen, in einfachen Fällen von Hand und in komplizierteren Fällen mithilfe von Technologie.\nInhalt dieses Standards:\n - Lineare und quadratische Funktionen grafisch darstellen und Achsenabschnitte, Maxima und Minima zeigen.\n - Quadratwurzel-, Kubikwurzel- und abschnittsweise definierte Funktionen, einschließlich Treppenfunktionen und Betragsfunktionen, grafisch darstellen.\n - Exponential- und Logarithmusfunktionen grafisch darstellen und dabei Achsenabschnitte und das Verhalten im Unendlichen zeigen, sowie trigonometrische Funktionen und dabei Periode, Mittellinie und Amplitude zeigen.\n - Polynomfunktionen grafisch darstellen, dabei Nullstellen identifizieren, wenn geeignete Faktorisierungen verfügbar sind, und das Verhalten im Unendlichen zeigen.\n - Rationale Funktionen grafisch darstellen, dabei Nullstellen und Asymptoten identifizieren, wenn geeignete Faktorisierungen verfügbar sind, und das Verhalten im Unendlichen zeigen."},
{"id": "F-IF.C.7a", "description": "Lineare und quadratische Funktionen grafisch darstellen und Achsenabschnitte, Maxima und Minima zeigen."},
{"id": "F-IF.C.7b", "description": "Quadratwurzel-, Kubikwurzel- und abschnittsweise definierte Funktionen, einschließlich Treppenfunktionen und Betragsfunktionen, grafisch darstellen."},
{"id": "F-IF.C.7c", "description": "Polynomfunktionen grafisch darstellen, dabei Nullstellen identifizieren, wenn geeignete Faktorisierungen verfügbar sind, und das Verhalten im Unendlichen zeigen."},
{"id": "F-IF.C.7d", "description": "Rationale Funktionen grafisch darstellen, dabei Nullstellen und Asymptoten identifizieren, wenn geeignete Faktorisierungen verfügbar sind, und das Verhalten im Unendlichen zeigen."},
{"id": "F-IF.C.7e", "description": "Exponential- und Logarithmusfunktionen grafisch darstellen und dabei Achsenabschnitte und das Verhalten im Unendlichen zeigen, sowie trigonometrische Funktionen und dabei Periode, Mittellinie und Amplitude zeigen."},
{"id": "F-IF.C.8", "description": "Eine durch einen Term definierte Funktion in verschiedene, aber äquivalente Formen schreiben, um verschiedene Eigenschaften der Funktion aufzuzeigen und zu erklären.\nInhalt dieses Standards:\n - Den Prozess der Faktorisierung und der quadratischen Ergänzung bei einer quadratischen Funktion verwenden, um Nullstellen, Extremwerte und die Symmetrie des Graphen zu zeigen und diese im Kontext zu interpretieren.\n - Die Potenzgesetze verwenden, um Terme für Exponentialfunktionen zu interpretieren. Zum Beispiel die prozentuale Änderungsrate in Funktionen wie $y = (1,02)^t, y = (0,97)^t, y = (1,01)^{12t}, y = (1,2)^{t/10}$ identifizieren und sie als exponentielles Wachstum oder Zerfall klassifizieren."},
{"id": "F-IF.C.8a", "description": "Den Prozess der Faktorisierung und der quadratischen Ergänzung bei einer quadratischen Funktion verwenden, um Nullstellen, Extremwerte und die Symmetrie des Graphen zu zeigen und diese im Kontext zu interpretieren."},
{"id": "F-IF.C.8b", "description": "Die Potenzgesetze verwenden, um Terme für Exponentialfunktionen zu interpretieren. Zum Beispiel die prozentuale Änderungsrate in Funktionen wie $y = (1,02)^t, y = (0,97)^t, y = (1,01)^{12t}, y = (1,2)^{t/10}$ identifizieren und sie als exponentielles Wachstum oder Zerfall klassifizieren."},
{"id": "F-IF.C.9", "description": "Eigenschaften von zwei Funktionen vergleichen, die jeweils auf unterschiedliche Weise dargestellt sind (algebraisch, grafisch, numerisch in Tabellen oder durch verbale Beschreibungen). Zum Beispiel bei einem Graphen einer quadratischen Funktion und einem algebraischen Term für eine andere angeben, welche das größere Maximum hat."},
{"id": "F-BF.A", "description": "Eine Funktion erstellen, die eine Beziehung zwischen zwei Größen modelliert."},
{"id": "F-BF.A.1", "description": "Eine Funktion schreiben, die eine Beziehung zwischen zwei Größen beschreibt.\nInhalt dieses Standards:\n - Standardfunktionstypen mithilfe arithmetischer Operationen kombinieren. Zum Beispiel eine Funktion erstellen, die die Temperatur eines abkühlenden Körpers modelliert, indem eine konstante Funktion zu einer abklingenden Exponentialfunktion addiert wird, und diese Funktionen mit dem Modell in Beziehung setzen.\n - Funktionen verketten. Zum Beispiel, wenn T(y) die Temperatur in der Atmosphäre als Funktion der Höhe ist und h(t) die Höhe eines Wetterballons als Funktion der Zeit, dann ist T(h(t)) die Temperatur am Standort des Wetterballons als Funktion der Zeit.\n - Aus einem Kontext eine explizite Darstellung, einen rekursiven Prozess oder Berechnungsschritte bestimmen."},
{"id": "F-BF.A.1a", "description": "Aus einem Kontext eine explizite Darstellung, einen rekursiven Prozess oder Berechnungsschritte bestimmen."},
{"id": "F-BF.A.1b", "description": "Standardfunktionstypen mithilfe arithmetischer Operationen kombinieren. Zum Beispiel eine Funktion erstellen, die die Temperatur eines abkühlenden Körpers modelliert, indem eine konstante Funktion zu einer abklingenden Exponentialfunktion addiert wird, und diese Funktionen mit dem Modell in Beziehung setzen."},
{"id": "F-BF.A.1c", "description": "Funktionen verketten. Zum Beispiel, wenn T(y) die Temperatur in der Atmosphäre als Funktion der Höhe ist und h(t) die Höhe eines Wetterballons als Funktion der Zeit, dann ist T(h(t)) die Temperatur am Standort des Wetterballons als Funktion der Zeit."},
{"id": "F-BF.A.2", "description": "Arithmetische und geometrische Folgen sowohl rekursiv als auch mit einer expliziten Formel schreiben, sie zur Modellierung von Situationen verwenden und zwischen den beiden Formen übersetzen."},
{"id": "F-BF.B", "description": "Neue Funktionen aus bestehenden Funktionen erstellen."},
{"id": "F-BF.B.3", "description": "Die Auswirkung auf den Graphen identifizieren, wenn f(x) durch $f(x) + k, k \\cdot f(x), f(kx)$ und $f(x + k)$ für spezifische Werte von k (sowohl positiv als auch negativ) ersetzt wird; den Wert von k bei gegebenen Graphen finden. Mit Fällen experimentieren und eine Erklärung der Auswirkungen auf den Graphen mithilfe von Technologie veranschaulichen. Dies schließt das Erkennen von geraden und ungeraden Funktionen anhand ihrer Graphen und ihrer algebraischen Terme ein."},
{"id": "F-BF.B.4", "description": "Umkehrfunktionen finden.\nInhalt dieses Standards:\n - Eine Gleichung der Form $f(x) = c$ für eine einfache Funktion f, die eine Umkehrfunktion hat, lösen und einen Term für die Umkehrfunktion schreiben. Zum Beispiel $f(x) = 2x^3$ oder $f(x) = (x+1)/(x–1)$ für $x \\neq 1$.\n - Werte einer Umkehrfunktion aus einem Graphen oder einer Tabelle ablesen, vorausgesetzt, die Funktion hat eine Umkehrfunktion.\n - Aus einer nicht umkehrbaren Funktion durch Einschränkung des Definitionsbereichs eine umkehrbare Funktion erzeugen.\n - Durch Verkettung überprüfen, dass eine Funktion die Umkehrfunktion einer anderen ist."}
{"id": "F-BF.B.4a", "description": "Eine Gleichung der Form $f(x) = c$ für eine einfache Funktion f, die eine Umkehrfunktion hat, lösen und einen Term für die Umkehrfunktion schreiben. Zum Beispiel $f(x) = 2x^3$ oder $f(x) = (x+1)/(x–1)$ für $x \\neq 1$."},
{"id": "F-BF.B.4b", "description": "Durch Verkettung überprüfen, dass eine Funktion die Umkehrfunktion einer anderen ist."},
{"id": "F-BF.B.4c", "description": "Werte einer Umkehrfunktion aus einem Graphen oder einer Tabelle ablesen, vorausgesetzt, die Funktion hat eine Umkehrfunktion."},
{"id": "F-BF.B.4d", "description": "Aus einer nicht umkehrbaren Funktion durch Einschränkung des Definitionsbereichs eine umkehrbare Funktion erzeugen."},
{"id": "F-BF.B.5", "description": "Die umgekehrte Beziehung zwischen Exponenten und Logarithmen verstehen und diese Beziehung zur Lösung von Problemen mit Logarithmen und Exponenten verwenden."},
{"id": "F-LE.A", "description": "Lineare und exponentielle Modelle erstellen und vergleichen und Probleme lösen."},
{"id": "F-LE.A.1", "description": "Zwischen Situationen unterscheiden, die mit linearen Funktionen und mit Exponentialfunktionen modelliert werden können.\nInhalt dieses Standards:\n - Situationen erkennen, in denen sich eine Größe mit einer konstanten Rate pro Einheitsintervall relativ zu einer anderen ändert.\n - Beweisen, dass lineare Funktionen in gleichen Intervallen um gleiche Differenzen wachsen und dass Exponentialfunktionen in gleichen Intervallen um gleiche Faktoren wachsen.\n - Situationen erkennen, in denen eine Größe mit einer konstanten prozentualen Rate pro Einheitsintervall relativ zu einer anderen wächst oder abnimmt."},
{"id": "F-LE.A.1a", "description": "Beweisen, dass lineare Funktionen in gleichen Intervallen um gleiche Differenzen wachsen und dass Exponentialfunktionen in gleichen Intervallen um gleiche Faktoren wachsen."},
{"id": "F-LE.A.1b", "description": "Situationen erkennen, in denen sich eine Größe mit einer konstanten Rate pro Einheitsintervall relativ zu einer anderen ändert."},
{"id": "F-LE.A.1c", "description": "Situationen erkennen, in denen eine Größe mit einer konstanten prozentualen Rate pro Einheitsintervall relativ zu einer anderen wächst oder abnimmt."},
{"id": "F-LE.A.2", "description": "Lineare und Exponentialfunktionen, einschließlich arithmetischer und geometrischer Folgen, bei gegebenem Graphen, einer Beschreibung einer Beziehung oder zwei Eingabe-Ausgabe-Paaren (einschließlich des Ablesens aus einer Tabelle) erstellen."},
{"id": "F-LE.A.3", "description": "Mithilfe von Graphen und Tabellen beobachten, dass eine exponentiell ansteigende Größe schließlich eine linear, quadratisch oder (allgemeiner) als Polynomfunktion ansteigende Größe übertrifft."},
{"id": "F-LE.A.4", "description": "Für exponentielle Modelle die Lösung von $ab^{ct} = d$, wobei a, c und d Zahlen sind und die Basis b 2, 10 oder e ist, als Logarithmus ausdrücken; den Logarithmus mithilfe von Technologie auswerten."},
{"id": "F-LE.B", "description": "Terme für Funktionen im Hinblick auf die von ihnen modellierte Situation interpretieren."},
{"id": "F-LE.B.5", "description": "Die Parameter in einer linearen oder Exponentialfunktion im Kontext interpretieren."},
{"id": "F-TF.A", "description": "Den Definitionsbereich von trigonometrischen Funktionen mithilfe des Einheitskreises erweitern."},
{"id": "F-TF.A.1", "description": "Das Bogenmaß eines Winkels als die Länge des Kreisbogens am Einheitskreis verstehen, der vom Winkel überstrichen wird."},
{"id": "F-TF.A.2", "description": "Erklären, wie der Einheitskreis in der Koordinatenebene die Erweiterung der trigonometrischen Funktionen auf alle reellen Zahlen ermöglicht, interpretiert als Bogenmaße von Winkeln, die gegen den Uhrzeigersinn um den Einheitskreis durchlaufen werden."},
{"id": "F-TF.A.3", "description": "Besondere Dreiecke verwenden, um die Werte von Sinus, Kosinus, Tangens für $\\pi/3, \\pi/4$ und $\\pi/6$ geometrisch zu bestimmen, und den Einheitskreis verwenden, um die Werte von Sinus, Kosinus und Tangens für $\\pi–x, \\pi+x$ und $2\\pi–x$ in Bezug auf ihre Werte für x auszudrücken, wobei x eine beliebige reelle Zahl ist."},
{"id": "F-TF.A.4", "description": "Den Einheitskreis verwenden, um die Symmetrie (ungerade und gerade) und Periodizität von trigonometrischen Funktionen zu erklären."},
{"id": "F-TF.B", "description": "Periodische Phänomene mit trigonometrischen Funktionen modellieren."},
{"id": "F-TF.B.5", "description": "Trigonometrische Funktionen auswählen, um periodische Phänomene mit angegebener Amplitude, Frequenz und Mittellinie zu modellieren."},
{"id": "F-TF.B.6", "description": "Verstehen, dass die Einschränkung einer trigonometrischen Funktion auf einen Definitionsbereich, auf dem sie streng monoton steigend oder fallend ist, die Konstruktion ihrer Umkehrfunktion ermöglicht."},
{"id": "F-TF.B.7", "description": "Umkehrfunktionen verwenden, um trigonometrische Gleichungen zu lösen, die in Modellierungskontexten auftreten; die Lösungen mithilfe von Technologie auswerten und sie im Kontext interpretieren."},
{"id": "F-TF.C", "description": "Trigonometrische Identitäten beweisen und anwenden."}
{"id": "F-TF.C.8", "description": "Die Identität $\\sin^2(\\theta) + \\cos^2(\\theta) = 1$ (trigonometrischer Pythagoras) beweisen und verwenden, um $\\sin(\\theta), \\cos(\\theta)$ oder $\\tan(\\theta)$ zu finden, wenn einer dieser Werte und der Quadrant des Winkels gegeben sind."},
{"id": "F-TF.C.9", "description": "Die Additionstheoreme für Sinus, Kosinus und Tangens beweisen und zur Problemlösung verwenden."},
{"id": "G-CO.A", "description": "Mit Transformationen (Abbildungen) in der Ebene experimentieren."},
{"id": "G-CO.A.1", "description": "Präzise Definitionen von Winkel, Kreis, senkrechter Gerade, paralleler Gerade und Strecke kennen, die auf den nicht definierten Grundbegriffen Punkt, Gerade, Abstand entlang einer Geraden und Abstand entlang eines Kreisbogens basieren."},
{"id": "G-CO.A.2", "description": "Transformationen in der Ebene darstellen, z.B. mithilfe von Folien und Geometriesoftware; Transformationen als Funktionen beschreiben, die Punkte in der Ebene als Eingabe nehmen und andere Punkte als Ausgabe liefern. Transformationen, die abstands- und winkeltreu sind, mit solchen vergleichen, die es nicht sind (z.B. Verschiebung versus horizontale Streckung)."},
{"id": "G-CO.A.3", "description": "Für ein gegebenes Rechteck, Parallelogramm, Trapez oder regelmäßiges Polygon die Drehungen und Spiegelungen beschreiben, die es auf sich selbst abbilden."},
{"id": "G-CO.A.4", "description": "Definitionen von Drehungen, Spiegelungen und Verschiebungen in Bezug auf Winkel, Kreise, senkrechte Geraden, parallele Geraden und Strecken entwickeln."},
{"id": "G-CO.A.5", "description": "Bei einer gegebenen geometrischen Figur und einer Drehung, Spiegelung oder Verschiebung die abgebildete Figur zeichnen, z.B. auf Millimeterpapier, mit Pauspapier oder Geometriesoftware. Eine Folge von Transformationen angeben, die eine gegebene Figur auf eine andere abbildet."},
{"id": "G-CO.B", "description": "Kongruenz im Sinne von Kongruenzabbildungen verstehen."},
{"id": "G-CO.B.6", "description": "Geometrische Beschreibungen von Kongruenzabbildungen verwenden, um Figuren zu transformieren und die Auswirkung einer gegebenen Kongruenzabbildung auf eine gegebene Figur vorherzusagen; bei zwei gegebenen Figuren die Definition der Kongruenz im Sinne von Kongruenzabbildungen verwenden, um zu entscheiden, ob sie kongruent sind."},
{"id": "G-CO.B.7", "description": "Die Definition der Kongruenz im Sinne von Kongruenzabbildungen verwenden, um zu zeigen, dass zwei Dreiecke genau dann kongruent sind, wenn entsprechende Seitenpaare und entsprechende Winkelpaare kongruent sind."},
{"id": "G-CO.B.8", "description": "Erklären, wie die Kriterien für die Dreieckskongruenz (WSW, SWS und SSS) aus der Definition der Kongruenz im Sinne von Kongruenzabbildungen folgen."},
{"id": "G-CO.C", "description": "Geometrische Sätze beweisen."},
{"id": "G-CO.C.9", "description": "Sätze über Geraden und Winkel beweisen. Die Sätze umfassen: Scheitelwinkel sind kongruent; wenn eine Transversale parallele Geraden kreuzt, sind Wechselwinkel kongruent und Stufenwinkel sind kongruent; Punkte auf der Mittelsenkrechten einer Strecke sind genau die, die von den Endpunkten der Strecke gleich weit entfernt sind."},
{"id": "G-CO.C.10", "description": "Sätze über Dreiecke beweisen. Die Sätze umfassen: die Summe der Innenwinkel eines Dreiecks beträgt 180°; die Basiswinkel von gleichschenkligen Dreiecken sind kongruent; die Strecke, die die Mittelpunkte zweier Seiten eines Dreiecks verbindet, ist parallel zur dritten Seite und halb so lang; die Seitenhalbierenden eines Dreiecks treffen sich in einem Punkt."},
{"id": "G-CO.C.11", "description": "Sätze über Parallelogramme beweisen. Die Sätze umfassen: gegenüberliegende Seiten sind kongruent, gegenüberliegende Winkel sind kongruent, die Diagonalen eines Parallelogramms halbieren sich gegenseitig, und umgekehrt, Rechtecke sind Parallelogramme mit kongruenten Diagonalen."},
{"id": "G-CO.D", "description": "Geometrische Konstruktionen durchführen."},
{"id": "G-CO.D.12", "description": "Formale geometrische Konstruktionen mit einer Vielzahl von Werkzeugen und Methoden (Zirkel und Lineal, Schnur, Spiegel, Papierfalten, dynamische Geometriesoftware usw.) durchführen. Kopieren einer Strecke; Kopieren eines Winkels; Halbieren einer Strecke; Halbieren eines Winkels; Konstruieren von senkrechten Geraden, einschließlich der Mittelsenkrechten einer Strecke; und Konstruieren einer Geraden parallel zu einer gegebenen Geraden durch einen Punkt, der nicht auf der Geraden liegt."},
{"id": "G-CO.D.13", "description": "Ein gleichseitiges Dreieck, ein Quadrat und ein regelmäßiges Sechseck konstruieren, die in einen Kreis einbeschrieben sind."},
{"id": "G-SRT.A", "description": "Ähnlichkeit im Sinne von Ähnlichkeitsabbildungen verstehen."},
{"id": "G-SRT.A.1", "description": "Die Eigenschaften von zentrischen Streckungen, die durch ein Zentrum und einen Streckfaktor gegeben sind, experimentell überprüfen:\n - Eine zentrische Streckung bildet eine Gerade, die nicht durch das Streckzentrum geht, auf eine parallele Gerade ab und lässt eine Gerade, die durch das Zentrum geht, unverändert.\n - Die zentrische Streckung einer Strecke ist länger oder kürzer im durch den Streckfaktor gegebenen Verhältnis."},
{"id": "G-SRT.A.1a", "description": "Eine zentrische Streckung bildet eine Gerade, die nicht durch das Streckzentrum geht, auf eine parallele Gerade ab und lässt eine Gerade, die durch das Zentrum geht, unverändert."},
{"id": "G-SRT.A.1b", "description": "Die zentrische Streckung einer Strecke ist länger oder kürzer im durch den Streckfaktor gegebenen Verhältnis."},
{"id": "G-SRT.A.2", "description": "Bei zwei gegebenen Figuren die Definition der Ähnlichkeit im Sinne von Ähnlichkeitsabbildungen verwenden, um zu entscheiden, ob sie ähnlich sind; unter Verwendung von Ähnlichkeitsabbildungen die Bedeutung der Ähnlichkeit für Dreiecke als die Gleichheit aller entsprechenden Winkelpaare und die Proportionalität aller entsprechenden Seitenpaare erklären."},
{"id": "G-SRT.A.3", "description": "Die Eigenschaften von Ähnlichkeitsabbildungen verwenden, um das WW-Kriterium für die Ähnlichkeit zweier Dreiecke zu belegen."}
{"id": "G-SRT.B", "description": "Sätze zur Ähnlichkeit beweisen."},
{"id": "G-SRT.B.4", "description": "Sätze über Dreiecke beweisen. Die Sätze umfassen: eine Parallele zu einer Dreiecksseite teilt die beiden anderen Seiten im gleichen Verhältnis (Strahlensatz) und seine Umkehrung; der Satz des Pythagoras, bewiesen mithilfe von Dreiecksähnlichkeit."},
{"id": "G-SRT.B.5", "description": "Kongruenz- und Ähnlichkeitssätze für Dreiecke verwenden, um Probleme zu lösen und Beziehungen in geometrischen Figuren zu beweisen."},
{"id": "G-SRT.C", "description": "Trigonometrische Verhältnisse definieren und Probleme mit rechtwinkligen Dreiecken lösen."},
{"id": "G-SRT.C.6", "description": "Verstehen, dass aufgrund der Ähnlichkeit die Seitenverhältnisse in rechtwinkligen Dreiecken Eigenschaften der Winkel im Dreieck sind, was zu den Definitionen der trigonometrischen Verhältnisse für spitze Winkel führt."},
{"id": "G-SRT.C.7", "description": "Die Beziehung zwischen dem Sinus und Kosinus von Komplementärwinkeln erklären und verwenden."},
{"id": "G-SRT.C.8", "description": "Trigonometrische Verhältnisse und den Satz des Pythagoras verwenden, um rechtwinklige Dreiecke in Anwendungsproblemen zu lösen."},
{"id": "G-SRT.D", "description": "Trigonometrie auf allgemeine Dreiecke anwenden."},
{"id": "G-SRT.D.9", "description": "Die Formel $A = 1/2 ab \\sin(C)$ für den Flächeninhalt eines Dreiecks herleiten, indem eine Hilfslinie von einem Eckpunkt senkrecht zur gegenüberliegenden Seite gezeichnet wird."},
{"id": "G-SRT.D.10", "description": "Den Sinus- und Kosinussatz beweisen und zur Problemlösung verwenden."},
{"id": "G-SRT.D.11", "description": "Den Sinus- und Kosinussatz verstehen und anwenden, um unbekannte Maße in rechtwinkligen und nicht-rechtwinkligen Dreiecken zu finden (z.B. bei Vermessungsaufgaben, resultierenden Kräften)."},
{"id": "G-C.A", "description": "Sätze über Kreise verstehen und anwenden."},
{"id": "G-C.A.1", "description": "Beweisen, dass alle Kreise ähnlich sind."},
{"id": "G-C.A.2", "description": "Beziehungen zwischen Umfangswinkeln, Radien und Sehnen identifizieren und beschreiben. Dies schließt die Beziehung zwischen Mittelpunkts-, Umfangs- und Sehnentangentenwinkeln ein; Umfangswinkel über einem Durchmesser sind rechte Winkel (Satz des Thales); der Radius eines Kreises ist senkrecht zur Tangente, wo der Radius den Kreis schneidet."},
{"id": "G-C.A.3", "description": "Den In- und Umkreis eines Dreiecks konstruieren und Eigenschaften von Winkeln für ein Sehnenviereck beweisen."},
{"id": "G-C.A.4", "description": "Eine Tangente von einem Punkt außerhalb eines gegebenen Kreises an den Kreis konstruieren."},
{"id": "G-C.B", "description": "Bogenlängen und Flächeninhalte von Kreissektoren finden."},
{"id": "G-C.B.5", "description": "Mithilfe von Ähnlichkeit die Tatsache herleiten, dass die Länge des von einem Winkel überstrichenen Bogens proportional zum Radius ist, und das Bogenmaß des Winkels als die Proportionalitätskonstante definieren; die Formel für den Flächeninhalt eines Sektors herleiten."},
{"id": "G-GPE.A", "description": "Zwischen der geometrischen Beschreibung und der Gleichung für einen Kegelschnitt übersetzen."},
{"id": "G-GPE.A.1", "description": "Die Gleichung eines Kreises mit gegebenem Mittelpunkt und Radius mithilfe des Satzes des Pythagoras herleiten; die quadratische Ergänzung durchführen, um den Mittelpunkt und Radius eines durch eine Gleichung gegebenen Kreises zu finden."},
{"id": "G-GPE.A.2", "description": "Die Gleichung einer Parabel bei gegebenem Brennpunkt und gegebener Leitlinie herleiten."},
{"id": "G-GPE.A.3", "description": "(+)Die Gleichungen von Ellipsen und Hyperbeln bei gegebenen Brennpunkten herleiten, unter Verwendung der Tatsache, dass die Summe oder Differenz der Abstände von den Brennpunkten konstant ist."},
{"id": "G-GPE.B", "description": "Koordinaten verwenden, um einfache geometrische Sätze algebraisch zu beweisen."},
{"id": "G-GPE.B.4", "description": "Koordinaten verwenden, um einfache geometrische Sätze algebraisch zu beweisen. Zum Beispiel beweisen oder widerlegen, dass eine durch vier gegebene Punkte in der Koordinatenebene definierte Figur ein Rechteck ist; beweisen oder widerlegen, dass der Punkt $(1, \\sqrt{3})$ auf dem Kreis liegt, der im Ursprung zentriert ist und den Punkt (0, 2) enthält."},
{"id": "G-GPE.B.5", "description": "Die Steigungskriterien für parallele und senkrechte Geraden beweisen und zur Lösung geometrischer Probleme verwenden (z.B. die Gleichung einer Geraden finden, die parallel oder senkrecht zu einer gegebenen Geraden ist und durch einen gegebenen Punkt verläuft)."}
{"id": "G-GPE.B.6", "description": "Den Punkt auf einer gerichteten Strecke zwischen zwei gegebenen Punkten finden, der die Strecke in einem gegebenen Verhältnis teilt."},
{"id": "G-GPE.B.7", "description": "Koordinaten verwenden, um Umfänge von Polygonen und Flächeninhalte von Dreiecken und Rechtecken zu berechnen, z.B. unter Verwendung der Abstandsformel."},
{"id": "G-GMD.A", "description": "Volumenformeln erklären und zur Problemlösung verwenden."},
{"id": "G-GMD.A.1", "description": "Eine informelle Herleitung für die Formeln für den Kreisumfang, den Kreisflächeninhalt, das Volumen eines Zylinders, einer Pyramide und eines Kegels geben. Zerlegungsargumente, das Prinzip des Cavalieri und informelle Grenzwertargumente verwenden."},
{"id": "G-GMD.A.2", "description": "Eine informelle Herleitung unter Verwendung des Prinzips des Cavalieri für die Formeln für das Volumen einer Kugel und anderer Körper geben."},
{"id": "G-GMD.A.3", "description": "Volumenformeln für Zylinder, Pyramiden, Kegel und Kugeln zur Problemlösung verwenden."},
{"id": "G-GMD.B", "description": "Beziehungen zwischen zwei- und dreidimensionalen Objekten visualisieren."},
{"id": "G-GMD.B.4", "description": "Die Formen von zweidimensionalen Querschnitten dreidimensionaler Objekte identifizieren und dreidimensionale Objekte identifizieren, die durch Rotation von zweidimensionalen Objekten erzeugt werden (Rotationskörper)."},
{"id": "G-MG.A", "description": "Geometrische Konzepte in Modellierungssituationen anwenden."},
{"id": "G-MG.A.1", "description": "Geometrische Formen, ihre Maße und ihre Eigenschaften zur Beschreibung von Objekten verwenden (z.B. einen Baumstamm oder einen menschlichen Rumpf als Zylinder modellieren)."},
{"id": "G-MG.A.2", "description": "Konzepte der Dichte, bezogen auf Fläche und Volumen, in Modellierungssituationen anwenden (z.B. Personen pro Quadratmeile, BTUs pro Kubikfuß)."},
{"id": "G-MG.A.3", "description": "Geometrische Methoden zur Lösung von Designproblemen anwenden (z.B. Entwerfen eines Objekts oder einer Struktur zur Erfüllung physikalischer Randbedingungen oder zur Kostenminimierung; Arbeiten mit typografischen Rastersystemen, die auf Verhältnissen basieren)."},
{"id": "S-ID.A", "description": "Daten zu einer einzelnen Zähl- oder Messgröße zusammenfassen, darstellen und interpretieren."},
{"id": "S-ID.A.1", "description": "Daten mit Diagrammen auf der reellen Zahlengeraden darstellen (Punktdiagramme, Histogramme und Boxplots)."},
{"id": "S-ID.A.2", "description": "Statistische Kennzahlen, die zur Form der Datenverteilung passen, verwenden, um das Zentrum (Median, Mittelwert) und die Streuung (Interquartilsabstand, Standardabweichung) von zwei oder mehr verschiedenen Datensätzen zu vergleichen."},
{"id": "S-ID.A.3", "description": "Unterschiede in Form, Zentrum und Streuung im Kontext der Datensätze interpretieren und dabei mögliche Auswirkungen von Extremwerten (Ausreißern) berücksichtigen."},
{"id": "S-ID.A.4", "description": "Den Mittelwert und die Standardabweichung eines Datensatzes verwenden, um ihn an eine Normalverteilung anzupassen und Bevölkerungsanteile zu schätzen. Erkennen, dass es Datensätze gibt, für die ein solches Verfahren nicht geeignet ist. Taschenrechner, Tabellenkalkulationen und Tabellen verwenden, um Flächen unter der Normalkurve zu schätzen."},
{"id": "S-ID.B", "description": "Daten zu zwei kategorialen und quantitativen Variablen zusammenfassen, darstellen und interpretieren."},
{"id": "S-ID.B.5", "description": "Kategoriale Daten für zwei Kategorien in Zwei-Wege-Häufigkeitstabellen zusammenfassen. Relative Häufigkeiten im Kontext der Daten interpretieren (einschließlich gemeinsamer, marginaler und bedingter relativer Häufigkeiten). Mögliche Zusammenhänge und Trends in den Daten erkennen."},
{"id": "S-ID.B.6", "description": "Daten zu zwei quantitativen Variablen in einem Streudiagramm darstellen und beschreiben, wie die Variablen zusammenhängen.\nInhalt dieses Standards:\n - Die Anpassungsgüte einer Funktion informell bewerten, indem Residuen aufgetragen und analysiert werden.\n - Eine lineare Funktion für ein Streudiagramm anpassen, das einen linearen Zusammenhang nahelegt.\n - Eine Funktion an die Daten anpassen; an Daten angepasste Funktionen verwenden, um Probleme im Kontext der Daten zu lösen. Gegebene Funktionen verwenden oder eine vom Kontext nahegelegte Funktion wählen. Lineare und exponentielle Modelle hervorheben."},
{"id": "S-ID.B.6a", "description": "Eine Funktion an die Daten anpassen; an Daten angepasste Funktionen verwenden, um Probleme im Kontext der Daten zu lösen. Gegebene Funktionen verwenden oder eine vom Kontext nahegelegte Funktion wählen. Lineare und exponentielle Modelle hervorheben."},
{"id": "S-ID.B.6b", "description": "Die Anpassungsgüte einer Funktion informell bewerten, indem Residuen aufgetragen und analysiert werden."},
{"id": "S-ID.B.6c", "description": "Eine lineare Funktion für ein Streudiagramm anpassen, das einen linearen Zusammenhang nahelegt."},
{"id": "S-ID.C", "description": "Lineare Modelle interpretieren."},
{"id": "S-ID.C.7", "description": "Die Steigung (Änderungsrate) und den Achsenabschnitt (konstanter Term) eines linearen Modells im Kontext der Daten interpretieren."}
{"id": "S-ID.C.8", "description": "Den Korrelationskoeffizienten einer linearen Anpassung (mithilfe von Technologie) berechnen und interpretieren."},
{"id": "S-ID.C.9", "description": "Zwischen Korrelation und Kausalität unterscheiden."},
{"id": "S-IC.A", "description": "Zufällige Prozesse, die statistischen Experimenten zugrunde liegen, verstehen und bewerten."},
{"id": "S-IC.A.1", "description": "Statistik als einen Prozess verstehen, um auf der Grundlage einer Zufallsstichprobe aus einer Grundgesamtheit Schlussfolgerungen über Parameter dieser Grundgesamtheit zu ziehen."},
{"id": "S-IC.A.2", "description": "Entscheiden, ob ein bestimmtes Modell mit den Ergebnissen aus einem gegebenen datenerzeugenden Prozess konsistent ist, z.B. unter Verwendung von Simulation. Zum Beispiel: Ein Modell besagt, dass eine gedrehte Münze mit einer Wahrscheinlichkeit von 0,5 Kopf zeigt. Würde ein Ergebnis von 5 Mal Zahl hintereinander dazu führen, dass Sie das Modell in Frage stellen?"},
{"id": "S-IC.B", "description": "Aus Stichprobenerhebungen, Experimenten und Beobachtungsstudien Schlussfolgerungen ziehen und begründen."},
{"id": "S-IC.B.3", "description": "Die Zwecke von und Unterschiede zwischen Stichprobenerhebungen, Experimenten und Beobachtungsstudien erkennen; erklären, wie sich die Randomisierung auf jeden dieser Bereiche bezieht."},
{"id": "S-IC.B.4", "description": "Daten aus einer Stichprobenerhebung verwenden, um den Mittelwert oder den Anteil einer Grundgesamtheit zu schätzen; eine Fehlermarge durch die Verwendung von Simulationsmodellen für Zufallsstichproben entwickeln."},
{"id": "S-IC.B.5", "description": "Daten aus einem randomisierten Experiment verwenden, um zwei Behandlungen zu vergleichen; Simulationen verwenden, um zu entscheiden, ob Unterschiede zwischen Parametern signifikant sind."},
{"id": "S-IC.B.6", "description": "Auf Daten basierende Berichte bewerten."},
{"id": "S-CP.A", "description": "Unabhängigkeit und bedingte Wahrscheinlichkeit verstehen und zur Interpretation von Daten verwenden."},
{"id": "S-CP.A.1", "description": "Ereignisse als Teilmengen eines Ergebnisraums (der Menge der Ergebnisse) unter Verwendung von Merkmalen (oder Kategorien) der Ergebnisse oder als Vereinigungen, Schnittmengen oder Komplemente anderer Ereignisse („oder“, „und“, „nicht“) beschreiben."},
{"id": "S-CP.A.2", "description": "Verstehen, dass zwei Ereignisse A und B unabhängig sind, wenn die Wahrscheinlichkeit, dass A und B gemeinsam auftreten, das Produkt ihrer Wahrscheinlichkeiten ist, und diese Charakterisierung verwenden, um festzustellen, ob sie unabhängig sind."},
{"id": "S-CP.A.3", "description": "Die bedingte Wahrscheinlichkeit von A gegeben B als P(A und B)/P(B) verstehen und die Unabhängigkeit von A und B so interpretieren, dass die bedingte Wahrscheinlichkeit von A gegeben B dieselbe ist wie die Wahrscheinlichkeit von A, und die bedingte Wahrscheinlichkeit von B gegeben A dieselbe ist wie die Wahrscheinlichkeit von B."},
{"id": "S-CP.A.4", "description": "Zwei-Wege-Häufigkeitstabellen von Daten erstellen und interpretieren, wenn zwei Kategorien mit jedem klassifizierten Objekt verbunden sind. Die Zwei-Wege-Tabelle als Ergebnisraum verwenden, um zu entscheiden, ob Ereignisse unabhängig sind, und um bedingte Wahrscheinlichkeiten anzunähern. Zum Beispiel Daten von einer zufälligen Stichprobe von Schülern Ihrer Schule über ihr Lieblingsfach unter Mathematik, Naturwissenschaften und Englisch sammeln. Die Wahrscheinlichkeit schätzen, dass ein zufällig ausgewählter Schüler Ihrer Schule Naturwissenschaften bevorzugt, gegeben, dass der Schüler in der zehnten Klasse ist. Dasselbe für andere Fächer tun und die Ergebnisse vergleichen."},
{"id": "S-CP.A.5", "description": "Die Konzepte der bedingten Wahrscheinlichkeit und der Unabhängigkeit in der Alltagssprache und in alltäglichen Situationen erkennen und erklären. Zum Beispiel die Wahrscheinlichkeit, Lungenkrebs zu haben, wenn man Raucher ist, mit der Wahrscheinlichkeit vergleichen, Raucher zu sein, wenn man Lungenkrebs hat."},
{"id": "S-CP.B", "description": "Die Regeln der Wahrscheinlichkeit verwenden, um Wahrscheinlichkeiten von zusammengesetzten Ereignissen in einem uniformen Wahrscheinlichkeitsmodell zu berechnen."},
{"id": "S-CP.B.6", "description": "Die bedingte Wahrscheinlichkeit von A gegeben B als den Anteil der Ergebnisse von B, die auch zu A gehören, finden und die Antwort im Sinne des Modells interpretieren."},
{"id": "S-CP.B.7", "description": "Die Additionsregel, P(A oder B) = P(A) + P(B) – P(A und B), anwenden und die Antwort im Sinne des Modells interpretieren."},
{"id": "S-CP.B.8", "description": "Die allgemeine Multiplikationsregel in einem uniformen Wahrscheinlichkeitsmodell, P(A und B) = P(A)P(B|A) = P(B)P(A|B), anwenden und die Antwort im Sinne des Modells interpretieren."},
{"id": "S-CP.B.9", "description": "Permutationen und Kombinationen verwenden, um Wahrscheinlichkeiten von zusammengesetzten Ereignissen zu berechnen und Probleme zu lösen."},
{"id": "S-MD.A", "description": "Erwartungswerte berechnen und zur Problemlösung verwenden."},
{"id": "S-MD.A.1", "description": "Eine Zufallsvariable für eine interessierende Größe definieren, indem jedem Ereignis in einem Ergebnisraum ein numerischer Wert zugewiesen wird; die entsprechende Wahrscheinlichkeitsverteilung grafisch darstellen, unter Verwendung derselben grafischen Darstellungen wie für Datenverteilungen."},
{"id": "S-MD.A.2", "description": "Den Erwartungswert einer Zufallsvariablen berechnen; ihn als den Mittelwert der Wahrscheinlichkeitsverteilung interpretieren."},
{"id": "S-MD.A.3", "description": "Eine Wahrscheinlichkeitsverteilung für eine Zufallsvariable entwickeln, die für einen Ergebnisraum definiert ist, in dem theoretische Wahrscheinlichkeiten berechnet werden können; den Erwartungswert finden. Zum Beispiel die theoretische Wahrscheinlichkeitsverteilung für die Anzahl der richtigen Antworten finden, die durch Raten bei allen fünf Fragen eines Multiple-Choice-Tests erzielt werden, bei dem jede Frage vier Auswahlmöglichkeiten hat, und die erwartete Note unter verschiedenen Bewertungsschemata finden."}
{"id": "S-MD.A.4", "description": "Eine Wahrscheinlichkeitsverteilung für eine Zufallsvariable entwickeln, die für einen Ergebnisraum definiert ist, in dem Wahrscheinlichkeiten empirisch zugewiesen werden; den Erwartungswert finden. Zum Beispiel eine aktuelle Datenverteilung über die Anzahl der Fernsehgeräte pro Haushalt in den Vereinigten Staaten finden und die erwartete Anzahl der Geräte pro Haushalt berechnen. Wie viele Fernsehgeräte würden Sie in 100 zufällig ausgewählten Haushalten erwarten?"},
{"id": "S-MD.B", "description": "Wahrscheinlichkeit verwenden, um die Ergebnisse von Entscheidungen zu bewerten."},
{"id": "S-MD.B.5", "description": "Die möglichen Ergebnisse einer Entscheidung abwägen, indem den Auszahlungswerten Wahrscheinlichkeiten zugewiesen und Erwartungswerte gefunden werden.\nInhalt dieses Standards:\n - Strategien auf der Grundlage von Erwartungswerten bewerten und vergleichen. Zum Beispiel eine Kfz-Versicherung mit hoher Selbstbeteiligung mit einer mit niedriger Selbstbeteiligung vergleichen, unter Verwendung verschiedener, aber angemessener Wahrscheinlichkeiten für einen kleinen oder großen Unfall.\n - Die erwartete Auszahlung für ein Glücksspiel finden. Zum Beispiel die erwarteten Gewinne aus einem staatlichen Lotterielos oder einem Spiel in einem Fast-Food-Restaurant finden."},
{"id": "S-MD.B.5a", "description": "Die erwartete Auszahlung für ein Glücksspiel finden. Zum Beispiel die erwarteten Gewinne aus einem staatlichen Lotterielos oder einem Spiel in einem Fast-Food-Restaurant finden."},
{"id": "S-MD.B.5b", "description": "Strategien auf der Grundlage von Erwartungswerten bewerten und vergleichen. Zum Beispiel eine Kfz-Versicherung mit hoher Selbstbeteiligung mit einer mit niedriger Selbstbeteiligung vergleichen, unter Verwendung verschiedener, aber angemessener Wahrscheinlichkeiten für einen kleinen oder großen Unfall."},
{"id": "S-MD.B.6", "description": "Wahrscheinlichkeiten verwenden, um faire Entscheidungen zu treffen (z.B. durch Losentscheid, Verwendung eines Zufallszahlengenerators)."},
{"id": "S-MD.B.7", "description": "Entscheidungen und Strategien mithilfe von Wahrscheinlichkeitskonzepten analysieren (z.B. Produkttests, medizinische Tests, das Herausnehmen eines Eishockeytorwarts am Ende eines Spiels)."},
{"id": "K", "description": "Kindergarten"},
{"id": "1", "description": "1. Klasse"},
{"id": "2", "description": "2. Klasse"},
{"id": "3", "description": "3. Klasse"},
{"id": "4", "description": "4. Klasse"},
{"id": "5", "description": "5. Klasse"},
{"id": "6", "description": "6. Klasse"},
{"id": "7", "description": "7. Klasse"},
{"id": "8", "description": "8. Klasse"},
{"id": "HS", "description": "Sekundarstufe II"},
{"id": "N", "description": "Zahl und Größen"},
{"id": "A", "description": "Algebra"},
{"id": "F", "description": "Funktionen"},
{"id": "M", "description": "Modellieren"},
{"id": "G", "description": "Geometrie"},
{"id": "S", "description": "Statistik & Wahrscheinlichkeit"},
{"id": "K.CC", "description": "Zählen & Kardinalität"},
{"id": "K.OA", "description": "Operationen & Algebraisches Denken"},
{"id": "K.NBT", "description": "Zahlen & Operationen im Zehnersystem"},
{"id": "K.MD", "description": "Messen & Daten"},
{"id": "K.G", "description": "Geometrie"},
{"id": "1.OA", "description": "Operationen & Algebraisches Denken"},
{"id": "1.NBT", "description": "Zahlen & Operationen im Zehnersystem"},
{"id": "1.MD", "description": "Messen & Daten"},
{"id": "1.G", "description": "Geometrie"},
{"id": "2.OA", "description": "Operationen & Algebraisches Denken"},
{"id": "2.NBT", "description": "Zahlen & Operationen im Zehnersystem"},
{"id": "2.MD", "description": "Messen & Daten"},
{"id": "2.G", "description": "Geometrie"},
{"id": "3.OA", "description": "Operationen & Algebraisches Denken"},
{"id": "3.NBT", "description": "Zahlen & Operationen im Zehnersystem"},
{"id": "3.NF", "description": "Zahlen & Operationen - Brüche: Die Erwartungen für die 3. Klasse in diesem Bereich sind auf Brüche mit den Nennern 2, 3, 4, 6 und 8 beschränkt."},
{"id": "3.MD", "description": "Messen & Daten"},
{"id": "3.G", "description": "Geometrie"},
{"id": "4.OA", "description": "Operationen & Algebraisches Denken"},
{"id": "4.NBT", "description": "Zahlen & Operationen im Zehnersystem: Die Erwartungen für die 4. Klasse in diesem Bereich sind auf ganze Zahlen kleiner oder gleich 1.000.000 beschränkt."},
{"id": "4.NF", "description": "Zahlen & Operationen - Brüche: Die Erwartungen für die 4. Klasse in diesem Bereich sind auf Brüche mit den Nennern 2, 3, 4, 5, 6, 8, 10, 12 und 100 beschränkt."},
{"id": "4.MD", "description": "Messen & Daten"},
{"id": "4.G", "description": "Geometrie"},
{"id": "5.OA", "description": "Operationen & Algebraisches Denken"},
{"id": "5.NBT", "description": "Zahlen & Operationen im Zehnersystem"},
{"id": "5.NF", "description": "Zahlen & Operationen - Brüche"},
{"id": "5.MD", "description": "Messen & Daten"}
{"id": "5.G", "description": "Geometrie"},
{"id": "6.RP", "description": "Verhältnisse & Proportionale Beziehungen"},
{"id": "6.NS", "description": "Das Zahlensystem"},
{"id": "6.EE", "description": "Terme & Gleichungen"},
{"id": "6.G", "description": "Geometrie"},
{"id": "6.SP", "description": "Statistik & Wahrscheinlichkeit"},
{"id": "7.RP", "description": "Verhältnisse & Proportionale Beziehungen"},
{"id": "7.NS", "description": "Das Zahlensystem"},
{"id": "7.EE", "description": "Terme & Gleichungen"},
{"id": "7.G", "description": "Geometrie"},
{"id": "7.SP", "description": "Statistik & Wahrscheinlichkeit"},
{"id": "8.NS", "description": "Das Zahlensystem"},
{"id": "8.EE", "description": "Terme & Gleichungen"},
{"id": "8.F", "description": "Funktionen"},
{"id": "8.G", "description": "Geometrie"},
{"id": "8.SP", "description": "Statistik & Wahrscheinlichkeit"},
{"id": "N-RN", "description": "Das System der reellen Zahlen"},
{"id": "N-Q", "description": "Größen"},
{"id": "N-CN", "description": "Das System der komplexen Zahlen"},
{"id": "N-VM", "description": "Vektor- & Matrixgrößen"},
{"id": "A-SSE", "description": "Struktur in Termen erkennen"},
{"id": "A-APR", "description": "Rechnen mit Polynomen & rationalen Termen"},
{"id": "A-CED", "description": "Gleichungen erstellen"},
{"id": "A-REI", "description": "Argumentieren mit Gleichungen & Ungleichungen"},
{"id": "F-IF", "description": "Funktionen interpretieren"},
{"id": "F-BF", "description": "Funktionen erstellen"},
{"id": "F-LE", "description": "Lineare, quadratische & exponentielle Modelle"},
{"id": "F-TF", "description": "Trigonometrische Funktionen"},
{"id": "G-CO", "description": "Kongruenz"},
{"id": "G-SRT", "description": "Ähnlichkeit, Rechtwinklige Dreiecke & Trigonometrie"},
{"id": "G-C", "description": "Kreise"},
{"id": "G-GPE", "description": "Geometrische Eigenschaften mit Gleichungen ausdrücken"},
{"id": "G-GMD", "description": "Geometrisches Messen & Dimension"},
{"id": "G-MG", "description": "Modellieren mit Geometrie"},
{"id": "S-ID", "description": "Kategoriale & Quantitative Daten interpretieren"},
{"id": "S-IC", "description": "Schlussfolgerungen ziehen & Begründen"},
{"id": "S-CP", "description": "Bedingte Wahrscheinlichkeit & die Regeln der Wahrscheinlichkeit"},
{"id": "S-MD", "description": "Wahrscheinlichkeit für Entscheidungen nutzen"}
